[
    {
        "title": "Muted Q1 earnings point to weakening micro: Is the easy money phase over?",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/muted-q1-earnings-point-to-weakening-micro-is-the-easy-money-phase-over/articleshow/123072152.cms",
        "text": "Let’s start with banking\n\nLive Events\n\nTurning to IT — another sector with equally disappointing earnings.\n\nFor investors, these are not easy times to navigate\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWe are now exactly at the halfway mark of the earnings season. Among BSE 500 companies, nearly 50% have declared their results for the June quarter. So far, the earnings trend has been underwhelming — far from anything to write home about.Of course, no one expected blockbuster results this quarter. Even on that muted backdrop, the reported numbers have largely disappointed. Given the election-related disruptions in the base quarter last year, many had expected a natural tailwind from the low base effect to support growth this quarter.Instead, we’re seeing several companies struggle to post even modest growth. This implies that the current softness may not be a one-off. If it's not just a passing blip, are we staring at a deeper growth challenge for the economy in the medium term?To better understand the underlying trends, it’s useful to look at key takeaways from the management commentaries of some prominent companies that have reported earnings so far.The surprise here isn’t muted credit growth — that has been subdued for a few quarters now. There was no respite from that trend this quarter either, despite a recovery in overall sentiment. In fact, credit growth has fallen further over the past three months.From hovering around mid-teen levels in Q4 FY24, credit growth has sharply declined to single digits in this quarter, after staying in the low teens for the past three quarters. However, the bigger negative surprise came from commentary around the unsecured segment — particularly from the management of leading NBFCs and banks.Managements have raised red flags over the unsecured loan book in MSME and business loan segments. They are pointing to over-leveraged customers (loans from multiple banks), which could hit credit quality and severely impact growth in the coming months. This signals growing stress in the MSME segment, which could significantly constrain growth if the pressure continues.Deteriorating asset quality and rising slippages in MSME retail loans across banks support this concern. Combined with continued stress in the microfinance segment and a general credit slowdown, the prospects of a sharp economic rebound look dim.For banks, pressure on Net Interest Margins (NIMs) couldn’t have come at a worse time. With successive rate cuts, lending rates have declined, while deposit rates lag behind — squeezing NIMs in the short term.This pressure is emerging just when growth is scarce and credit costs are rising (due to higher provisions), severely impacting profitability for many banks. Not to forget, banking stocks were the consensus buy at the beginning of the quarter — seen as undervalued plays amid the market’s sharp recovery from March lows. Unfortunately, earnings told a different story. The wait for a much-anticipated rerating in banking stocks only gets longer.Circling back to asset quality in retail, further evidence of stress is visible in the credit card segment. While the slowdown in new credit card additions is well known, growing delinquencies have not received as much attention. Based on the Portfolio at Risk (PAR) metric, long-term delinquencies (PAR over 90 days) have surged to 15%, indicating rising repayment pressure among overdue accounts.Bellwether companies reported sequential declines in both revenue and profitability. With muted guidance from major players, we are looking at another year of low single-digit dollar revenue growth. But that’s only part of the story.While revenues may inch up, the real pain lies in job losses triggered by productivity gains from the AI push. If TCS’s recent 2% layoff announcement is followed by others in the industry, the second-order effects on broader economic activity could be ominous. Coming at a time when MSMEs are already under stress — as echoed in banks’ commentary — the medium-term growth outlook is looking increasingly fragile.That said, the economy does have some bright spots.There are no complaints about the agriculture sector’s growth prospects, given the robust monsoon outlook this year. While this alone cannot offset the potential slowdown in consumption, it can offer some relief — especially if backed by sustained government capital expenditure (capex), which remains critical given the weakness in private capex. Government capex had been a strong driver until FY24, but last year exposed its limitations. Capacity constraints in traditional infrastructure segments like roads, railways, and general infra have started to impact execution. In response, the government is exploring new areas — such as urban water infrastructure (including wastewater treatment) and shipbuilding — to accelerate capex. If successful, these efforts could significantly improve the economic outlook.While benign macro conditions are helping prevent sharp market corrections, weakening micro fundamentals may keep markets in check and delay the breakout many are hoping for.In such an environment, investors must adopt a stock-specific approach — seeking bottom-up opportunities. The era of easy money appears to be behind us. Going forward, spotting the next winners will depend more on skill than luck.(The author, ArunaGiri N is the Founder CEO & Fund Manager at TrustLine Holdings)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Top 9 Stocks in Singapore Govt’s India Portfolio that surge up to 60% in FY26 so far",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/top-9-stocks-in-singapore-govts-india-portfolio-that-surge-up-to-60-in-fy26-so-far/slideshow/123072081.cms",
        "text": "Samhi Hotels\n\nThe stock surged 61% so far this fiscal year, reaching Rs 227. The Government of Singapore (GoS) holds a 7.68% stake as of the June 2025 quarter."
    },
    {
        "title": "Mcap of 7 of top-10 valued firms erodes by Rs 1.35 lakh cr; TCS biggest laggard",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-valued-firms-erodes-by-rs-1-35-lakh-cr-tcs-biggest-laggard/articleshow/123071947.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe combined market valuation of seven of the 10 most valued firms eroded by Rs 1.35 lakh crore last week, with Tata Consultancy Services (TCS) taking the biggest hit.Last week, the BSE benchmark tanked 863.18 points or 1.05 per cent.TCS, Bharti Airtel Life Insurance Corporation of India (LIC) and Bajaj Finance faced a combined erosion of Rs 1,35,349.93 crore from their market valuation last week.However, Reliance Industries HDFC Bank and Hindustan Unilever saw an increase in their mcap. Together, these three firms added Rs 39,989.72 crore in market valuation.The valuation of TCS tumbled Rs 47,487.4 crore to Rs 10,86,547.86 crore.The market capitalisation (mcap) of Bharti Airtel eroded by Rs 29,936.06 crore to Rs 10,74,903.87 crore.Bajaj Finance's valuation tanked Rs 22,806.44 crore to Rs 5,44,962.09 crore and that of Infosys dropped by Rs 18,694.23 crore to Rs 6,10,927.33 crore.The mcap of State Bank of India declined by Rs 11,584.43 crore to Rs 7,32,864.88 crore.ICICI Bank faced an erosion of Rs 3,608 crore to Rs 10,50,215.14 crore from its market valuation while LIC lost Rs 1,233.37 crore to Rs 5,59,509.30 crore.However, Hindustan Unilever Ltd added Rs 32,013.18 crore, taking its valuation to Rs 5,99,462.97 crore.The mcap of HDFC Bank jumped Rs 5,946.67 crore to Rs 15,44,025.62 crore and that of Reliance Industries Ltd climbed Rs 2,029.87 crore to Rs 18,85,885.39 crore.Reliance Industries remained the most valued firm, followed by HDFC Bank, TCS, Bharti Airtel, ICICI Bank, State Bank of India, Infosys, Hindustan Unilever, LIC and Bajaj Finance."
    },
    {
        "title": "PNB Housing Finance, RBL Bank among 10 small-cap stocks where FIIs increased stake in Q1",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-housing-finance-rbl-bank-among-10-small-cap-stocks-where-fiis-increased-stake-in-q1/slideshow/123071933.cms",
        "text": "Foreign institutional investors (FIIs) raised their holdings in several small-cap stocks during the first quarter of FY26, indicating growing confidence in select Indian companies. According to data from StockEdge, here are 10 Nifty500 firms where FIIs significantly increased their stake:\n\n"
    },
    {
        "title": "8 penny stocks surged 50-150% in just four months, do you own any?",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/8-penny-stocks-surged-50-150-in-just-four-months-do-you-own-any/slideshow/123071790.cms",
        "text": "In the first four months of FY26 so far, eight penny stocks have delivered impressive returns, surging between 50% and 150%. Notably, three of them delivered returns that more than doubled investors’ wealth during this period. These top performers were identified using a specific screening method: each stock had a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This selective approach helps highlight low-priced, actively traded small-cap stocks showing strong price momentum. (Data Source: ACE Equity).\n\n\n\nPenny stocks often catch the eye because they are cheap and can grow very quickly. But while the gains can be big, the risks are just as high. These stocks usually don’t trade much, their prices can swing wildly, and there’s often little clear financial information available. So, investors need to be careful—making money in penny stocks takes more than luck. It needs a smart plan and careful risk control."
    },
    {
        "title": "Arcil Investors to offload 32.57% stake via IPO",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/arcil-investors-to-offload-32-57-stake-via-ipo/articleshow/123071609.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNew York-based Avenue Capital Group State Bank of India , an affiliate of Singapore's GIC , and Federal Bank will sell 105.4 million shares, a 32.57% stake in Asset Reconstruction Company (India) Ltd (Arcil), marking the first initial public offering by a bad loan aggregator in India.The company filed its draft red herring prospectus (DRHP) with the Securities and Exchange Board of India (Sebi) on Saturday.Avenue, which currently holds a 69.73% stake in the company, will sell 68.7 million shares, reducing its holding to 48.57%. SBI will offload 19.4 million shares, trimming its stake from 19.95% to 13.96%, as per the DRHP. GIC affiliate Lathe Investment will fully exit the company by selling its 5% stake (16.2 million shares), while Federal Bank will sell 1 million shares, lowering its holding to 0.95% from 1.27%.Arcil is not issuing any fresh shares in the IPO. IIFL Capital, IDBI Capital, and JM Financial are the lead managers to the issue.Established in 2002, Arcil was India’s first asset reconstruction company, backed by banks such as IDBI Bank , SBI, and ICICI Bank . It is currently the second-largest ARC in India by assets under management (Rs 15,230 crore). The company generates revenue through management and trusteeship fees, portfolio recovery fees, investment income, and write-backs.Over the years, several banks have exited the company, with Avenue acquiring most of their stakes. At present, Avenue and SBI are the promoters, jointly holding 89.68% of the company.In 2022, Avenue Capital acquired a 44.6% stake from ICICI Bank, IDBI Bank, and ICICI Home Finance for nearly Rs 840 crore (Rs 58 per share). Punjab National Bank was the latest to exit, selling its 10% stake in March 2023 at Rs 60.53 per share.For the fiscal year ended March 31, 2025, Arcil reported a net profit of Rs 355.31 crore on revenue from operations of Rs 596.42 crore.As of March 2025, it had acquired total principal debt of Rs 72,657.30 crore at a cost of Rs 38,155.63 crore or 52.51% of the principal amount and had made recoveries worth Rs 28,459.70 crore.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Q1 results this week: Bharti Airtel, Trent, BSE, Adani Ports, and LIC among 128 companies to announce earnings",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/q1-results-this-week-bharti-airtel-trent-bse-adani-ports-and-lic-among-128-companies-to-announce-earnings/articleshow/123071594.cms",
        "text": "4th August\n\n\n\n5th August\n\n\n\n6th August\n\n\n\nLive Events\n\n7th August\n\n8th August\n\n\n\n9th August\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndia Inc’s Q1 FY26 earnings season continues, with 128 companies scheduled to announce their financial results this week. Among the key names to watch are DLF BSE , Life Insurance Corporation ( LIC ), Sun TV Network , Titan, and Tata Motors Aditya Birla Capital, Akzo Nobel India, Aurobindo Pharma, Bosch, DLF, Escorts Kubota, Godfrey Phillips India, Inox India, Kansai Nerolac Paints, Marico, Shree Cement, Sona BLW Precision Forgings, Sumitomo Chemical India, Tata Investment Corporation, TBO Tek, and Triveni Turbine.Adani Ports and Special Economic Zone, Alembic Pharmaceuticals, Berger Paints India, Bharti Airtel, Bharti Hexacom, BLS International Services, Britannia Industries, Castrol India, CCL Products (India), Container Corporation of India, EIH, Eris Lifesciences, Exide Industries, Gland Pharma, Godawari Power and Ispat, Gujarat Fluorochemicals, Gujarat Gas, Jindal Saw, Lupin, NCC, Prestige Estates Projects, Sheela Foam, and Torrent Power.Bajaj Auto, Bajaj Holdings & Investment, Bayer CropScience, Bharat Forge, Bharat Heavy Electricals, Blue Star, Cera Sanitaryware, Divi's Laboratories, E.I.D. - Parry (India), Fortis Healthcare, Godrej Agrovet, Gujarat Narmada Valley Fertilizers & Chemicals, Hero MotoCorp, Housing & Urban Development Corporation, Ircon International, Jindal Stainless, Jyoti CNC Automation, K.P.R. Mill, Kirloskar Oil Engines, Krishna Institute of Medical Sciences, Pidilite Industries, Power Finance Corporation, PVR Inox, Raymond Lifestyle, Raymond, Rites, SKF India, Trent, UNO Minda.3M India, Apollo Tyres, Biocon, Birlasoft, BSE, Caplin Point Laboratories, Carborundum Universal, Century Plyboards (India), Crompton Greaves Consumer Electricals, Cummins India, Data Patterns (India), Emcure Pharmaceuticals, General Insurance Corporation of India, Global Health, Godrej Consumer Products, Gujarat State Fertilizers & Chemicals, Hindustan Petroleum Corporation, Kalpataru Projects International, Kalyan Jewellers India, Life Insurance Corporation of India, Linde India, Max Financial Services, Metro Brands, Metropolis Healthcare, MMTC, National Aluminium Company, NBCC (India), NLC India, Page Industries, Sai Life Sciences, Schneider Electric Infrastructure, Shree Renuka Sugars, Solar Industries India, Sun TV Network, The Ramco Cements, Titan Company, Varroc Engineering.Action Construction Equipment, Afcons Infrastructure, Cholamandalam Financial Holdings, DOMS Industries, Fine Organic Industries, Garden Reach Shipbuilders & Engineers, Garware Technical Fibres, Grasim Industries, IFCI, Info Edge (India), Lemon Tree Hotels, Manappuram Finance, PG Electroplast, Poly Medicure, PTC Industries, RHI Magnesita India, Shipping Corporation Of India, Star Cement, State Bank Of India, Tata Motors, Voltas, Wockhardt.HBL Engineering"
    },
    {
        "title": "Trump tariff, RBI policy, FII selloff among 5 factors to impact stock market this week",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-tariffs-rbi-policy-fii-selloff-among-5-factors-to-impact-stock-markets-this-week/articleshow/123071550.cms",
        "text": "1. RBI policy\n\nLive Events\n\n2. Dollar strength\n\n3. Trump’s tariff salvo\n\n4. FII outflows and rising short bets\n\n5. Q1 earnings disappoint\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe domestic stock market is set to enter a pivotal week after notching their worst five-week run since 2023, as a confluence of global and domestic pressures, from fresh U.S. tariffs and a surging dollar to relentless foreign outflows and weak corporate earnings , weigh on investor sentiment . Market participants will be closely watching the Reserve Bank of India’s policy decision, as well as diplomatic manoeuvring around India’s trade ties with the U.S., for cues on direction.The Nifty 50 dropped 0.82% to 24,565.35 and the Sensex declined 0.72% to 80,599.91 on Friday, capping a 1.1% weekly loss. It marked the fifth straight week of declines, the longest losing streak for both indices in two years.The Reserve Bank of India’s Monetary Policy Committee meets from August 4 to 6, with mounting expectations of a 25 basis points rate cut. A report by the State Bank of India said that a frontloaded cut in August could bring an “early Diwali” by boosting credit growth, especially as the FY26 festive season is frontloaded.Ajit Mishra, SVP, Research at Religare Broking, said, “At the domestic level, all eyes will be on the Reserve Bank of India’s monetary policy meeting on August 8,” noting that “the central bank’s commentary on inflation, liquidity, and growth outlook will be keenly watched. A dovish tilt could offer support to rate-sensitive sectors.”The dollar index surged 2.5% last week to cross the 100 mark, reaching a two-month high and registering its strongest weekly gain in nearly three years. The greenback’s rally has intensified foreign investor outflows and pushed up the cost of foreign currency borrowing.The sharp appreciation in the dollar has added pressure on emerging market assets, including India, exacerbating concerns around capital flight.Investor confidence took a hit after U.S. President Donald Trump signed an executive order imposing a 25% tariff on Indian goods, sharper than anticipated, and reaffirmed penalties on nearly 70 countries. While India avoided additional sanctions related to its Russian defence and energy ties, the broader move heightened fears over protectionism and its fallout on global trade.India, for its part, is expected to continue oil imports from Russia. “These are long-term oil contracts,” a government official told Reuters. “It is not so simple to just stop buying overnight.” Another official confirmed to Reuters that India would maintain its energy engagements with Moscow despite U.S. threats.Trump last month warned on Truth Social of “additional penalties” over India's Russian deals.Markets will be closely tracking diplomatic developments around the proposed U.S.-India trade deal this week. Ajit Mishra noted that “policymakers are expected to respond diplomatically ahead of the next scheduled discussions.”Foreign Institutional Investors have remained persistent sellers, pulling out over Rs 27,000 crore across the past nine trading sessions. On Thursday alone, FIIs net sold equities worth Rs 5,588.91 crore.The pullback coincides with record bearish positioning. Short interest in index futures has surged to 90%, the highest since March 2023, while the long-to-short ratio has slipped to just 0.11 in the August series. Nifty rollovers also dropped to 75.71% in July, down from 79.53% in June.“The market oscillated between cautious optimism and defensive positioning, ultimately ending lower due to a persistent FII outflow,” said Vinod Nair, Head of Research at Geojit Investments. “With global headwinds, investors showed a preference for domestically driven stories with non-discretionary appeal, as broader sentiment turned selective.”“Going forward, investors will closely monitor the upcoming RBI rate decision next week, while the risks remain tilted to the downside,” Nair added. “A stable inflation outlook, potential progress in trade talks, and selective strength in domestic sectors are anticipated to lay the groundwork for a recovery.”The first-quarter earnings season has offered little cheer, with several major stocks reacting negatively to results . The Nifty IT index has slumped 10% in the past month, while Nifty Bank has remained broadly flat.According to an Economic Times report, India’s top nine private sector banks posted just 2.7% year-on-year profit growth in Q1, underlining tepid credit demand and the broader impact of muted economic activity.“Domestic equity market navigated a volatile week marked by heightened uncertainty surrounding trade negotiations and subdued earnings,” said Nair of Geojit Investments.Also read | NSE reaches Rs 40 crore settlement with Sebi over data disclosure case (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Arcil IPO: Avenue, SBI to reduce stake, GIC affiliate to exit",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/arcil-ipo-avenue-sbi-to-reduce-stake-gic-affiliate-to-exit/articleshow/123062192.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNew York based Avenue Capital Group State Bank of India (SBI), Singapore's GIC owned Lathe Investment and Federal Bank will sell an aggregate of 10.54 crore shares in Arcil Ltd in what will be the first initial public offer (IPO) for a bad loan aggregator in India.The company filed its Draft Red Herring Prospectus (DRHP) with the Securities and Exchange Board of India (SEBI) on Saturday. Avenue which holds 69.73% of equity in the company will sell 6.87 crore shares, diluting its stake to 48.57% while SBI will sell 1.94 crore shares to reduce its holding to 13.96% from 19.95%, GIC affiliate Lathe Investment will completely exit the company by selling all it 5% stake or 1.62 crore shares, the DRHP showed.Another bank shareholder Federal Bank will sell 10 lakh shares to reduce its stake to 0.95% from 1.27%. The entire issue is an offer for sale by existing shareholders with no fresh shares being issued.IIFL Capital, IDBI Capital and JM Financial are the bankers to the issue.Formed in 2002, Asset Reconstruction Company (India) Ltd was the first asset reconstruction company in India, backed by banks like IDBI Bank , SBI and ICICI Bank . Currently Avenue and SBI are identified as promoters of the company, together holding 89.68% of the shares.Arcil has been in operations for more than two decades. Over the years banks have exited the ARC mostly selling stake to Avenue.In 2022, Avenue Capital acquired 44.6% in the company from ICICI Bank, IDBI Bank and ICICI Home Finance for a consideration of nearly ₹840 crore.Arcil is currently the second largest in terms of assets under management (AUM) aming ARCs in India with Rs 15,230.031 crores. It earns its revenue from management fees/ trusteeship fees, portfolio recovery fees, income from investments and write backs.IDBI Bank sold its 19.18%, ICICI Bank 13.26% while ICICI Bank's housing finance sold its 2.26% at Rs 58 a share, a Rs 48 premium to the Rs 10 face value. Punjab National Bank was the latest to sell its 10% stake in March 2023 at Rs 60.53 apiece. It remains to be seen what price the shareholders decide to sell their stake at.In the year ended March 2025, the revenue from operations for Arcil were at Rs 596.42 crore with a profit after tax of Rs 355.31 crore.As of March 2025, had acquired Rs 72,657.30 crore in total principal debt at a cost of Rs 38,155.63 crore or 52.51% of the total principal debt and made recoveries of Rs 28,459.70 crore."
    },
    {
        "title": "Indian stock market crash coming? Trump’s 25% tariff explained",
        "url": "https://economictimes.indiatimes.com/markets/stocks/indian-stock-market-crash-coming-trumps-25-tariff-explained/videoshow/123061527.cms",
        "text": "Find this comment offensive?\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nName\n\nReason for reporting:\n\nFoul language\n\nSlanderous\n\nInciting hatred against a certain community"
    },
    {
        "title": "JSW Cement cuts IPO size to Rs 3,600 cr; public offer to open on August 7",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/jsw-cement-cuts-ipo-size-to-rs-3600-cr-public-offer-to-open-on-august-7/articleshow/123061178.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nJSW Cement, part of Sajjan Jindal-promoted diversified JSW Group , is set to launch its truncated Rs 3,600-crore initial public offering (IPO) on August 7.The total size of the issue, however, is lower than the earlier proposed issue of up to Rs 4,000 crore, according to the latest RHP ..The IPO will open for public subscription on August 7 and closes on August 11, while the anchor investor bidding date would be August 6 for JSW Cement, according to the Red Herring Prospectus (RHP) filed on Friday.The initial share sale comprises a fresh issue of equity shares worth Rs 1,600 crore and an Offer for Sale of shares worth up to Rs 2,000 crore by investor shareholders.As a part of the OFS, private equity giant Apollo Management , through its affiliate AP Asia Opportunistic Holdings Pte Ltd, will be offloading shares worth Rs 931.80 crore, Synergy Metals Investments Holding Ltd will sell shares worth Rs 938.50 crore, and State Bank of India ( SBI ) will divest shares valued at Rs 129.70 crore.Synergy Metals Investments Holding is an arm of Synergy Metals and Mining Fund, a private equity fund set up by a former executive of steelmaker ArcelorMittal, Sudhir Maheshwari, in 2015.As per draft papers, the company will utilise proceeds worth Rs 800 crore to part-finance a new integrated cement unit at Nagaur, Rajasthan, and Rs 520 crore on prepayment or repayment of outstanding borrowings availed by it. The rest would be used for general corporate purposes.The Mumbai-based company had earlier planned to raise Rs 4,000 crore. At the time of filing papers, JSW Cement said it intended to raise Rs 2,000 crore from a fresh issue of equity shares and an offer for sale (OFS) of Rs 2,000 crore by investor shareholders.However, the size of the fresh capital-raising has been cut by Rs 400 crore from the fresh issue, as per the latest RHP.In August 2024, JSW Cement filed preliminary IPO papers with Sebi, and later in September, the regulator kept the company's proposed initial share-sale on hold. On January 6, this year, the regulator finally gave its observation to float the IPO.As of March 31, 2025, JSW Cement's total borrowings stood at Rs 6,166.6 crore.On the financial front, the company's revenue from operations for FY25 stood at Rs 5,813.1 crore against Rs 6,028.10 crore in FY24, and Rs 5,836.72 crore in FY23.The company reported a loss of Rs 163.77 crore in FY25. Its profit was Rs 62 crore in FY24 and Rs 104 crore in FY23.As of March 31, 2025, JSW Cement had an installed grinding capacity of 20.60 million metric tonnes per annum (MMTPA).According to the CRISIL report, JSW Cement is India's largest manufacturer of ground granulated blast furnace slag (GGBS), an eco-friendly product produced entirely from blast furnace slag (a by-product of the steel manufacturing process), with a market share in terms of GGBS sales of 84 per cent in FY25.The company presently operates manufacturing operations at units based at Vijayanagar in Karnataka, Nandyal in Andhra Pradesh, Salboni in West Bengal, Jajpur in Odisha and Dolvi in Maharashtra.JSW Cement through its subsidiary Shiva Cement operates a clinker unit in Odisha. Axis Capital Ltd , Citigroup Global Markets India Pvt Ltd, DAM Capital Advisors Ltd , Goldman Sachs (India) Securities Pvt Ltd, Jefferies India Pvt Ltd, Kotak Mahindra Capital Company Ltd and SBI Capital Markets Ltd are responsible for managing the company's IPO process.The company's shares will be listed on the BSE and NSE. PTI"
    },
    {
        "title": "Federal Bank Q1 Results: Standalone net profit falls 15% YoY to Rs 862 crore; NII up 2%",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/federal-bank-q1-results-standalone-net-profit-falls-15-yoy-to-rs-862-crore-nii-up-2/articleshow/123060823.cms",
        "text": "Synopsis\n\nFederal Bank reported a net profit of Rs 861.75 crore, a 14.6% YoY decrease, despite a 2% rise in net interest income to Rs 2,336.83 crore. The bank achieved its highest-ever other income of Rs 1,113 crore, up 21.6%. Total deposits grew by 8.03%, and net advances increased by 9.24%, driven by strong growth in retail and commercial banking loans."
    },
    {
        "title": "Small cars and two-wheelers face demand pain: Sudip Bandyopadhyay",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/small-cars-and-two-wheelers-face-demand-pain-sudip-bandyopadhyay/articleshow/123060750.cms",
        "text": "ET Now: Let us talk about the auto space because today all eyes have been on the entire auto sales numbers. So far, we have numbers coming in from a lot of players and so far, the only thing that we seeing below estimates as of now is the M&M tractor segment and what has beaten estimates is M&M Auto, Ashok Leyland, TVS Motors, and Tata Motors CV. So, largely mixed set of numbers coming in so far because a lot of them are in line as well. What is your take on the kind of auto sales numbers we have seen and how have they fared versus your expectations?\n\n\n\nET Now: Why we are talking about pharma, Sharan just said that Trump is actually doing everything he has promised and earlier he has also at least warned the street about a 200% of tariff. To what extent do you think that could actually turn to fruition, anything that can happen on that front, where are you seeing the impact on our pharma sector back home?\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nSudip Bandyopadhyay, Group Chairman, Inditrade Capital , says the small cars as well as two-wheeler there is a challenge, and we know that, there was a demand constraints and everybody was talking about that. We are hoping that festive season, post monsoon things will improve.Well, pretty much it is in line with the expectation I would say, at least that is what we were pencilling in. We were reasonably sure that the commercial vehicle numbers would be in line and better and improving and that is pretty much what the Ashok Leyland numbers shows. Even if you look at Eicher Motors , their commercial vehicle part does show promise and improvement. As far as domestic two-wheeler sales are concerned, obviously, it is subdued. Look at the Bajaj numbers. They are really bad. Of course, Bajaj has a fantastic export performance which takes care and that is why the overall numbers for Bajaj still looks better. But the small cars as well as two-wheeler there is a challenge, and we know that, there was a demand constraints and everybody was talking about that. We are hoping that festive season, post monsoon things will improve. We will have to wait and watch, that is pretty much what it is. As things stand today, there is a problem as far as demand for small cars as well as two wheelers.Well, one thing is very sure that as long as Mr Trump is the president, volatility is the order of the day and we have to be bracing ourselves for that. Every day there is something new and some new tweet comes in or some communication, an interview comes in which kind of rattles the market and that is the order of the day. As far as pharma is concerned, putting a tariff 200% or otherwise is not a viable proposition for us and the consumers which Trump is trying to protect. So, he will not venture there. But yesterday's and today's initiative where he has written to the pharma company CEOs to bring down the prices in US, that is a threat definitely and some of the Indian companies who have large business in US definitely will be impacted. If he carries out some other measure, some other punitive measure, or some other steps he takes to ensure that his communication is adhered to, that is a matter of big concern and worry. So, under these circumstances, and this view I have been maintaining for some time, it is better to be a little careful about companies having significant exposure in the US market and focus on companies who have less or no exposure as far as US markets are concerned. So, we were just talking about Mankind Pharma , that is one company which has got 95% of the sales in India and results were decent. So, one can focus on companies like this who have got a significant domestic presence and limited US presence."
    },
    {
        "title": "Tariff uncertainty to keep markets on edge; healthcare seen as safer bet: Rajesh Palviya",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/tariff-uncertainty-to-keep-markets-on-edge-healthcare-seen-as-safer-bet-rajesh-palviya/articleshow/123059840.cms",
        "text": "ET Now: Yes, there were a lot of uncertainties while we started the week, but at the end of the week, we have some clarity, but with the clarity, we still have the volatility in the market. What should be the strategy for the next week?\n\n\n\nLive Events\n\nET Now: One more sector which I would like to discuss with you. The pharmaceutical space was doing really well over the last two weeks, and then came the news. Donald Trump again. He demanded that drug companies slash prices to blow to industries. Trump did escalate his campaign to pressure pharmaceutical companies to lower drug prices to the extent that he was sending letters to 17 of the world's largest drug makers demanding they charge the US what other countries pay for new medicines. Now, on the back of this, there was an impact in domestic pharma companies as well. We were waiting for an opportunity to enter in the pharma space. Does this feel like an opportunity and should the view be to enter the pharma space if we get an opportunity like this?\n\n\n\nET Now: So, what are your stock calls?\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nLooking at the supply pressure throughout the week, Nifty and Bank Nifty are now both trading below their 50-day moving average. The uncertainty surrounding tariffs has created some nervousness in the market and supply pressure across sectors. As a result, Nifty and Bank Nifty are both trading below their important support areas.Nifty has broken the 24,600 support level on a closing basis. If the index continues to trade below 24,600 in the coming week, we may see further unwinding pressure, with a possible down move extending towards the 100-day moving average, which is placed around the 24,380 zone. This could be the next level where Nifty may correct further from the current level.On the higher side, until the Nifty does not manage to cross above the 24,750, 24,800 level, the trend is likely to exhibit on the bearish side for the near-term perspective. Even for the Bank Nifty , 56,000 is the crucial resistance area on the higher side. So, if at all we need to have some comfort zone in the Bank Nifty, it has to cross 56,000 level on a closing basis, then only we may see some short covering action, till we are not able to regain above 56,000, maybe some more supply pressure we could see in Bank Nifty also, 55,500 is the immediate put base support area. If it breaks, then a possible downside move can extend towards 55,200 also. Even on the rollover activity also we have seen that Nifty has witnessed around 75.7% rollover, which is lower than the last three months and six-month average. So, shorts are still carried in the system for the Nifty as well as for the Bank Nifty, which may create further pressure in the next couple of days. So, it is going to be a slightly bearish opening for the next week as well, based on the technical as well as the derivative setup.There is a selloff in most of the pharma stocks, but still, if you analyse, like healthcare sector is still holding the ground at a higher level. So, if anyone wants to bet on at this current juncture, healthcare would be the right bet in the pharma as well as in the healthcare space. So, stocks like Fortis, Max Healthcare, and Medanta these all stocks are looking attractive, but on the pharma front, one should wait because still there is no clarity on the tariff front on this, and what kind of impact would be there on the companies going forward. So, maybe some profit taking would be there in the pharma space and some of the stocks from the pharma, like you Sun Pharma, Dr Reddy’s, even Aurobindo Pharma all these stocks has broken their near-term support area. Though long-term trajectory is still intact, on the near-term chart, there is weakness, and even the Nifty Pharma index is now trading just below to the 50-day moving average also. So, maybe we could see some more profit taking in pharma space in the coming days till this uncertainty is there. So, some more downsides would be there. So, wait in the pharma space at this juncture to buy. But yes, those who are looking for an opportunity for a long-term perspective, they can use this decline as a buying opportunity, but not at the current level, wait for some stability in the stock prices, then one can look to buy stocks. Divi’s Lab is our preferred choice. Glenmark and Divi’s Lab these two stocks are looking attractive. Laurus Lab is also looking attractive. So, these three to four stocks are looking attractive on the long-term as well as on the medium-term chart. But healthcare is a space where one can try to buy stocks like Fortis, Max Health, and Medanta; these three stocks are the preferred choice from the healthcare space.One is on the buy side and one on the sell side. On the buy side, Jindal Stainless is looking attractive. Stock is comfortably holding above all its near-term, short-term moving averages. And the way stock has shown buying action in the last couple of days, it clearly shows that stock is poised for giving a breakout on the near-term chart and possible target towards 735 we could see in the near-term to short-term perspective. So, Jindal Stainless one can buy with a stop loss of 692. On the short side, Adani Enterprises has broken its important support area on the daily as well as on the weekly time frame. So, looking at the structure, a short buildup is there in the Adani Enterprises and we believe that furthermore, supply pressure we could see in the coming days. So, a possible down move can extend towards 2285 to 2270. So, one can go short in Adani Enterprises' future with a stop loss of 2375."
    },
    {
        "title": "ARCIL files for IPO, eyes public listing as India’s oldest asset reconstruction firm",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/arcil-files-for-ipo-eyes-public-listing-as-indias-oldest-asset-reconstruction-firm/articleshow/123059389.cms",
        "text": "Pioneer in asset reconstruction\n\n\n\nLive Events\n\nRetail loan portfolio expanding amid sector shift\n\n\n\nFinancial performance and operations\n\n\n\nBankers to the issue\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nAsset Reconstruction Company (India) Limited (ARCIL), the first asset reconstruction company to be incorporated in India, has filed its Draft Red Herring Prospectus (DRHP) with the Securities and Exchange Board of India (Sebi) for an initial public offering.The IPO will be an offer for sale of up to 10.54 crore equity shares of face value Rs 10 each. The offer includes up to 6.87 crore shares by Avenue India Resurgence Pte. Ltd, up to 1.94 crore shares by State Bank of India , up to 1.62 crore shares by Lathe Investment Pte. Ltd, and up to 10.35 lakh shares by The Federal Bank, the company said in a press release dated August 2.Established in 2002, ARCIL describes itself as a pioneer in India’s asset reconstruction industry and was the first ARC to be incorporated in the country. As of March 31, 2024, it was the second largest in terms of assets under management at Rs 15,230.031 crore and had the second highest net worth among private ARCs in India at Rs 2,462.511 crore.ARCIL operates across three verticals, corporate loans, SME and other loans, and retail loans, and classifies stressed assets based on internally assessed resolution mechanisms. It derives revenue from management fees, portfolio recovery fees, investment income, and write-backs.The company is sponsored by Avenue India Resurgence Pte. Ltd and the State Bank of India, under the SARFAESI Act. Its management team includes CEO and MD Mr. Pallav Mohapatra, President Mr. Phanindranath Kakarla, and CFO Mr. Pramod Gupta.According to a CRISIL report cited in the DRHP, “the stressed assets opportunity is shifting from corporate to non-corporate loans,” with the retail segment in particular “experiencing rising stress levels.” ARCIL has increased the proportion of retail loans in its portfolio, with retail AUM rising from Rs 1,559.107 crore as of March 2023 to Rs 2,747.88 crore as of March 2025, a compound annual growth rate of 20.79%.As of March 31, 2025, the company had acquired Rs 72,657.307 crore in total principal debt at a cost of Rs 38,155.632 crore and made recoveries of Rs 28,459.7 crore. During FY25, FY24, and FY23, the company acquired Rs 3,975.871 crore, Rs 2,068.982 crore, and Rs 4,288.962 crore of stressed assets, respectively.ARCIL reported revenue from operations of Rs 596.423 crore and total income of Rs 623.399 crore for the year ended March 31, 2025. Profit after tax stood at Rs 355.319 crore, with a PAT margin of 57%.For FY24, ARCIL had the lowest expenses as a percentage of average total AUM at 0.57% among the top seven ARCs, and the highest return on assets at 11.48%. Its capital adequacy ratio stood at 99.03%, approximately 40% higher than the next highest private ARC, while the debt-to-equity ratio was the lowest among the top six private ARCs at 0.06.As of March 31, 2025, the company had formed 652 trusts, of which 453 remained open and 199 had been closed. ARCIL collaborates with 201 registered valuers, 163 collection agents, and 950 empanelled lawyers, and maintains relationships with 30 private sector banks, 28 public sector banks, 2 co-operative banks, 41 non-banking financial companies, 17 housing finance companies, and seven other institutions. IIFL Capital Services , IDBI Capital Markets & Securities, and JM Financial are acting as the bankers to the issue.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Tariff hit sectors to recover with strategic action, deal-making: Sunil Subramaniam",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/tariff-hit-sectors-to-recover-with-strategic-action-deal-making-sunil-subramaniam/articleshow/123059247.cms",
        "text": "ET Now: In this market, what has really held fort is the FMCG pack. In fact, the sentiment was also, by the results that are coming out, whether it is HUL, a good outlook. We do see a volume pickup happening as well there. So, the entire FMCG pack also because it is domestic facing, is going to be the theme going ahead because tariff has caused a lot of trepidation in the market in any case. So, does FMCG, consumption does that look like a safe haven?\n\n\n\nLive Events\n\nET Now: Moving ahead and again coming to the tariff implications and one more sector which did feel the heat because of the tariff announcements was the textile space. Now, India is the fourth largest exporter of textile and apparel to the world. How significant is the potential impact of Trump's tariff move on Indian textile exporters, global competitiveness, what is your brief view on it?\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nSunil Subramaniam, Market Expert, says today it is a knee-jerk reaction. It is specific because relative to competition like Bangladesh and whoever is in that segment, we seem to be having an adverse tariff. But why do I feel it is overdone quickly because as the interim deal is signed, this will be top of the table that India will want at least a level playing field with our other competitors in the textile field. So, I think that today it is about 5% to 7% less tariff for us, so that is where we will target to be at least on that front which I think that we will succeed, that is number one.See, right now, yes, because in the weeks before FMCG has not been performing from a relative value perspective, being a pure domestic kind of sector. Second is that you saw that the commodity prices are generally easing. So, FMCG is a huge consumer of commodities. So, the expected thing is that sales volume will pick up, but the margins should also shore up.Third is, of course, the overall monsoon. You are seeing the effect of the monsoon even on two-wheeler sales. So, monsoon definitely has a positive impact on the bottom of the pyramid customer in the rural areas and FMCG as you know is largely also driven by the rural oriented sales. So, the positive outlook for the rural economy is translating into the FMCG pack and the reason that it is holding fort there, though other consumption related sectors like reality and auto under pressure is because it was not performing in the weeks before, so there is a kind of catch-up rally happening there.But looking forward, since the entire consumption pack whether you take it as consumer durables, you take it as auto, you take it as realty, or you take high-end retail, all of these are insulated to some extent from the tariff related concerns and so there will be a buying step up there.Now what is happening here is while they are also still correcting, because, see, domestic fund managers are the ones who have to support the market, but what has happened is that since April, May, June, they have put in Rs 60,000 crore in the month of May, in the month of June, and in the month of July. So, you look at it Rs 2 lakh crore has been deployed by DIIs from April, May, June, July.So, to some extent I saw that the mutual fund cash balances which have spiked up to 7.5% have come down. What I am saying is there is still some cash they can deploy but a lot of it has already been deployed. So, today because of the FIIs selling, if fund managers want to buy, even yesterday you saw there was five odd thousand crores of FII selling and five odd thousand crores of domestic buying, but still the markets were under some pressure.So, the point is that domestic fund managers have less room to go and buy whatever they are positive about. They can only buy that which the FIIs are selling, that is the second point. The third point is that they are also being a bit smart and waiting for some correction to happen before buying what they want to buy anyway, but not stepping in today because they know that there is pressure from the tariff related FII front so they are waiting it out.So, the volatility will continue, but ultimately domestic fund managers will step in and buy domestic oriented sectors where consumption is obviously top of the line, but I also draw attention to capital goods because you saw the numbers indicating that this and if your consumption improves at the bottom, like two wheelers, then your capacity utilisation will go up because so far it has been K-shaped consumption and that has not helped the numbers, it has only helped the value.My brief view first of all is that today it is a knee-jerk reaction. It is specific because relative to competition like Bangladesh and whoever is in that segment, we seem to be having an adverse tariff. But why do I feel it is overdone quickly because as the interim deal is signed, this will be top of the table that India will want at least a level playing field with our other competitors in the textile field. So, I think that today it is about 5% to 7% less tariff for us, so that is where we will target to be at least on that front which I think that we will succeed, that is number one.Number two is that the government does have in its hands one more tool to use which is currency depreciation to make up for the difference. So, if we allow our rupee to weaken a bit, we can be competing.The third is, this is a good trigger for productivity improvements including some mechanization in the textile sector and India being the fourth largest there, we have the ability to do that. So, we will come out of this crisis very quickly.So, I would say that for a person who is willing to take a little more volatility and uncertainty around that sector, it is a good time to start accumulating that sector because historically it has been a strong sector for us and we will come out winners. Yes, in the short term there will be volatility, but like I want to use a Hindi word darr ke aage jeet hai (victory lies beyond fear), definitely in textiles we will not give up our leadership position. The government will definitely do its best efforts to sustain that."
    },
    {
        "title": "AI, Ethics, and Big Data: Key Themes at the LAQSA’s IIQC 2025 Delhi edition",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/ai-ethics-and-big-data-key-themes-at-the-laqsas-iiqc-2025-delhi-edition/articleshow/123059167.cms",
        "text": "Data and Policymaking: A Candid Conversation\n\n\n\nLive Events\n\nAI, Ethics, and the Quant Frontier\n\n\n\nNew-Age Strategies and Systematic Thinking\n\n\n\nCharting the Road Ahead\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Indian Institutional Quant Conference (IIQC) 2025, hosted at Taj City Centre in Gurugram, marked a defining moment for India’s data-first investing movement.Organised by LAQSA (Lambda Quantitative Strategies Association), the Delhi edition of the conference brought together an eclectic mix of thought leaders, policy experts, economists, technologists, and quant professionals to explore how data-driven strategies are reshaping the future of Indian finance and policymaking.With the theme focused on the intersection of quantitative research , technology, and regulation, the one-day conference offered a rich mix of expert panels, fireside chats, and research-driven presentations.LAQSA’s mission to promote the science behind market strategies was on full display, with a meticulously curated agenda that reflected both the maturity and the momentum of India’s evolving quant ecosystem.One of the standout moments of the day unfolded during a mid-morning discussion featuring eminent voices such as Dr. S.N. Ghosh (DEA-AJNIFM, Ministry of Finance), Dr. T.C.A. Anant (Ex-Chief Statistician of India, Ex-Secretary, MOSPI), and Arvind Mathur (Advisor & Mentor, NDA; Ex-ADB). Moderated by Pankaj Mani (LAQSA, WILMOTT), the panel tackled the complex relationship between data reliability, economic governance, and regulatory effectiveness.The discussion struck a chord by highlighting how the robustness of statistical systems directly influences market confidence and policy outcomes.Rishi Kohli, Co-Founder of LAQSA, added, “We’re delighted with the overwhelming participation and spirit of discovery at this year’s IIQC Delhi Edition. Each session illuminated new frontiers in systematic thinking and reinforced the power of community in shaping the future of quant in India.”As the day progressed, conversations turned toward the implications of emerging technologies. A thought-provoking fireside chat between Prof. Arun Kumar of JNU and Prof. Shanta Laishram from the Indian Statistical Institute examined the ethical dimensions of AI in finance—particularly its environmental impact and its potential to widen systemic inequalities if left unchecked.Later sessions featured insights from family offices, hedge fund managers, and fintech innovators, who delved into cutting-edge strategies such as long-short models, high-frequency trading, and alternative investment frameworks.These discussions reflected not only a growing sophistication in India’s financial toolkit but also a strong appetite for experimentation with systematic and algorithmic approaches.Pankaj Mani, Co-Founder of LAQSA, remarked, “The Delhi Edition of IIQC underscored our commitment to cultivating innovative thinking and collaboration within the quant community. This vibrant gathering brought together domain leaders, educationists, researchers, and enthusiasts, fueling deeper conversations and actionable insights to push boundaries in data-driven domains.”As India’s financial markets continue to evolve amidst global volatility and increasing complexity, the IIQC serves as more than just an industry meet—it is becoming a vital crucible for new ideas and disciplined innovation.With LAQSA at the helm, the message is clear: quantitative strategies are not just a fleeting trend, but a foundational pillar of India’s modern financial architecture.The future, as IIQC 2025 reaffirmed, will be written in data—and shaped by those bold enough to decode it.: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Want to invest Rs 1 lakh when in your twenties? Here is Raamdeo Agrawal’s Warren Buffett-style blueprint to compound wealth",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/want-to-invest-rs-1-lakh-when-you-are-young-here-is-raamdeo-agrawals-warren-buffett-style-blueprint-to-compound-wealth/articleshow/123059117.cms",
        "text": "At 30, pick a lane: Professional or Passive?\n\n\n\nLive Events\n\nEverybody knows the price, nobody knows the value\n\n\n\nIndia and the U.S.\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIf you're 20 years old and sitting on Rs 1 lakh, Motilal Oswal co-founder Raamdeo Agrawal has one piece of advice: don’t do anything till you understand it. That, he says, is among the best lessons he’s learned from Warren Buffett, and it applies to both investing and life.In a conversation on Groww’s investor podcast released on YouTube, the Motilal Oswal Financial Services co-founder urged young investors to resist the pressure to act without clarity. Agrawal said most 20-year-olds underestimate how little they know about the market. “At the age of 20, what you don’t know is a lot of things… So when you see value–price gap, you will have a, what do you call, limited understanding of it.”He recalled his own investing debut, a hostel tip-off that turned into a three-bagger. “I bought it 15 bucks, and in a year, two years’ time, it became 45 bucks,” he said, noting he was around 22 at the time. “Those kinds of breaks will happen.”Asked where Rs 1 lakh should go at 30, Agrawal said it depends on whether you want to master the game or outsource it.“If I want to make a career in investing… then you should go to the stock market and figure out what is the value, what is the price, what is the earnings growth, what is the RoE, what is the momentum. I mean, it’s a full-time job, and it has become very competitive.”Otherwise, “go and give your money to one of the fund managers and be happy with it.”Agrawal didn’t hold back on what he sees as the pitfalls of post-COVID market behaviour. “Out of 200 million demat accounts, 160 million is less than 5 years… they have no clue what they are buying and selling... (post COVID)… market is very impatient,” he said.He stressed that understanding intrinsic value is the core skill. “Everybody knows the price. Nobody knows the value. Once you master the formula to discover value, investing becomes simple.”And the real reward, he added, lies in spotting mispriced opportunity. “Is the return gap between price and value… is it asymmetric? We are looking for asymmetric... Asymmetricity in the return — that’s the excitement in the market.”Agrawal dismissed market timing as a flawed strategy. “Not buying at the bottom is a crime if at all you are trying to time the market,” he said. “By the time you muster the courage to enter, you’ve already missed 40% of the upmove.”He advised investors to look beyond narrative and into balance sheets. “I go straight to 23 financial ratios,” he said. “If two companies are equally profitable, but one collects its dues in 10 days while the other takes 90 days, the difference is huge.”Despite growing global uncertainty, Agrawal believes India is one of the only two countries in the world, alongside the United States, where macroeconomic growth consistently flows into long-term equity returns. “There are 170 markets, but only these two allow for extrapolation of economic growth into stock performance,” he said.“India,” he said, “is more predictable than the U.S.”: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Concurrent Gainers: 10 stocks that gained for 5 days in a row",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-10-stocks-that-gain-for-5-days-in-a-row/slideshow/123058702.cms",
        "text": "Over the five trading sessions ending August 1, the Sensex fell by 1.06% or 863 points, closing at 80,599. The index ended in the red on three out of those five days. While the broader market exhibited signs of a bit of weakness throughout the week, ten stocks with a market capitalisation above Rs 1,000 crore managed to post gains in all five sessions. Stocks with extremely low trading volume in the last session have been excluded from this analysis. (Data Source: ACE Equity)\n\n"
    },
    {
        "title": "Secondary tariffs on Russian oil buyers: A new shockwave for global energy markets",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/secondary-tariffs-on-russian-oil-buyers-a-new-shockwave-for-global-energy-markets/articleshow/123058379.cms",
        "text": "Understanding Secondary Tariffs\n\n\n\nGlobal Oil Production and Consumption Landscape\n\n\n\nLive Events\n\nPotential Market Impact\n\n\n\nGeopolitical Ramifications\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIn a bold geopolitical move, US President Donald Trump has reiterated his intent to impose secondary tariffs on countries that continue purchasing oil from Russia. This move, aimed at pressuring Moscow into a ceasefire in Ukraine, could significantly disrupt global oil markets, intensify geopolitical tensions, and reshape energy alliances.Secondary tariffs are punitive measures not imposed directly on Russia, but against third-party nations that engage in trade with Russia—particularly in oil, gas, and uranium. The proposed tariffs could be as high as500%, targeting imports from countries that violate US sanctions. This strategy is designed to isolate Russia economically by deterring its trading partners, but it risks collateral damage across global supply chains.As of mid-2025, global oil production stands at approximately 101 million barrels per day (bpd), with consumption closely matching at 100.5 million bpd, according to the International Energy Agency (IEA). The top producers include the United States (12.9 million bpd), Saudi Arabia (10.5 million bpd), and Russia (9.8 million bpd). Russia remains a critical supplier, especially to China, India, and parts of Eastern Europe, which have increased imports since the Ukraine war began.If Russian oil flows were completely banned, replacing its supply would be extremely challenging for global markets as it contributes roughly 10% of global supply. Even in an optimistic scenario, the world could replace 5–6 million bpd, leaving a shortfall of 3–5 million bpd.If secondary tariffs are enacted, they would likely lead to a sharp price increase, global inflation, energy rationing in vulnerable economies and accelerated investment in renewable energy and gas markets.Restricting Russian oil indirectly through its buyers could reduce global supply, especially if major importers like India and China face pressure to cut back. This supply shock could push Asian Brent crude prices to exorbitant highs, raising worries over inflation worldwide.Countries dependent on Russian oil may scramble for alternatives, increasing demand for Middle Eastern and U.S. oil. This could strain existing production capacities and lead to regional energy shortages, particularly in Asia and Eastern Europe.Meanwhile, the proposed tariffs are not just economic tools—they're geopolitical weapons. If President Trump enforces this tariff on China and India—two of Russia’s largest energy customers—could face significant economic and strategic challenges. These tariffs would not only raise the cost of imports but also strain diplomatic ties with the US, forcing both countries to recalibrate their energy and trade policies.However, in such a high tariff environment, China and India may adopt a multi-pronged strategic approach as a response to the US. Both countries could accelerate deals with Middle Eastern supplies and may find new suppliers from Africa and Latin America. China may boost Yuan based trade to bypass dollar-based sanctions. In addition, diplomatic measures, enhancing renewable investments and boosting domestic production may also expected gradually.President Trump's proposed secondary tariffs represent a high-stakes gamble. While they aim to pressure Russia into peace talks, the global repercussions could be severe—fuelling inflation, disrupting energy markets, and reshaping geopolitical alliances. As the world watches, the decision could mark a turning point in both the Ukraine conflict and the future of global energy diplomacy.: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Hero MotoCorp to Prestige Estates: Axis Securities’ top 6 mid-cap and small-cap stock picks with up to 22% upside",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-to-prestige-estates-axis-securities-top-6-mid-cap-and-small-cap-stock-picks-with-up-to-22-upside/slideshow/123058535.cms",
        "text": "Target Price: Rs 1,350 | Upside: 18%\n\n\n\nAxis Securities is bullish on Kalpataru Projects, citing a robust Rs 64,495 crore order book and strong momentum across T&D, B&F, and Oil & Gas segments. With margin-accretive orders, lower debt, and improving international performance, the company is expected to deliver a 22% EBITDA and 41% PAT CAGR over FY25–27E. Management guides for continued order inflow and EBITDA margin expansion to 8.5–9%.\n\n\n\n(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Trump momentum drives stablecoin urgency in Asian financial hubs",
        "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/trump-momentum-drives-stablecoin-urgency-in-asian-financial-hubs/articleshow/123058251.cms",
        "text": "Bloomberg\n\nLive Events\n\nThe crypto-curious nation of South Korea offers a case-in-point.\n\n\n\nStreamlined Trading\n\n\n\nMainland Interest\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nAsian markets are hurriedly updating their stablecoin rules as President Donald Trump’s embrace of US dollar-pegged cryptocurrencies instills a fresh sense of urgency among the region’s authorities.Recent developments in South Korea, Hong Kong, Malaysia, Thailand and the Philippines point to a proliferation of stablecoins pegged to Asian currencies — even as authorities raise concerns about capital outflows.Regional heavyweights including JD.com and Ant Group plan to capitalize by applying to become issuers. Shares in Kakaopay Corp. ballooned on expectations that it would do the same. Even China, which has for years imposed a sweeping crypto ban, appears to be warming to the notion of tokens that serve as yuan surrogates.It all stems from the US, where lawmakers recently passed legislation that will promote wider use of digital tokens that seek to maintain a 1:1 peg with the dollar. The White House earmarked dollar stablecoins as a priority in a January executive order, days after Trump’s inauguration.“The Genius Act has opened the floodgates for stablecoin adoption,” said Benjamin Grolimund, General Manager for the UAE at crypto exchange Flipster. “Whether you support it or not, stablecoins are now unavoidable.”Overhanging Asia’s flurry of activity is the fear of capital flight. The dollar reigns supreme in today’s stablecoin market, with $256 billion in tokens pegged to the greenback. These maintain their price by managing reserves of cash-like assets, such as US Treasuries. By contrast, there’s just $403 million of euro-backed stablecoins in circulation, despite a well established regulatory framework covering such products in the form of the Markets in Crypto-Assets Regulation regime.Koreans are already trading piling into dollar-pegged stablecoins. Transactions involving USDT, USDC and USDS — three of the largest dollar proxies — on five domestic exchanges reached 57 trillion won ($41 billion) in the first quarter, Yonhap News reported, citing Bank of Korea data.Local lawmakers in recent weeks clashed with the central bank over whether to allow Korean companies to issue won-based stablecoins. President Lee Jae Myung’s ruling Democratic Party on June 10 proposed the Digital Asset Basic Act, creating a pathway for local firms to become issuers.Two weeks later, Ryoo Sangdai, Senior Deputy Governor at the Bank of Korea, warned that stablecoins may shift the country’s longstanding policy stance on capital liberalization and the won’s internationalization. Central bank Governor Rhee Chang Yong went further, arguing that non-bank stablecoins would “cause big chaos like in the 19th century,” when currencies issued by the private sector flooded the market.“Local stablecoins, while offering regulatory visibility at the point of issuance, carry the risk of becoming efficient bridges to global markets through seamless crypto-to-crypto swaps on decentralised exchanges,” said John Park, head of Korea at Arbitrum Foundation.Asian central banks need to find ways to channel the momentum, rather than fighting it, Park said. Regulatory frameworks should aim to preserve sovereignty while staying competitive, he added.For digital-asset trading firms, a more diverse stablecoin market is a no-brainer.“Capital controls are a challenge,” said Yoann Turpin, co-founder of crypto market maker Wintermute. “But stablecoins could provide a vetted, more efficient on-chain system.”Such a setup could streamline arbitrage trades across venues or between markets without the constraint of foreign exchange market hours, said Le Shi, Hong Kong managing director at market making firm Auros. “There’s a real use case for local currency stablecoins — particularly for enabling weekend liquidity and smoother capital movement.”Another possibility is that the growth of local stablecoins could enliven crypto economies in Asia. In South Korea, an estimated 18 million people, over a third of the country’s population, are engaged in digital assets. Sam Seo, chairman of the Kaia DLT Foundation, said a won-backed stablecoin would serve different needs than US dollar alternatives.“In the short term, swaps between the won and USDT will dominate. But longer term, we’ll need stablecoins from other countries to support direct pairings and faster settlement,” Seo said.Hong Kong, meanwhile, has quickly become the region’s stablecoin laboratory. The Hong Kong Monetary Authority is particularly focused on “viable and practical use cases,” not just capital buffers, Clara Chiu, founder of QReg Advisory said. Many of the issuers that have taken an interest in yuan-backed stablecoins are trading and payment firms that are already using the yuan in cross-border settlement. “That’s where the practical demand lies,” Chiu added.While China’s next steps are far from certain, crypto firms including brokers are already preparing for the prospect of yuan-pegged stablecoins. Kennix Chan, vice president at Victory Securities, said the firm is in active talks with a range of would-be issuers in Hong Kong.The firm’s affiliate, VDX, is close to securing a license to operate a digital-asset exchange, according to Chan, allowing it to offer new trading pairs — such as Bitcoin against stablecoins pegged to the Hong Kong dollar — and eventually yuan-backed equivalents. “When a yuan-stablecoin is born, the market will definitely be exponentially bigger,” Chan said.Despite its blanket crypto trading ban, China appears to be warming to blockchain as a financial tool. People’s Bank of China Governor Pan Gongsheng said in June that stablecoins could revolutionize international finance, as rising geopolitical tensions highlight the fragility of traditional payment systems.A recent licensing upgrade granted for a major Chinese state-owned brokerage to deal in digital assets through Hong Kong has also stirred optimism among Chinese players. “It gave hope that there’s a way,” Chiu said.Still, few expect Beijing to open its doors to crypto trading anytime soon. Lily King, chief operating officer at digital-asset custodian Cobo, said Hong Kong will continue to serve as a testing ground for Chinese enterprises looking to build overseas. “China may not feel the need to open itself,” she added."
    },
    {
        "title": "Turnaround Titans: 8 smallcaps swing to profit in June quarter, soar 25–200% in FY26",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/turnaround-titans-8-smallcaps-swing-to-profit-in-june-quarter-soar-25200-in-fy26/slideshow/123058034.cms",
        "text": "Turnaround Titans\n\nA quiet revival is underway in the smallcap space. Around 22 smallcap companies reported profits in the June 2025 quarter after incurring losses in March 2025, indicating a sharp quarter-on-quarter (QoQ) turnaround. This shift highlights improved operations, tighter cost controls, and signs of recovery across key sectors. Notably, 16 of these 22 stocks have already delivered double-digit price returns in FY26 so far, reflecting renewed investor confidence.We have identified the top 8 smallcap performers from this group that have posted gains of over 25% in FY26 to date. Remarkably, one of these stocks has soared more than 200% in just the first four months of the financial year—yes, a staggering 200% rally. Such turnarounds often mark a company’s return to financial health, driven by strategic changes and market tailwinds—offering renewed confidence and long-term potential. (Data Source: ACE Equity)"
    },
    {
        "title": "Sri Lotus Developers IPO: Latest GMP suggests SRK, Big B and Ashish Kacholia may pocket 28% gains",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/sri-lotus-developers-ipo-latest-gmp-suggests-king-khan-big-b-and-ashish-kacholia-may-pocket-28-gains/articleshow/123057842.cms",
        "text": "Shah Rukh Khan's investment and likely gains:\n\n\n\nLive Events\n\nAmitabh Bachchan's investment and expected gains:\n\n\n\nRoshan family\n\n\n\nAshish Kacholia\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWith Sri Lotus Developers and Realty IPO closing on Friday, shares are quoting a 28% premium (GMP) or Rs 42 in the grey market, implying a listing price of Rs 192. If the momentum sustains, early backers like Shah Rukh Khan, Amitabh Bachchan, the Roshan family, and investor Ashish Kacholia could pocket significant gains. Here's how much they could earn.The equity shares were allotted in 2024 for Rs 150 apiece to SRK, Big B, the Roshan family and veteran investor Ashish Kacholia.Sri Lotus Developers' IPO saw robust demand across all investor categories, with an overall subscription of 69.14 times. The retail portion was subscribed 20.28 times, non-institutional investors (NII) bid 57.71 times their quota, while qualified institutional buyers (QIBs) led with an overwhelming 163.90 times subscription.The Shah Rukh Khan Family Trust holds 6,75,000 shares, investing Rs 10.1 crore. If Sri Lotus Developers' stock is listed for Rs 192, the profits for King Khan would be Rs 2.83 crore.Amitabh Bachchan bought 666,670 shares for Rs 10 crore at the time of the private placement, according to the Red Herring Prospectus (RHP) filed by the company. The likely gains for Big B could be to the tune of Rs 2.8 crore.Hrithik Rakesh Roshan and his father Rakesh Roshan hold 70,000 shares each in the company. Their gains would be Rs 29.40 lakh each.Kacholia had to shell out nearly Rs 50 crore for 3,333,300 equity shares. His gains could be to the tune of Rs 13.99 crore.Sri Lotus Developers raised Rs 399.20 crore through a private placement to 118 individuals and entities before filing its Draft Red Herring Prospectus (DRHP) in December 2024. The December round also attracted investment from other celebrities like Ektaa Ravi Kapoor, her brother Tusshar Kapoor and their father Jeetendra.The company drew significant interest from Bollywood because its promoter, Anand Kamalnayan Pandit, is also a prominent film producer and distributor.Other marquee investors like Jagdish Master and DRChoksey Finserv have also invested in the company.Through the IPO, which was a book building issue, Sri Lotus Developers plans to raise 792 crores.Incorporated in February 2015, Sri Lotus Developers and Realty Limited is a developer of residential and commercial properties located in Mumbai, Maharashtra, specializing in redevelopment projects within the ultra-luxury and luxury segments of the western suburbs.As of June 30, 2025, the company held a developable area of 0.93 million square feet, encompassing residential and commercial properties."
    },
    {
        "title": "Rekha Jhunjhunwala exits Nikhil Kamath, Madhusudan Kela-backed smallcap stock with 111% returns in 3 years",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-exits-nikhil-kamath-madhusudan-kela-backed-smallcap-stock-with-111-returns-in-3-years/articleshow/123057311.cms",
        "text": "Live Events\n\nNazara Technologies share price history\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nStar investor Rekha Jhunjhunwala , after inheriting her husband Rakesh Jhunjhunwala’s 10.82% stake in Nazara Technologies , has now completely exited her position in the company, a prominent player in India’s gaming and sports media sector. The stock has delivered an impressive 111% return over the past three years.Nazara Technologies' stock is backed by some influential investors, including Madhusudan Kela and Nikhil Kamath.By March 2025, Rekha Jhunjhunwala had a 7.06% stake in the company, holding a total of 61,83,620 shares. However, by June, Rekha exited Nazara Technologies , selling her entire holding.On June 13, Jhunjhunwala sold her stake in Nazara Technologies, offloading 13 lakh shares on the BSE and another 14 lakh shares on the NSE, at an average price of Rs 1,225.19 and Rs 1,225.63, respectively. The combined deal value stood at approximately Rs 334 crore. This marked the completion of her exit from the company.The company, however, continues to be backed by other notable investors. Madhusudan Kela, who holds 10,96,305 shares, owns 1.18% of Nazara Technologies. Meanwhile, Nikhil Kamath, through his firm Kamath Associates, holds 15,04,782 shares, representing a 1.62% stake in the company.Meanwhile, Rekha Jhunjhunwala publicly holds 25 stocks, with a combined net worth exceeding Rs 38,918.10 crore, according to the latest corporate shareholding disclosures available on Trendlyne.Further, as of June 2025, Jhunjhunwala’s net worth was valued at Rs 42,252.90 crore, marking a stellar 149% jump from March 2025, according to Trendlyne.Over the past year, the shares of Nazara Technologies have increased by 40.01%, while year-to-date (YTD), the stock has increased by 31.81%. In the last six months, the price has increased by 42.07%, and over the past three months, the stock has surged 31.35%. In the past month, the stock price went up by 2.38%.On Friday, Nazara Technologies shares closed 1.44% lower at Rs 1,331.10 on the BSE.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "title": "Trump’s 25% Tariff on Indian Exports: A headline risk, not a structural threat",
        "url": "https://economictimes.indiatimes.com/markets/market-moguls/trumps-25-tariff-on-indian-exports-a-headline-risk-not-a-structural-threat/articleshow/123057627.cms",
        "text": "Sectoral Impact: Short-Term, Not Structural\n\nLive Events\n\nA Reality Check: The Numbers Tell the Story\n\nStrategic Positioning & Policy Backstop\n\nImplications for the Capital Market\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe recent announcement by U.S. President Donald Trump of a proposed 25% tariff on select Indian exports has understandably stirred concerns among market participants tracking India’s capital markets. While the headlines may sound alarming, it’s important to put this development into perspective and assess its true economic implications.Let me begin by stating clearly: this is not a significant threat to India’s economic engine or its long-term investment outlook.Yes, there could be short-term headwinds for specific export-intensive sectors—particularly engineering goods, pharmaceuticals, auto components, textiles, and select metals and chemicals. These industries may face margin compression, supply chain friction, and temporary stock price volatility.However, the broader foundation of the Indian economy remains intact and resilient.*India’s nominal GDP has crossed USD 4 trillion, positioning it as the fifth-largest economy in the world.*In FY 2024–25, India recorded total exports of USD 824.9 billion, which includes both goods and services. This constitutes roughly 20% of GDP, meaning that 80% of GDP is driven by domestic demand—a testament to India’s robust internal economic activity.*Of the total goods exports, shipments to the U.S. stood at USD 87.4 billion, while imports from the U.S. were USD 41.8 billion.*Thus, exports to the U.S. account for just around 2% of India's GDP. Even if a subset of these is impacted by the tariffs, the macroeconomic fallout remains limited.*It’s also worth noting that key growth sectors like IT services, digital exports, mobile phones, agri-tech, and clean energy remain largely untouched by these proposed tariff measures.India’s external trade diversification is another buffer. Exporters are actively expanding into markets across the Middle East, Africa, Southeast Asia, and Latin America, reducing over-reliance on Western economies.Meanwhile, diplomatic engagement continues. The 6th round of U.S.-India trade talks is scheduled for August 2025, and historical precedent suggests a realistic possibility of a rollback or sector-specific reprieve—as seen during earlier interactions with the Trump administration.India’s refusal to open its agriculture and dairy markets reflects a confident and principled trade stance. This underscores India’s emergence as a credible global economic partner.Domestically, initiatives like Atmanirbhar Bharat, PLI schemes, infrastructure investments, and digital transformation are significantly boosting India’s manufacturing competitiveness and supply chain independence. These initiatives act as policy cushions against external shocks.Investors should differentiate between sentiment-driven volatility and long-term structural fundamentals.While some export-led stocks may experience corrections in the near term, India’s broader market indices remain supported by:*Robust domestic consumption*Stable macroeconomic indicators*Healthy credit growthMoreover, foreign portfolio investments (FPIs) continue to flow into domestic-facing sectors like financials, infrastructure, consumption, and energy transition, reaffirming global investor confidence in India’s long-term story.The proposed U.S. tariff is a tactical disruption, not a strategic derailment. With:*Low GDP exposure to impacted goods*Policy preparedness*Expanding trade partnerships, and*Strong domestic demandIndia is well-equipped to weather such external pressures.Investors should view this episode as a short-term sentiment overhang—not a fundamental threat. The Indian growth story remains robust, broad-based, and attractively poised for the long term."
    },
    {
        "title": "Trump’s 25% Tariff on Indian Exports: A headline risk, not a structural threat",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-25-tariff-on-indian-exports-a-headline-risk-not-a-structural-threat/articleshow/123057168.cms",
        "text": "Sectoral Impact: Short-Term, Not Structural\n\nLive Events\n\nA Reality Check: The Numbers Tell the Story\n\nStrategic Positioning & Policy Backstop\n\nImplications for the Capital Market\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe recent announcement by U.S. President Donald Trump of a proposed 25% tariff on select Indian exports has understandably stirred concerns among market participants tracking India’s capital markets. While the headlines may sound alarming, it’s important to put this development into perspective and assess its true economic implications.Let me begin by stating clearly: this is not a significant threat to India’s economic engine or its long-term investment outlook.Yes, there could be short-term headwinds for specific export-intensive sectors—particularly engineering goods, pharmaceuticals, auto components, textiles, and select metals and chemicals. These industries may face margin compression, supply chain friction, and temporary stock price volatility.However, the broader foundation of the Indian economy remains intact and resilient.*India’s nominal GDP has crossed USD 4 trillion, positioning it as the fifth-largest economy in the world.*In FY 2024–25, India recorded total exports of USD 824.9 billion, which includes both goods and services. This constitutes roughly 20% of GDP, meaning that 80% of GDP is driven by domestic demand—a testament to India’s robust internal economic activity.*Of the total goods exports, shipments to the U.S. stood at USD 87.4 billion, while imports from the U.S. were USD 41.8 billion.*Thus, exports to the U.S. account for just around 2% of India's GDP. Even if a subset of these is impacted by the tariffs, the macroeconomic fallout remains limited.*It’s also worth noting that key growth sectors like IT services, digital exports, mobile phones, agri-tech, and clean energy remain largely untouched by these proposed tariff measures.India’s external trade diversification is another buffer. Exporters are actively expanding into markets across the Middle East, Africa, Southeast Asia, and Latin America, reducing over-reliance on Western economies.Meanwhile, diplomatic engagement continues. The 6th round of U.S.-India trade talks is scheduled for August 2025, and historical precedent suggests a realistic possibility of a rollback or sector-specific reprieve—as seen during earlier interactions with the Trump administration.India’s refusal to open its agriculture and dairy markets reflects a confident and principled trade stance. This underscores India’s emergence as a credible global economic partner.Domestically, initiatives like Atmanirbhar Bharat, PLI schemes, infrastructure investments, and digital transformation are significantly boosting India’s manufacturing competitiveness and supply chain independence. These initiatives act as policy cushions against external shocks.Investors should differentiate between sentiment-driven volatility and long-term structural fundamentals.While some export-led stocks may experience corrections in the near term, India’s broader market indices remain supported by:*Robust domestic consumption*Stable macroeconomic indicators*Healthy credit growthMoreover, foreign portfolio investments (FPIs) continue to flow into domestic-facing sectors like financials, infrastructure, consumption, and energy transition, reaffirming global investor confidence in India’s long-term story.The proposed U.S. tariff is a tactical disruption, not a strategic derailment. With:*Low GDP exposure to impacted goods*Policy preparedness*Expanding trade partnerships, and*Strong domestic demandIndia is well-equipped to weather such external pressures.Investors should view this episode as a short-term sentiment overhang—not a fundamental threat. The Indian growth story remains robust, broad-based, and attractively poised for the long term.(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "title": "Stocks to Buy | Domestic themes to drive market recovery, says Rohit Srivastava",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-domestic-themes-to-drive-market-recovery-says-rohit-srivastava/slideshow/123057140.cms",
        "text": "Rohit Srivastava emphasises that consumption remains a fully supported theme, and investors should closely monitor domestic-focused sectors like FMCG, textiles, and steel. These areas are likely to fuel the next phase of market growth.\n\n\n\n(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)\n\n"
    },
    {
        "title": "Stocks to Buy | Hope Over Panic: Markets bet on negotiation, not escalation",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-hope-over-panic-markets-bet-on-negotiation-not-escalation/slideshow/123056782.cms",
        "text": "According to Dikshit Mittal, if the full 25% tariff is implemented, it could lead to global supply disruptions, not just in India but in the U.S. as well. He warns that this may cause inflation and even slow down economic activity. However, he reiterates that markets are currently pricing in the possibility of a more favourable trade resolution.\n\n"
    },
    {
        "title": "​7 stocks Warren Buffett has sold so far in 2025",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/7-stocks-warren-buffett-has-sold-so-far-in-2025/slideshow/123056500.cms",
        "text": "Warren Buffett, CEO of Berkshire Hathaway, has been quietly reducing exposure to a range of holdings in 2025, with a particular focus on trimming his financial sector bets. While Buffett rarely comments on specific sales, the magnitude and pattern of the disposals have raised eyebrows, especially given his oft-quoted line that his \"favourite holding period is forever.\"\n\n\n\nHere are the seven stocks Buffett has sold so far this year.\n\n\n\n"
    },
    {
        "title": "Gold breaks past inflation-adjusted 1980 high in 2024; silver lags below 2011 peak: DSP Mutual Fund",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-breaks-past-inflation-adjusted-1980-high-in-2024-silver-lags-below-2011-peak-dsp-mutual-fund/articleshow/123056306.cms",
        "text": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "title": "8th Pay Commission: What Rs 3 lakh crore boost for government employees mean for stock market investors",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/8th-pay-commission-what-rs-3-lakh-crore-boost-for-government-employees-mean-for-stock-market-investors/articleshow/123056143.cms",
        "text": "8th Pay Commission Payout\n\n\n\nLive Events\n\nStock Market Set for Double Boost\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndia's upcoming 8th Pay Commission , expected to result in a total payout of up to Rs 3-3.15 lakh crore to 11.2 million central government employees and pensioners in 2026, will provide a much-needed boost for stock market investors as the salary hike offers income boost to government employees and in turn leads to a large injection of disposable income, providing a much-needed boost to consumption.Sectors like passenger vehicles, BFSI, consumer durables, real estate, FMCG and QSR would benefit, according to experts.According to calculations done by Elara Securities, the pay commission will lead to Rs 3-3.15 lakh crore payout for both salaries and pensions, which is estimated to be 0.65-0.85% of projected FY27 GDP. This compares with 7th Pay Commission's total cost at Rs 1.02 lakh crore, which is equivalent to 0.66% of FY17 GDP.\"Considering an employee distribution of 60% in lower salary levels (Salary grade 1-5), 30% in mid-levels (Salary grade 6–10), and 10% in senior levels (Salary grade 11–18), we estimate an overall average monthly gross salary increase of Rs 30,000-40,000 per month and monthly gross increase in pensions of Rs 15,000-18,000,\" Elara said.The 7th Pay Commission (Jan'16-Dec'25) had implemented a modest salary hike of around 14% (lowest since 1970). Ambit expects the 8th Pay Commission to announce a hike of 30-34% for salaries & pensions (around 15.5% of total expenditure) to cover around 11 million beneficiaries to boost consumption.With the Unified Pension Scheme implemented from FY26, the government's contribution to pension fund (as % of employee salary) has increased to 18.5% from 14% earlier under NPS.\"Of this, 8.5% is under the government's discretion as to where to park the fund. If it decides to follow global norms of parking around 45% in equities, flow into equity markets could increase from around Rs 245 billion to around Rs 465 billion (around 7.7% of net domestic flows in FY25),\" Ambit Capital said.A simple back-of-the-envelope calculation suggests government and central government employees' contributions under the NPS would be Rs 1.2 trillion in FY26, of which Rs 182 billion would go into equities (assumed at around 15%, in line with default pattern under NPS scheme for Central government employees), it said.Under the UPS, about 20% of the salary would be under employee discretion as opposed to the entire 24% under the NPS. If the government invests 45% (per global average) of the remaining 8.5% that it contributes under the UPS in equities, the overall flows to equities will nearly double.Besides, additional money in the hands of government employees will either go to savings or consumption. A higher quantum of savings means more inflows into Dalal Street both directly as well as via the mutual fund route.Higher salary will mean higher consumption and therefore as seen in previous pay commission implementation periods, traditional sectors like housing and auto will likely benefit. Evolving consumption trends suggest increased demand for services, particularly QSR, and BFSI sub-sectors like insurance and non-lending financials, analysts say.As per historical trends, the passenger vehicles (PV) segment tends to benefit significantly during Pay Commission announcements. According to media reports, Maruti Suzuki witnessed a 31% year-on-year increase in sales to government employees once 7th Pay Commission was implemented in FY17. In FY09, after the 6th Pay recommendations (54% increase in purchasing power), government employees accounted for around 8% of Maruti's vehicle sales in 4QFY09, from earlier 3.5%, Ambit said.Similar trends were seen in the case of consumer durables, as growth was attributed to 7th Pay Commission payout. Company commentaries suggest that these are segments that have done well in the past, every time a Pay Commission rollout has happened, it said.Analysts at Kotak Equities also agreed that select discretionary consumption and savings have been key beneficiaries in past pay revisions.\"Based on our estimate of Rs 2.4-3.2 lakh crore of additional income accrued by the central government employees, we expect an incremental Rs1-1.5 lakh crore of savings to be created, which may incrementally flow into a mix of physical savings, deposits and shares and debentures segment,\" the brokerage said."
    },
    {
        "title": "US stocks slump on latest tariffs, soft jobs data",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-slump-on-latest-tariffs-soft-jobs-data/articleshow/123056083.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nU.S. stocks slumped on Friday, and the S&P suffered its biggest daily percentage decline in more than two months as new U.S. tariffs on dozens of trading partners and a surprisingly weak jobs report spurred selling pressure.Also weighing on equities was an 8.3% tumble in Amazon.com shares after the company posted quarterly results but failed to meet lofty expectations for its Amazon Web Services cloud computing unit.Just hours before the tariff deadline on Friday, President Donald Trump signed an executive order imposing duties on U.S. imports from countries, including Canada, Brazil, India and Taiwan, in his latest round of levies as countries attempted to seek ways to reach better deals.Further denting confidence in the economic picture, data showed U.S. job growth slowed more than expected in July while the prior month's report was revised sharply lower, indicating the labor market may be starting to crack.The report significantly pushed up expectations the Federal Reserve will cut interest rates at its September meeting.\"There's no way to pretty-up this report. Previous months were revised significantly lower where the labor market has been on stall-speed,\" said Brian Jacobsen, Chief Economist at Annex Wealth Management in Menomonee Falls, Wisconsin.\"Last year the Fed messed up by not cutting in July so they did a catch-up cut at their next meeting. They'll likely have to do the same thing this year.\" Market expectations the Fed will cut rates by at least 25 basis points at its September meeting stood at 86.5%, according to CME's FedWatch Tool, up from 37.7% in the prior session.The Dow Jones Industrial Average fell 542.40 points, or 1.23%, to 43,588.58, the S&P 500 lost 101.38 points, or 1.60%, to 6,238.01 and the Nasdaq Composite lost 472.32 points, or 2.24%, to 20,650.13.The S&P 500 recorded its biggest single-day percentage decline since May 21 while the Nasdaq suffered its biggest daily percentage drop since April 21.For the week, the S&P 500 fell 2.36%, the Nasdaq declined 2.17%, and the Dow fell 2.92%.The CBOE Volatility Index, also known as Wall Street's fear gauge, closed up 3.66 points at 20.38, its highest close since June 20.Amazon was the biggest drag on the Dow, S&P 500 and Nasdaq and pushed the consumer discretionary index, down nearly 3.6% as the worst performing of the 11 major S&P 500 sectors.Also reporting earnings was Apple , which lost 2.5% after it posted a current-quarter revenue forecast well above Wall Street estimates, but CEO Tim Cook warned U.S. tariffs would add $1.1 billion in costs over the period.Stocks briefly extended declines after Trump said he ordered the commissioner of the U.S. Bureau of Labor Statistics, Erika L. McEntarfer, to be fired in the wake of the jobs data.\"(Trump) didn't seem to be disappointed with the last five jobs reports,\" said Art Hogan, Chief Market Strategist, B. Riley Wealth, Boston, saying that the firing stood out as irregular.\"I think this is clearly something that happens in dictatorships, not in democracies.\"The Federal Reserve said Governor Adriana Kugler is resigning early from her term and will exit the central bank on Aug. 8, enabling President Donald Trump to select a new governor as he has ramped up pressure against Chair Jerome Powell recently to cut interest rates.Declining issues outnumbered advancers by a 2.17-to-1 ratio on the NYSE, and by a 2.69-to-1 ratio on the Nasdaq.The S&P 500 posted eight new 52-week highs and 29 new lows, while the Nasdaq Composite recorded 29 new highs and 202 new lows.Volume on U.S. exchanges was 19.51 billion shares, compared with the 18.44 billion average for the full session over the last 20 trading days."
    },
    {
        "title": "Gold rises nearly 2% as US payrolls data boosts rate cut hopes",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rises-nearly-2-as-us-payrolls-data-boosts-rate-cut-hopes/articleshow/123056024.cms",
        "text": "Synopsis\n\nGold prices surged nearly 2% on Friday, reaching a one-week high of $3,347.66 per ounce, fueled by weaker-than-expected U.S. payroll data. This raised expectations for Federal Reserve rate cuts later this year. Fresh tariff announcements by the U.S. also spurred safe-haven demand, further boosting gold's appeal amidst economic uncertainty. Market anticipates two rate cuts by year-end, beginning in September."
    },
    {
        "title": "Oil falls $2 a barrel on worries about OPEC+ supply, US jobs data",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-2-a-barrel-on-worries-about-opec-supply-us-jobs-data/articleshow/123055943.cms",
        "text": "Synopsis\n\nOil prices dipped around $2 a barrel on Friday amid concerns over a potential OPEC+ production increase and a disappointing U.S. jobs report. Despite the daily drop, both Brent and WTI crude futures ended the week with gains near 6%. Discussions suggest OPEC+ might boost output by 548,000 barrels per day in September. Simultaneously, weaker-than-expected U.S."
    },
    {
        "title": "European shares log biggest daily drop since April after US tariffs hike",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-log-biggest-daily-drop-since-april-after-us-tariffs-hike/articleshow/123055922.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nEuropean stocks logged their biggest one-day drop in over three months on Friday, at the end of a busy week as investors grappled with the repercussions of fresh U.S. levies on dozens of countries, including a 39% tariff on Switzerland.Investors shunned riskier equities globally as Trump continued his tariff blitz, announcing steep levies on exports from dozens of trading partners including Canada, Brazil, India and Taiwan with countries not listed subject to a base 10% rate ahead of a Friday trade deal deadline.Healthcare stocks lost 1% after U.S. President Donald Trump sent letters to the leaders of 17 major pharmaceutical companies, including Novo Nordisk and Sanofi, outlining how they should slash U.S. prescription drug prices.The sector was already singed this week by Novo Nordisk's profit warning. The Denmark-listed Wegovy-maker shed 1.8% and logged its steepest weekly decline on record.\"We saw during the week that companies like Novo Nordisk had different issues. European pharma is very close to bottoming and that's why it didn't react to the uncertainty around tariffs and policy,\" Anthi Tsouvali, a multi-asset strategist at UBS Global Wealth Management said.\"Europe is an export market... if we see heightened tariffs all over the world and trade being subdued, then that will have an impact on European companies regardless.\"The pan-European STOXX 600 index slid 1.9% and marked its biggest one-week drop since early April when Trump unveiled his tariffs on world economies. The euro STOXX volatility index jumped 4.25 points to its highest in over one-month.The STOXX index has lost over 5% from its March peak, after coming within 2% of that level earlier this week, dragged down by a record plunge in Novo Nordisk shares, and as investors assess the implications of the U.S.-EU trade deal.Markets in Switzerland were shut for a holiday, but UK-listed Watches of Switzerland declined 6.8%, while a U.S.-listed exchange traded fund tracking the country's equities slid to a more than three-month low and was last down 1.2%.Most regional bourses were in the red, with Germany's blue-chip DAX down 2.7%, while Denmark's OMXC fell 1.8% to a nearly two-year low.Banks, that had rallied earlier in the week, were down 3.4% and were the top sectoral underperformer as they notched their biggest one-day drop since early April.Adding to the dour mood, U.S. data showed job growth slowed sharply in July, which boosted bets for an interest rate cut by the Federal Reserve next month, while traders also priced in a dovish move by the European Central Bank later this year.In a bright spot, Italy's Campari was the top gainer on the STOXX 600 index, adding 7.9% after reporting an increase in second-quarter operating profit. (Reporting by Twesha Dikshit, Medha Singh and Johann M Cherian; Editing by Mrigank Dhaniwala, Shinjini Ganguli, Alexandra Hudson)"
    },
    {
        "title": "Global stock index sinks with dollar, bond yields after weak US jobs data",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/global-stock-index-sinks-with-dollar-bond-yields-after-weak-us-jobs-data/articleshow/123055893.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMSCI's global equities index sold off sharply on Friday and the dollar took a dive after weaker-than-expected U.S. jobs data fueled economic worries and boosted bets for September interest rate cuts while investors also considered U.S. President Donald Trump's latest tariff announcements and key personnel changes.U.S. Treasuries were in demand after the Labor Department reported that the U.S. economy added 73,000 nonfarm payrolls last month, below economists' expectations for 110,000. June's job growth was revised sharply lower to 14,000 from 147,000.After the report, Trump said he ordered his team to fire the commissioner of the U.S. Bureau of Labor Statistics , Erika L. McEntarfer, nominated by prior President Joe Biden for the role.Then the dollar index and U.S. Treasury yields lost further ground when the Federal Reserve said Governor Adriana Kugler is resigning early from her term on Aug. 8, causing some investors anxiety at a time when Trump has loudly disagreed with Fed rate policies.Late on Friday, traders were betting on an 87.5% probability for a September rate cut compared with 37.7% on Thursday, according to CME Group's FedWatch tool.\"The market is reacting to the possibility of the economy flipping into recession. The weak jobs data is piling on to weak earnings reports and weak guidance from some corporations,\" said Luke Tilley, Chief Economist, Wilmington Trust.MSCI's gauge of stocks across the globe fell 12.23 points, or 1.32%, to 917.39, suggesting its biggest daily drop since mid-April. The softer jobs data added to losses for the global index, which was already in the red after a host of tariff announcements from Trump the day before.On Thursday, Trump ordered tariffs ranging from 10% to 41% on U.S. imports from several major trading partners. He increased duties on Canadian goods to 35% from 25% for all products not covered by the U.S.-Mexico-Canada trade agreement. He set a 25% rate for India's U.S.-bound exports, 20% for Taiwan's, 19% for Thailand's and 15% for South Korea's.Mexico, however, got a 90-day reprieve from higher tariffs to allow for deal talks.On the earnings front, market heavyweight Amazon tumbled more than 8% on Friday after its quarterly report showed cloud computing growth that disappointed investors.On Wall Street, the Dow Jones Industrial Average fell 542.40 points, or 1.23%, to 43,588.58, the S&P 500 fell 101.38 points, or 1.60%, to 6,238.01, for its biggest one-day percentage drop since May 21 and the Nasdaq Composite fell 472.32 points, or 2.24%, to 20,650.13, its steepest one-day drop since April 21.Earlier, the pan-European STOXX 600 index ended down 1.89%, its biggest drop since April 9.In currencies, the greenback reversed course to fall sharply after the data due to increased expectations for rate cuts. Earlier it had found support in fading hopes for U.S. rate cuts.The dollar index, which measures the greenback against major currencies including the yen and the euro, fell 1.37% to 98.66, the euro was up 1.52% at $1.1589. Against the Japanese yen, the dollar weakened 2.26% to 147.32.\"The way (the market) is going to interpret (the departures) is in a very dollar-negative way,\" Juan Perez, senior director of trading, Monex USA, referring to both the Kugler and McEntarfer news.\"No matter what the economic picture in the United States, the one thing that holds the U.S. dollar strong in the eyes of the world is the authority and the independence of the Federal Reserve. Whenever anything comes to potentially put that into compromise then that's when the U.S. dollar spirals down.\"U.S. Treasury yields plunged on the jobs data and the increased bets for September rate cuts, and fell to fresh session lows in the late afternoon after the Kugler announcement.Peter Tuz, president of Chase Investment Counsel, said Trump \"is getting a bigger chance to appoint people whose views match his own\" at the Fed. Regarding the BLS firing Tuz said \"I don't like to see a bureaucrat fired just because the data that gets presented doesn't support the administration's policies.\"The yield on benchmark U.S. 10-year notes fell 14 basis points to 4.22%, from 4.36% late on Thursday. The 30-year bond yield fell 6.4 basis points to 4.8211%.The 2-year note yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 26.1 basis points to 3.69%.In energy markets, oil prices sank about 2.8% after the jobs data and on jitters about a possible production increase by OPEC and its allies. Oil had settled around 1% lower on Thursday.U.S. crude settled down 2.79%, or $1.93 at $67.33 a barrel and Brent settled at $69.67 per barrel, down 2.83%, or $2.03 on the day.Elsewhere in commodities, gold prices rallied to a one-week high as investors sought safety after the weak jobs report, policy easing expectations and the latest tariff announcements. Spot gold rose 2.14% to $3,360.45 an ounce."
    },
    {
        "title": "Rupee ends in the green on likely central bank support",
        "url": "https://economictimes.indiatimes.com/markets/forex/rupee-ends-in-the-green-on-likely-central-bank-support/articleshow/123055855.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Indian rupee strengthened marginally to 87.53 a dollar Friday on likely intervention from the Reserve Bank of India (RBI), capping off a rough and tumultuous week punctuated with unexpectedly punitive tariffs on US-bound shipments from the country.Traders said sustained portfolio outflows and a significantly higher baseline tariff than anticipated earlier led to substantial weakness in the currency during the past two trading days.The rupee had closed at a record low of 87.59/$1 on Thursday.Through the choppy trading session, the first in the calendar month, the rupee had strengthened to 87.21 per dollar on the back of RBI's dollar sales, traders said. But continuous dollar demand from oil companies, foreign portfolio outflows from Indian equities, and a stronger dollar index pressured the rupee to close at 87.53/$1.\"The fall has been corroborated with a rise in the dollar index, a fall in Asian currencies and a fall in equities. The rupee looks vulnerable to global forces after Donald Trump's tariff announcement. Today, the RBI seemed to be the only entity selling dollars in the market,\" a trader with a public sector bank said.The dollar index rose to 100 on Friday and has been consistently strengthening during the week. It was at 97.6 at the start of the week.Traders expect the rupee to be under pressure on Monday, with the currency expected to trade near record lows, as the RBI's $5 billion dollar-rupee buy-sell swap is expected to mature on August 4. \"The range for Monday is 87.25/$1 to 88/$1 with the central bank's $5-billion sold position coming up for maturity on August 4,\" said Anil Bhansali, head of treasury at Finrex Treasury Advisors."
    },
    {
        "title": "Frauds on the rise with modes more ingenious: Sebi chief Tuhin Kanta Pandey",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/frauds-on-the-rise-with-modes-more-ingenious-sebi-chief-tuhin-kanta-pandey/articleshow/123055810.cms",
        "text": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "title": "CEO’s exit sparks a sell-off in PNB Housing Finance, stock falls 17%",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/ceos-exit-sparks-a-sell-off-in-pnb-housing-finance-stock-falls-17/articleshow/123055769.cms",
        "text": "ETMarkets.com\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nKolkata: Shares of PNB Housing Finance declined more than 17% Friday, in its worst fall since October 2018, after the sudden resignation of chief executive Girish Kousgi , who has built for himself a reputation of turning around struggling mortgage lenders.He would leave the organisation on October 28, as per the firm's exchange filing. His resignation marked the third such top-level exit this fiscal, creating a leadership gap in the company. The stock ended at ₹811.15, down 17.3%. PNB Housing was the worst performer on its benchmark Nifty Smallcap 50 index, which ended 1.8% lower.\"Following the resignation of MD & CEO Girish Kousgi from PNB Housing Finance, the company's share price declined sharply on Friday, driven by the Street's concerns over his departure,\" said Gaurav Sharma, head of research at Globe Capital Market.\"This is due to his instrumental role in the company's turnaround, asset quality improvement , and growth. Kousgi was also credited with the turnaround of Can Fin Homes when he was the MD & CEO. The Can Fin Home shares had tanked over 7% on September 19, 2022, when he suddenly resigned to join PNB Housing Finance.Arijit Malakar, equity research analyst, Ashika Stock Broking, said there are concerns around the quality of leadership, as under Kousgi, the share price rose from ₹370 in October 2022 to ₹1,200, driven by his innovative strategy and customer-centric approach.While the NBFC reported strong first-quarter results with 18% retail loan growth and projected NIMs of 4% by FY27, quality of new leadership will be key to its execution,\" he said.Shares of PNB Housing have declined nearly 27% in the last month, whereas the benchmark Smallcap 50 index is down 7.3%.While in the short term the stock may remain volatile, analysts said the medium-term view remains positive. \"We remain constructive on the company's strong fundamentals and expect performance to improve in the latter half of the year. We view the sell-off as more panic-driven and believe investors with 1-2 year horizons may consider this correction a buying opportunity,\" said Sharma.Malakar advises new investors to adopt a wait-and-watch approach until the company provides greater clarity on its future plans.The board of the mortgage lender assured stakeholders that the company would pursue growth under a new leadership team backed by its strong fundamentals and asset quality. The board has constituted a search panel for a new head.The company is already looking to find a replacement for Dilip Vaitheeswaran, chief sales officer, who tendered his resignation on July 23. Vaitheeswaran was in charge of the prime housing segment. Earlier in the year, the company's business head for affordable housing resigned with effect from 19 May.Incidentally, Kousgi is the third consecutive full-time MD & CEO of PNB Housing Finance who quit before the end of the scheduled term. Kousgi was appointed on October 21, 2022, for a four-year term."
    },
    {
        "title": "No Iron Don to protect D-Street, indices slump 1% under US fire",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/no-iron-don-to-protect-d-street-indices-slump-1-under-us-fire/articleshow/123055718.cms",
        "text": "Live Events\n\nETMarkets.com\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndia's equity indices ended almost 1% lower on Friday, marking their fifth straight week of losses-the longest losing streak in two years-as concerns over the fallout of US tariffs on Indian exports weighed on sentiment.The NSE Nifty fell 0.8% or 203 points to finish at 24,565.35. The BSE Sensex moved 0.7% or 585.67 points lower at 80,599.91. Both indices declined 1.1% in the past week.\"The structural long-term trend is dictated by the earnings, which are around expectations; however, the challenge is the lack of enough clarity on the tariff front, and this uncertainty is expected to linger,\" said Pankaj Pandey, head of retail research at ICICI Direct. \"From that perspective, the market is lacking a near-term trigger for a decisive move.\"The recent losing run, initially triggered by fatigue after a strong rebound, has been exacerbated by Donald Trump's announcement that the US will impose 25% tariffs on Indian exports, along with an additional non-tariff penalty for buying crude oil and military equipment from Russia.Analysts said a pullback was due after Nifty's surge from 22,000 levels to almost 25,700 levels in the last couple of months.\"The five consecutive weeks of losses in Nifty were marked by foreign selling with the overseas investors remaining 90% short on index futures-a multi-month low that added selling pressure amid tariff imposition concerns,\" said Nilesh Jain, head of derivatives and technical research at Centrum Broking.Traders are watching whether the Nifty is able to hold above a key support of 24,000.\"A further dip towards the 200-day moving average of 24,000 levels could be a short-term bottom, and investors can accumulate quality stocks,\" said Jain. \"A sharp and sustainable rebound is expected around 24,000 levels, but it may take some more time to materialise.\"The Nifty Midcap 150 and the Smallcap 250 indices declined 1.3% and 1.6%, respectively, on Friday. Out of the 4,169 shares traded on the BSE, 1,297 advanced, while 2,718 declined. In the past week, the mid-cap index shed 1.9% while the small-cap index tumbled 3%.Pharma stocks were among the top losers on reports that Trump has asked 17 of the world's biggest pharmaceutical majors to lower prices of existing drugs. Sun Pharmaceutical Industries tumbled 4.5% on Friday, emerging as the biggest loser on the index, after the first-quarter net profit fell 20%. The Nifty Pharma index dropped 3.3%Foreign portfolio investors (FPIs) sold shares worth a net of ₹3,366.4 crore on Friday. Their domestic counterparts bought shares worth ₹3,186.9 crore. In July, overseas investors dumped shares worth 38,214.5 crore- the highest selling since February this year.At home, the Volatility Index or VIX-the market's fear gauge-gained 3.7% to almost 12 on Friday, indicating traders expect higher risks in the near term.Elsewhere in Asia, South Korea tumbled almost 4%, while Hong Kong and Japan fell 1.1% and 0.7%, respectively. China and Taiwan declined around 0.5% each."
    },
    {
        "title": "Delhivery Q1 Results: Net Profit surges 68% YoY to Rs 91 crore",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/delhivery-q1-results-net-profit-surges-68-yoy-to-rs-91-crore/articleshow/123055662.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNew-age third party logistics firm Delhivery on Friday reported a 68.5% year-on-year jump in its net profit for the first quarter ended June to ₹91 crore, driven by tighter operations and stable revenue.The company reported a 5.6% growth in its operating revenue at ₹2,294 crore. The firm's biggest segment of express parcel shipments saw a 14% volume growth to 208 million.In the post-earnings analysts call, Delhivery CEO Sahil Barua said the impact of volume growth from Ecom Express acquisition will be visible from the July-September quarter. The deal was closed on July 18.Delhivery will incur integration costs of around ₹300 crore over a six-month period. Barua said the acquisition would increase Delhivery's market share in the third-party logistics (3PL) segment by around 25% - considering Ecom Express was around half its size in volumes.In a separate stock exchange filing, Delhivery said Srivatsan Rajan , its longest-serving independent director, will step down effective September 30.Yashish Dahiya, founder of PB Fintech , and Padmini Srinivasan, will join the company's board as independent directors"
    },
    {
        "title": "Tata Power Q1 profit rises 6% to Rs 1,262 crore",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q1-profit-rises-6-to-rs-1262-crore/articleshow/123055617.cms",
        "text": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "title": "Adani Power goes for a 1:5 stock split, Q1 net profit dips 15%",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-goes-for-a-15-stock-split-q1-net-profit-dips-15/articleshow/123055569.cms",
        "text": "Synopsis\n\nAdani Power's board has approved a stock split, dividing each share of ₹10 into five shares of ₹2, aiming to broaden retail investor participation. The company reported a 15.5% drop in its Q1 consolidated net profit to ₹3,305 crore, with revenue declining 5.9% to ₹14,167 crore. Despite this, EBITDA from continuing operations stood at ₹5,744 crore."
    },
    {
        "title": "Listing or blitzing?! Figma stock soars 250% higher on Day 1 on Wall Street",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/listing-or-blitzing-figma-stock-soars-250-higher-on-day-1-on-wall-street/articleshow/123055420.cms",
        "text": "Live Events\n\nETMarkets.com\n\nAI-based Product\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nFigma Inc stock jumped 250% on Thursday in the largest first-day pop in at least three decades for a US-traded company raising more than $1 billion. They turned volatile on their second trading day, rising as much as 333% above the initial public offering (IPO) price, before paring gains.The San Francisco-based company's stock traded at $126 each, as of press time, versus the IPO price of $33 per share.The trading gives Figma a market value of $61.5 billion, based on the outstanding shares listed in its filings. Accounting for employee stock options and restricted stock units, and restricted stock units for chief executive Dylan Field, which are subject to vesting conditions, the fully diluted value is roughly more than $73 billion.That's well in excess of the $20-billion mark it would have reached in a now-scrapped merger with Adobe Inc.The shares offered in Figma's IPO were ultimately more than 40 times oversubscribed, with more than half of the orders receiving no stock, people familiar with the matter have said.Figma's IPO made billions of dollars for its largest venture capital investors too. The company's biggest VC backer, Index Ventures, invested nearly $100 million in the company when it was a startup. By the end of trading Wednesday, Index's stake in Figma was worth $7.23 billion.Second-largest backer Greylock Partners led the company's Series A funding round in 2015, when it was valued at 20 cents per share. It has made investments of about $50 million into Figma, according to a person familiar with the deal. Its stake was worth $2.03 billion stake at the time of the IPO - representing a multiple of more than 40 times what the firm invested, the person said. Greylock's stake, excluding shares sold, climbed on Thursday to about $6.75 billion.The firms reaping multibillion-dollar gains are joined by other big-name investors.These include Kleiner Perkins and Sequoia Capital, both of which bet on the company when it was still an upstart. The windfalls are particularly significant for the VC industry, which has until recently endured a long drought in the IPO markets. The offering is being seen as a potential catalyst for other startups after a three-year freeze in the tech listings market.Figma is used to design web and mobile application interfaces. It charges clients based on the number of users and the kind of seat those users have.The firm, which has highlighted its focus on AI, has also benefited from Wall Street's enthusiasm for the technology. The boom fuelled a sharp rally in tech stocks over the past year and drove up valuations and investor demand for companies seen as central to the AI ecosystem.\"In order for application software companies to remain relevant and provide value to end users, they will need to implement GenAI capabilities which represents a potential catalyst for adoption and increased usage of Figma,\" said Gil Luria, analyst at DA Davidson, in a note.Figma had net income of $44.9 million and revenue of $228 million in the three-month period ended March 31, according to its filings. It reported revenue growth in 2024, though rising operating expenses contributed to a net loss of $732 million for the year.Adobe, a maker of software for creative professionals, walked away from the deal to buy Figma following clashes with regulators. It paid a $1 billion termination fee."
    },
    {
        "title": "Wall Street Week Ahead: AI gains, strong earnings support US stocks as tariff woes linger",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-ai-gains-strong-earnings-support-us-stocks-as-tariff-woes-linger/articleshow/123055408.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWith more than half of second quarter earnings reported and stocks near record highs, company results have reassured investors about the artificial intelligence trade that has energized Wall Street, even if tariff worries curtailed buying.With results in from 297 of the S&P 500 companies as of Thursday, year-on-year earnings growth for the second quarter is now estimated at 9.8%, up from 5.8% estimated growth on July 1, according to LSEG data.Next week investors will get a peek at earnings from Dow Jones Industrial Average constituents Disney, McDonald's and Caterpillar, for a look at the broader economy. Strong profit reports for these companies could propel the Dow, trading just shy of its December record high, to a fresh peak.Some 81% of the companies have beaten analyst expectations on earnings, above the 76% average for the past four quarters.\"The earnings season has been unambiguously better than expected,\" Art Hogan, chief market strategist at B. Riley Wealth in Boston, said.The strength of corporate earnings is particularly reassuring for investors after the pummeling sentiment took in the prior quarter due to the twin threats of tariffs and worries over flagging economic growth.\"The first quarter was a bit more mixed and you had some questionable economic data ... which I think gave the market some pause,\" said Tim Ghriskey, senior portfolio strategist at Ingalls & Snyder in New York.\"But the second quarter seems to have just been a turnaround,\" Ghriskey said.The strength of results for names linked to the artificial intelligence trade - the investment thesis that AI will be a transformative force, driving a significant portion of future economic growth and company profits - is particularly heartening, investors and analysts said.\"Overall it has been mega caps, growth/technology/AI that is driving a lot of the results,\" Ghriskey said.\"This is where we want to be exposed in terms of companies ... we're at maximum equity exposures and we're comfortable there.\"Having boosted the market for several quarters, the trade ran into rough waters at the start of the year as the emergence of Chinese-founded artificial intelligence startup DeepSeek rattled investors, stoking concerns over heightened competition that could disrupt the dominance of established tech giants at the heart of the AI trade, including Nvidia.Strong results from Microsoft and Meta Platforms reassured investors that massive bets on AI are paying off.Worries over AI demand appear overblown, Macro Hive research analyst Viresh Kanabar said.The trade related tumult earlier this year prompted many investors to pare equity exposure, particularly to higher-risk growth stocks.Even after the market rebound - the S&P 500 is up about 6% for the year and near a record high - institutional investors have been slow to return to equities. Overall, investors' equity positioning is still only modestly overweight, according to Deutsche Bank estimates.Strength in earnings from AI and technology names could draw more investors and lift markets further in coming weeks, analysts said.\"If you are trying to beat your benchmark and you were underweight any of the AI names you have to chase them,\" B. Riley Wealth's Hogan said.After S&P 500's 2.2% gain in July, the seasonally volatile months of August and September, markets might face some short-term turbulence, Hogan said. Historically, August has marked a pick-up in stock market gyrations that peaks in October.August kicked off with stocks selling off sharply on Friday as new U.S. tariffs on dozens of trading partners and Amazon's unimpressive earnings weighed on sentiment, while a weaker payrolls report added to risk aversion.But any near-term market pullback should be seen as a buying opportunity, especially in some of the mega-cap, technology names, Hogan said.With big AI names, Alphabet, Microsoft, Nvidia, Meta Platforms and Amazon, commanding about a quarter of the weight in the S&P 500, the health of the AI trade bodes well for the market at an index level, analysts said.\"We're not saying the weakness isn't there in other parts of the economy,\" Kanabar said.\"We're just saying at the index level, the largest companies dominate to such an extent (that) it doesn't matter to some at the moment.\" (Reporting by Saqib Iqbal Ahmed; Additional reporting by Caroline Valetkevitch and Chuck Mikolajczak; Editing by Alden Bentley)"
    },
    {
        "title": "Central banks are building a haven of bullion assets",
        "url": "https://economictimes.indiatimes.com/markets/commodities/central-banks-are-building-a-haven-of-bullion-assets/articleshow/123055529.cms",
        "text": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMUMBAI: Central bank gold appetite, although not as voracious as the 1,000-tonne-a-year purchases in the past three calendar years, remains largely undiminished globally as this group of institutional buyers diversifies its asset base beyond the customary dollar-denominated holdings in a world increasingly strewn with tariff snags.Central banks net bought 166 tonnes of gold in three months to June, 33% lower quarter-on-quarter, World Gold Council (WGC) data showed. While this is the lowest quarterly number since June 2022, it is 41% higher than the average quarterly level seen between 2010 and 2021, before buying ramped up sharply in more recent years, WGC data showed.For the first half (H1) of 2025, the number stood at 415 tonnes compared to 525 tonnes in year ago. This is also the lowest first half since 2022. Elevated gold prices amid destabilising economic and geopolitical environment has likely contributed to the slowdown in central bank buying, WGC said.According to Madhavankutty G , chief economist at Canara Bank, the central banks' gold purchases fit perfectly into the de-dollarisation theme, where countries want to diversify their foreign exchange reserves. Though the dollar is still dominant in FX reserves, its share is coming down drastically, with gold benefiting from this shift.\"The added benefit of gold is also the safety aspect. The US tariffs have increased the geopolitical as well as global economic uncertainty, which in turn is expected to keep gold prices elevated. Historically, US Treasury yields and gold prices were inversely related. That relationship has broken now. So even as yields are expected to remain above 4.30%, gold demand prices may also remain high,\" he said.Although central banks typically are strategic buyers of gold, they are not completely insensitive to its price level. \"But that they continue to add gold in the face of a higher price underscores their continuing favourable attitudes towards gold as a strategic asset amid such uncertainty,\" it said.According to WCG, the longer-term trend of central banks taking advantage of gold's diversification properties and reallocating from US assets to gold remains intact.The Reserve Bank of India (RBI) bought nearly half a tonne of gold in the last week of June after a relatively conservative spell of bullion shopping in the current fiscal year, ET reported earlier. The RBI 's outstanding stock of gold amounted to nearly 880 tonnes as of June 27. Its share in India's foreign exchange reserves climbed to 12.1% as of July 18, 2025, from 8.9% as of July 19, 2024.WGC's Central Bank Gold Reserves Survey 2025 revealed that 95% expect gold reserves to increase over the next 12 months. The results of the survey, which collected data from 73 of the world's central banks, were published in mid-June.The National Bank of Poland was the largest buyer of gold, adding 19 tonnes to its gold reserves in the June quarter, while China's reported purchases amounted to 6 tonnes, half of what it bought in the March quarter. China's gold reserves now stand at 2,299 tonnes, WCG data showed."
    },
    {
        "title": "Sebi proposes tighter norms for green bond third-party reviewers",
        "url": "https://economictimes.indiatimes.com/markets/bonds/sebi-proposes-tighter-norms-for-green-bond-third-party-reviewers/articleshow/123047864.cms",
        "text": "Synopsis\n\nSebi is proposing stricter regulations for the appointment of independent third-party reviewers of green debt securities. This move aims to align the norms with those applicable to other ESG-linked bonds, addressing gaps in reviewer independence and conflict of interest mitigation. The revised framework seeks to establish comprehensive criteria for certifiers of green bonds, ensuring greater transparency and credibility."
    },
    {
        "title": "ITC reports marginal decline in June quarter net profit, revenue surges 19%",
        "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-reports-marginal-decline-in-june-quarter-net-profit-revenue-surges-19/articleshow/123047533.cms",
        "text": "Synopsis\n\nITC Ltd reported a slight dip in standalone net profit for Q1, but revenue surged by 19.7% driven by cigarettes, FMCG, and agri-businesses. The cigarette business saw revenue growth, while the FMCG sector was impacted by commodity prices. Agri-business revenue soared, offsetting a decline in the paperboards segment. Consolidated results showed strong performance across group companies."
    },
    {
        "title": "MCX announces 1:5 stock split as exchange reports record revenue in Q1",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-announces-15-stock-split-as-exchange-reports-record-revenue-in-q1/articleshow/123047254.cms",
        "text": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "title": "Upcoming IPOs: JSW Cement IPO, Highway Infra IPO among 10 new public issues to open next week; check full list here",
        "url": "https://www.livemint.com/market/ipo/upcoming-ipos-jsw-cement-ipo-highway-infr-ipo-among-10-new-public-issues-to-open-next-week-check-full-list-here-11754196765274.html",
        "text": "Upcoming IPOs: The IPO buzz in the primary market is all set to continue next week as ten new initial public offerings (IPOs), including two in mainboard and eight in SME segment, will be opening for subscription.\n\nApart from new public issues, the market will also witness listings of twelve new IPOs, including NSDL IPO, Laxmi India Finance IPO, in the coming week.\n\n“ The realignment of the IPO market across regions and sectors reflects a deeper shift in global capital flows and investor sentiment. As markets recalibrate in real time, robust IPO readiness will be essential for companies to navigate short-term volatility while aligning their IPO strategies with long-term macro trends,” said George Chan EY Global IPO Leader.\n\nHere's a list of IPOs which will open for subscription next week - Highway Infrastructure IPO The IPO will open for subscription on August 5 and close on August 7. The price band is set at ₹65 to ₹70 per share.\n\nJSW Cement IPO The IPO will open for subscription on August 7 and close on August 11. The price band is yet to be announced by the company.\n\nEssex Marine IPO The SME IPO will open for subscription on August 4 and close on August 6. The price band is set at is ₹54 per share.\n\nBLT Logistics IPO The SME IPO will open for subscription on August 4 and will close on August 6. The price band is set at ₹71 to ₹75 per share.\n\nAaradhya Disposal IPO The SME IPO will open for subscription on August 4 and close on August 6. The price band is set at ₹110 to ₹116 per share.\n\nJyoti Global Plast IPO The SME IPO will open for subscription on August 4 and close on August 6. The IPO price band is set at ₹62 to ₹66 per share.\n\nParth Electricals IPO The SME IPO will open for subscription on August 4 and close on August 6. The IPO price band is set at ₹160 to ₹170 per share.\n\nBhadora Industries IPO The SME IPO will open for subscription on August 4 and close on August 6. The IPO price band is set at ₹97 to ₹103 per share.\n\nSawaliya Foods Products IPO The SME IPO will open for subscription on August 7 and close on August 11. The IPO price band is set at ₹114 to ₹120 per share.\n\nANB Metal Cast IPO The SME IPO will open for subscription on August 8 and close on August 12. The price band is yet to announced by the company.\n\nNew Listings - NSDL IPO: The IPO will be list on BSE with a tentative listing date fixed as Wednesday, August 6.\n\nAditya Infotech IPO: The IPO will be list on BSE, NSE with a tentative listing date fixed as Tuesday, August 5.\n\nLaxmi India Finance IPO: The IPO will be list on BSE, NSE with a tentative listing date fixed as Tuesday, August 5.\n\nSri Lotus Developers IPO: The IPO will be list on BSE, NSE with a tentative listing date fixed as Wednesday, August 6.\n\nM&B Engineering IPO: The IPO will be list on BSE, NSE with a tentative listing date fixed as Wednesday, August 6.\n\nUmiya Mobile IPO: The SME IPO will be listed on BSE SME on August 4.\n\nRepono IPO: The SME IPO will be listed on BSE SME on August 4.\n\nKaytex Fabrics IPO: The SME IPO will be list on NSE SME with a tentative listing date fixed as Tuesday, August 5.\n\nTakyon Networks IPO: The SME IPO will be list on BSE SME with a tentative listing date fixed as Wednesday, August 6.\n\nMehul Colours IPO: The SME IPO will be list on BSE SME with a tentative listing date fixed as Wednesday, August 6.\n\nB.D.Industries IPO: The SME IPO will be list on BSE SME with a tentative listing date fixed as Wednesday, August 6.\n\nRenol Polychem IPO: The IPO will be list on NSE SME with a tentative listing date fixed as Thursday, August 7.\n\nCash Ur Drive Marketing IPO: The SME IPO will be list on NSE SME with a tentative listing date fixed as Thursday, August 7.\n\nFlysbs Aviation IPO: The SME IPO will be list on NSE SME with a tentative listing date fixed as Friday, August 8."
    },
    {
        "title": "Gold prices today in your city: Check prices in Mumbai, Bengaluru, Chennai, Hyderabad, New Delhi, Kolkata on August 3",
        "url": "https://www.livemint.com/market/commodities/gold-prices-today-august-3-in-your-city-check-mumbai-bengaluru-chennai-hyderabad-delhi-kolkata-safe-haven-invest-markets-11753857267496.html",
        "text": "Gold and silver prices in your city on August 3: Gold and silver prices have seen impact from the rise in the US dollar, but concerns over a global trade war, unleashed by United States President Donald Trump's tariff policies also capped losses for the yellow metal.\n\nOverall, however, experts feel that gold and silver are safe haven bets that investors can make to safeguard their portfolios in these volatile markets and with increased risk aversion.\n\nOver the past 20 years, gold prices have skyrocketed by an impressive 1,200 per cent from ₹7,638 in 2005 to over ₹1,00,000 in 2025 (till June), and delivered positive returns in 16 of these years. Year-to-date (YTD), gold prices have risen 31 per cent, with consistent RECord highs solidifying its position among 2025’s top-performing asset classes and a reliable hedge.\n\nFurther, silver has also proved resilient. Prices have held above the ₹1 lakh/kg mark for the past three week. Over the past 20 years (2005-2025), the metal has gained a solid 668.84 per cent.\n\nCheck how much gold, silver prices have dropped — August 3 The MCX gold index was at ₹99,049/10 gm at 9.20 am on August 3, the official website showed. Meanwhile, MCX silver prices were at ₹1,10,224/kg, it showed.\n\nFurther, 24-carat gold was priced at ₹99,810/10 gm, according to data on the Indian Bullion Association (IBA) at 9.20 am on August 3. Further, 22-carat gold was priced at ₹91,413/10 gms. Silver prices today are at ₹1,10,560/kg (Silver 999 Fine), as per the IBA website.\n\nSo, check here gold and silver prices in your city today on August 3 — Delhi, Kolkata, Mumbai, Hyderabad, Bengaluru, and Chennai. Notably, for retail customers, jewellers may add making charges, taxes and GST to the bill, which could hike the final price for you.\n\nAlso Read | Buy or sell: Ganesh Dongre of Anand Rathi suggests 3 stocks to buy on Monday\n\nGold and Silver Prices in Mumbai — August 3 • Gold bullion rates in Mumbai— ₹99,630/10 gm.\n\n• MCX Gold ratein Mumbai — ₹99,049/10 gm.\n\n• Silver bullion rate in Mumbai— ₹1,10,360/kg.\n\n• MCX Silver 999 rate in Mumbai — ₹1,10,224/kg.\n\nGold and Silver Prices in Delhi — August 3 • Gold bullion rates in New Delhi— ₹99,460/10 gm.\n\n• MCX Gold rate in New Delhi — ₹99,049/10 gm.\n\n• Silver bullion rate in New Delhi— ₹1,10,170/kg.\n\n• MCX Silver 999 rate in New Delhi — ₹1,10,224/kg.\n\nGold and Silver Prices in Kolkata — August 3 • Gold bullion rates in Kolkata— ₹99,500/10 gm.\n\n• MCX Gold rate in Kolkata — ₹99,049/10 gm.\n\n• Silver bullion rate in Kolkata— ₹1,10,210/kg.\n\n• MCX Silver 999 rate in Kolkata — ₹1,10,224/kg.\n\nGold and Silver Prices in Bengaluru — August 3 • Gold bullion rates in Bengaluru— ₹99,710/10 gm.\n\n• MCX Gold rate in Bengaluru — ₹99,049/10 gm.\n\n• Silver bullion rate in Bengaluru— ₹1,10,440/kg.\n\n• MCX Silver 999 rate in Bengaluru — ₹1,10,224/kg.\n\nAlso Read | Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday\n\nGold and Silver Prices in Hyderabad — August 3 • Gold bullion rates in Hyderabad— ₹99,790/10 gm.\n\n• MCX Gold rate in Hyderabad — ₹99,049/10 gm.\n\n• Silver bullion rate in Hyderabad— ₹1,10,530/kg.\n\n• MCX Silver 999 rate in Hyderabad — ₹1,10,224/kg.\n\nGold and Silver Prices in Chennai — August 3 • Gold bullion rates in Chennai— ₹99,920/10 gm.\n\n• MCX Gold rate in Chennai — ₹99,049/10 gm.\n\n• Silver bullion rate in Chennai— ₹1,10,680/kg.\n\n• MCX Silver 999 rate in Chennai — ₹1,10,224/kg."
    },
    {
        "title": "Stocks to buy under  ₹100: Sumeet Bagadia recommends three shares to buy on Monday - 4 August 2025",
        "url": "https://www.livemint.com/market/stock-market-news/stocks-to-buy-under-100-sumeet-bagadia-recommends-three-shares-to-buy-on-monday-4-august-2025-11754191972235.html",
        "text": "Indian stock market: The Indian stock market closed with sharp losses on Friday, August 1, as widespread selling pressure marked the start of the August derivatives series. The decline was driven by worries over tariffs, weak corporate earnings, and continued foreign fund outflows.\n\nThe Sensex dropped 586 points, or 0.72 per cent, to finish at 80,599.91, while the Nifty 50 fell 203 points, or 0.82 per cent, ending the session at 24,565.35.\n\nLosses were more pronounced in the broader market, with both the BSE Midcap and Small-cap indices experiencing steeper declines.\n\nAlso Read | Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday\n\nThe steep market decline wiped out more than ₹5 crore of investor wealth in just one session, with the total market capitalisation of BSE-listed companies falling to ₹444.5 lakh crore from ₹449.7 lakh crore in the previous trading day.\n\nStock market next week Sumeet Bagadia, Executive Director at Choice Broking believes that Indian stock market sentiment is cautious as the Nifty 50 index is trading in the 24,500 to 24,950 range.\n\n“ Bullish or bearish trend can be assumed on the breakage of either side of this range. So, one should maintain stock-specific approach and look at those stocks that are looking strong on the technical chart,” Bagadia said.\n\nAlso Read | Buy or sell: Ganesh Dongre of Anand Rathi suggests 3 stocks to buy on Monday\n\nStocks to buy Sumeet Bagadia has recommended three stocks to buy on Monday, August 4. The three stock picks by Bagadia are - Suzlon Energy, Restaurant Brands Asia, and Udaipur Cement Works.\n\n1] Suzlon Energy: Buy at ₹65.95 | Target Price: ₹71 | Stop Loss: ₹63.7\n\n2] Restaurant Brands Asia: Buy at ₹83.95 | Target Price: ₹90 | Stop Loss: ₹81\n\n3] Udaipur Cement Works: Buy at ₹36.61 | Target Price: ₹39.5 | Stop Loss: ₹35.3"
    },
    {
        "title": "Buy or sell: Ganesh Dongre of Anand Rathi recommends three stocks to buy on Monday - 4  August 2025",
        "url": "https://www.livemint.com/market/stock-market-news/buy-or-sell-ganesh-dongre-of-anand-rathi-recommends-three-stocks-to-buy-on-monday-4-august-2025-11754190435317.html",
        "text": "Buy or sell: The Indian equity markets witnessed notable profit booking this week, with the Nifty 50 closing at 24,565, registering a weekly decline of 0.90%. The index broke decisively below its recent consolidation range of 24,800–25,200, a zone it had maintained over the previous week.\n\nFriday’s heavy sell-off was particularly significant, driven by concerns over a potentially weak earnings season and an unexpected imposition of steep tariffs by the Trump administration. Additionally, market sentiment was impacted by the U.S. Federal Reserve's decision on July 30 to keep the key short-term interest rate unchanged at 4.25%–4.50% for the fifth consecutive time, despite growing pressure from President Donald Trump to reduce borrowing costs.\n\nWeekly market outlook Nifty 50 From a technical standpoint, a sustained close below the 24,800–25,200 range has reinforced bearish sentiment, potentially opening the path for a further decline toward the 24,300 levels in the near term. A breach below 24,800 suggests a short-term pause or minor correction within the broader uptrend. The overall trend, however, remains bearish in the short term as long as the Nifty trades below the 25,000–25,200 mark. The 24,800–25,000 zone now emerges as a critical resistance area, supported by the highest Call Open Interest (OI). On the downside, 24,200 and 24,500 are key support levels, backed by significant Put OI. A sustained move above 25,200 would be essential to confirm the resumption of bullish momentum.\n\nBank Nifty The Bank Nifty also closed the week on a weaker note at 55,617, continuing to exhibit signs of weakness. The index now faces immediate resistance in the 56,500–57,000 zone, with a decisive breakout above this range potentially triggering a fresh uptrend. On the downside, the 55,000 level is expected to attract buying interest and acts as a crucial support level for the index.\n\nConclusion On a broader timeframe, both the Nifty and Bank Nifty closed the week below their respective monthly support levels—23,800 for Nifty and 56,000 for Bank Nifty—indicating a continuation of the prevailing short-term bearish sentiment. For the week ahead, key levels to watch include support at 24,200–24,300 and resistance at 25,200 for the Nifty, while Bank Nifty holds support between 55,000–55,500 and faces resistance at 57,000.\n\nTraders are advised to remain cautious and closely monitor global cues and geopolitical developments, which may influence short-term market direction. While the broader trend remains cautiously optimistic, a breakout above the identified resistance levels will be essential to confirm the resumption of upward momentum.\n\nWeekly stocks to buy or sell Buy National Aluminium Co at ₹178-180; Stop Loss at ₹174; Target Price of ₹188.\n\nBuy Central Depository Services (India) at ₹1470-1480; Stop Loss at ₹1430; Target Price of ₹1540.\n\nBuy Marico at ₹705-710; Stop Loss at ₹685; Target Price of ₹735."
    },
    {
        "title": "Stock market this week: RBI MPC meeting, India-US trade deal, Q1 earnings among top triggers for Dalal Street",
        "url": "https://www.livemint.com/market/stock-market-news/stock-market-this-week-rbi-mpc-announcement-india-us-trade-deal-q1-earnings-among-top-triggers-for-dalal-street-11754185661441.html",
        "text": "Indian stock markets closed sharply lower on Friday, August 1, as widespread selling marked the start of the August derivatives series. Investor sentiment was weighed down by concerns over tariffs, disappointing earnings, and continued foreign fund outflows.\n\nThe Sensex declined by 586 points, or 0.72 per cent , to close at 80,599.91, while the Nifty 50 dropped 203 points, or 0.82 per cent, ending the session at 24,565.35.\n\nBroader market indices saw steeper declines, with the BSE Midcap index slipping 1.37 per cent and the Small-cap index falling by 1.59 per cent.\n\n\"Domestic equity market navigated a volatile week marked by heightened uncertainty surrounding trade negotiations and subdued earnings. The market oscillated between cautious optimism and defensive positioning, ultimately ending lower due to a persistent FII outflow. With global headwinds, investors showed a preference for domestically driven stories with non-discretionary appeal, as broader sentiment turned selective. FMCG stocks stood out, benefiting from attractive valuations and insulation from external shocks, particularly amid escalating tariff threats. Globally, markets remained under pressure due to rising US inflation and hawkish signals from the Fed and BoJ, dampening hopes of immediate easing of interest rates, which weighed heavily on emerging markets.\n\nGoing forward, investors will closely monitor the upcoming RBI rate decision next week, while the risks remain tilted to the downside. A stable inflation outlook, potential progress in trade talks, and selective strength in domestic sectors are anticipated to lay the groundwork for a recovery,\" said Vinod Nair, Head of Research, Geojit Investments Limited.\n\nIndian stock market trends Equity benchmark indices declined for the fifth straight week amid ongoing selling pressure, global uncertainties, and a cautious market mood. Both the Nifty and Sensex experienced significant volatility before ending the week with steep losses at 24,512.20 and 80,218.52, respectively.\n\nOn the Nifty outlook next week, Rupak De, Senior Technical Analyst at LKP Securities, said, \"Nifty witnessed another sharp decline as it failed to reclaim the 200-DMA on the hourly chart, despite a strong recovery on Thursday. Throughout the day, the index remained below the 50-EMA on the hourly timeframe. On the daily chart, it has broken below the recent consolidation support at 24,600. Sentiment remains weak, with the potential for the correction to extend towards 24,400–24,450. A further decline is likely if it slips below 24,400; otherwise, a recovery can be expected. On the higher side, resistance is seen at 24,600–24,650 and 24,850.\"\n\nMeanwhile, on the Bank Nifty outlook, Pravesh Gour, Senior Technical Analyst at Swastika Investmart Ltd, said, “ The Bank Nifty continues to show signs of weakness, with the zone of 55,550 to 55,150 acting as a crucial support area. A breakdown below 55,150 could accelerate the selling pressure and drag the index lower towards the next key support at 54,500. On the upside, Resistance on bounce backs is seen at 56000 and 56500.”\n\nHere are the key triggers for stock markets in the coming week: RBI MPC meeting The Reserve Bank of India (RBI) monetary policy committee (MPC) meeting has been rescheduled to August 4 to August 6 from previously announced schedule of August 5–7, 2025.\n\n“ At the domestic level, all eyes will be on the Reserve Bank of India’s monetary policy meeting on August 6, where the central bank’s commentary on inflation, liquidity, and growth outlook will be keenly watched,” said Ajit Mishra – SVP, Research, Religare Broking Ltd.\n\nIndia-US trade deal With the India-US trade agreement still pending, the United States has implemented a 25% reciprocal tariff on Indian goods effective August 1, 2025. In addition, India could face further penalties due to its trade relations with Russia.\n\nAs a result, the tariff advantage India enjoyed under the April announcements has now reversed. India is now subject to higher tariffs compared to several Asian counterparts — Vietnam at 20%, Indonesia at 19%, and South Korea at 15%.\n\nIn response, the Indian government is contemplating imposing a digital tax on American tech giants such as Microsoft, Google, Meta, and Amazon. Despite this, both nations — particularly U.S. President Donald Trump — remain dedicated to pursuing discussions aimed at a potential India-U.S. trade agreement.\n\nQ1 earnings More than 900 companies have reported their financial results for the quarter ending on June 30, 2025. However, the earnings season is yet to be over as several marquee companies like Bharti Airtel, DLF, Bajaj Auto, Hero MotoCorp, Tata Motors, SBI, LIC etc. will be declaring their results in the upcoming week.\n\nIPO Activity The IPO buzz in the primary market is all set to continue in August 2025 also as 10 new public issues - 2 in mainboard and 8 in SME segment - are all set to open for subscription in the coming week.\n\nApart from new IPOs, the market will also witness listing of 12 IPOs in the upcoming week.\n\nAlso Read | Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday\n\nFII Activity Amid the combined impact of three major setbacks — a disappointing Q1 earnings season, the imposition of a harsh 25% tariff on Indian goods by Donald Trump, and the surge of a strong US dollar — foreign institutional investors (FIIs) have been aggressively offloading Indian stocks for nine consecutive trading sessions, with total outflows reaching a massive ₹27,000 crore.\n\nCrude Oil prices Oil prices fell by around $2 per barrel on Friday due to concerns over a potential production hike by OPEC and its allies, coupled with a disappointing U.S. jobs report that raised fears about weakening demand.\n\nBrent crude futures closed at $69.67 per barrel, dropping $2.03 or 2.83 per cent, while U.S. West Texas Intermediate (WTI) crude ended the session at $67.33 per barrel, down $1.93 or 2.79 per cent.\n\nGold Prices Gold prices climbed nearly 2% on Friday, reaching a one-week high, as softer-than-expected U.S. payroll data strengthened expectations of a Federal Reserve rate cut, while new tariff announcements increased demand for safe-haven assets.\n\nSpot gold rose by 1.8% to $3,347.66 per ounce as of 1:48 p.m. ET (17:48 GMT), after briefly gaining as much as 2% earlier in the day. For the week, bullion posted a 0.4% increase.\n\nTechnical View According to Ajit Mishra – SVP, Research, Religare Broking Ltd, the Nifty’s close below the 24,600 mark confirms a bearish bias, with the short-term structure suggesting scope for further downside unless a strong rebound materializes.\n\n“ The index now finds immediate support near the 24,450 zone, and a breach below this level may accelerate the decline toward 24,180, which coincides with the long-term 200-day exponential moving average (DEMA). In the event of a recovery, the 24,800 level would act as the first resistance, followed by a significant hurdle around the 25,000–25,250 zone,” Mishra said.\n\nOn the Bank Nifty outlook, Mishra further said that the index is also gradually trending lower despite visible strength in heavyweight constituents like ICICI Bank and HDFC Bank.\n\n“ Going forward, the 54,500–55,100 zone is likely to provide support in case of further declines, while the 56,500 mark, aligned with the 20-day EMA, will act as the first major resistance. Only a decisive move above 57,400 can revive bullish sentiment in the banking space,” Mishra added."
    },
    {
        "title": "Multibagger stock: PC Jeweller Q1 results out; YoY profit jumps 122% on 81% rise in sales",
        "url": "https://www.livemint.com/market/stock-market-news/multibagger-stock-pc-jeweller-q1-results-out-yoy-profit-jumps-122-on-81-rise-in-sales-11754130453560.html",
        "text": "Multibagger stock: PC Jeweller share price will be focused on Monday as the jewellery company has declared robust Q1 results for 2025. In PC Jeweller's Q1 results, the jewellery brand reported a gross profit of ₹144 crore in the April to June 2025 quarter, which stood at ₹65 crore in the corresponding period of the previous financial year. This could become possible with a massive year-on-year (YoY) jump in company sales from ₹401 crore to ₹725 crore. The company board approved PC Jeweller's Q1 results on Friday evening.\n\nPC Jeweller's EBITDA grew 136% from ₹89 crore to ₹210 crore. Likewise, the company's Profit Before Tax (PBT) almost doubled from ₹83 crore to ₹164 crore in Yoy terms.\n\nPC Jeweller Q1 results 2025 PC Jeweller informed the Indian stock market exchanges about the announcement of the Q1FY26 results, saying, \"The Q1 FY 2026 had been very promising and fulfilling for the company. The company closed the quarter on a powerful note, clocking robust performance riding on its customers’ trust and goodwill. The company's financials, which showcased a significant improvement in the previous financial year, have also continued to exhibit further improvement in Q1 FY 2026. The company’s turnover comprises only domestic sales, and it has no export/foreign exposure, including in the USA.\"\n\nPC Jeweller had already reduced its outstanding debt towards its banks by more than 50% in the FY 2024-25. It has further reduced its outstanding debt payable to its banks, which stood at the end of the previous fiscal year as per the terms of the Settlement Agreement, by another approx. 8.7% during the quarter ended 30th June 2025, and another approx. 10.1% in July 2025. The company is targeting and is confident to discharge its complete obligations towards its banks by the end of FY 2026, thereby becoming debt-free. Further, the company had already raised ₹2,702.11 crores during the previous FY via preferential issue of fully convertible warrants, and the Board of Directors vide their meeting held on 10th July 2025, approved further raising of funds aggregating up to approx ₹500 crores by way of Preferential Allotment on private placement basis.\n\nPC Jeweller share price history PC Jeweller shares are one of the multibagger stocks the Indian stock market has delivered in recent years. It has given over 9005 returns to its long-term investors in the last five years, while its return in one year is close to 55%. The jewellery company decided on a 1:10 stock split in December 2024 to enhance the stock's liquidity. The above calculations are taken after the price adjustment post-stock split, but they don't add the post-split benefits that a long-term investor has drawn."
    },
    {
        "title": "Sri Lotus Developers IPO subscribed 74 times; beat peers Kalpataru, Keystone Realtors, Macrotech Developers",
        "url": "https://www.livemint.com/market/ipo/sri-lotus-developers-ipo-subscribed-74-times-beat-peers-kalpataru-keystone-realtors-macrotech-developers-11754128252695.html",
        "text": "Sri Lotus Developers IPO subscription status: Bidding for the initial public offering (IPO) of Sri Lotus Developers Ltd ended on Friday, and focus has now shifted to the Sri Lotus Developers IPO allotment date, which can be announced either today or on Monday next week. The public issue received a strong response from the Indian primary market investors as it had been subscribed to around 74 times. Comparing the Sri Lotus Developers IPO subscription status with recently listed peers of the realty company, the Sri Lotus Developers IPO is far ahead of them.\n\nThe extraordinary demand from institutional investors sets this Sri Lotus Developers IPO apart. The Qualified Institutional Buyers (QIB) category alone saw an oversubscription of 175 times, reflecting strong institutional confidence in the company’s business fundamentals, project pipeline, and market positioning.\n\nComparison with peers Sri Lotus Developers peer Kalpataru Projects, listed on the BSE and NSE on 1 July 2025, was subscribed around 2.30 times, while its QIB portion was subscribed slightly over 3 times. Another peer, Keystone Realtors, listed on the BSE and the NSE on 24 November 2022, had been subscribed to around two times, and its QIB portion had been booked close to four times. Another peer, Macrotech Developers (Lodha), IPO listed on the BSE and NSE in April 2021, had been subscribed around 1.36 times, whereas its QIB portion had been filled slightly over 3 times.\n\nKey factors for such a strong subscription On the reasons that fueled Sri Lotus Developers' IPO subscription status, Avinash Gorakshkar, an SEBI-registered fundamental analyst, said, \"Several factors have contributed to the resounding success of Lotus Developers’ IPO: a mid-sized company with a focused development approach and strategic location of company projects. The market mood also fueled Sri Lotus Developers' IPO subscription status.\"\n\nPromoters hold a 91.78 per cent stake in Lotus Developers, and 150 public shareholders, including Bollywood stars Ashish Kacholia, NAV Capital, Dovetail Global Fund, Minerva Ventures, and Oppbasket, hold the remaining 8.22 per cent equity stake.\n\nOn September 16 last year, the company had raised ₹139.4 crore via private placement with allotment to investors including Money Spinners, Sera Investments, Smart Algo Solutions, NAV Capital, Dovetail Global Fund, Minerva Ventures, Yantra E-Solarindia, and Oppbasket.\n\nFurther, on December 14 last year, it raised ₹399.2 crore via another private placement to investors including Ashish Kacholia, Abundantia Capital, Astorne Capital, AARII Ventures, Topgain Finance, Turtle Crest, Aminiti Builders & Developers, DRChoksey Finserv, Jagdish N Master, and Nurture Pranay Foundation.\n\nAshish Kacholia invested nearly ₹50 crore in the company for 33.33 lakh shares, while well-known names in the film industry, such as Shah Rukh Family Trust, Amitabh Bachchan, Ektaa Ravi Kapoor, Tusshar Ravi Kapoor, Jeetendra Alias Ravi Amarnath Kapoor, Tiger Jackie Shroff, Rajkumar Yadav, Rakesh Roshan, Hrithik Rakesh Roshan, Sajid Suleman Nadiadwala, and Manoj Bajpayee picked 19.28 lakh shares in Lotus Developers for ₹28.92 crore.\n\nAnand Kamalnayan Pandit-promoted company will use ₹550 crore of IPO proceeds to partially fund the development and construction costs of ongoing projects, Amalfi, The Arcadian, and Varun, by subsidiaries Richfeel Real Estate, Dhyan Projects, and Tryksha Real Estate, respectively. The remainder of the funds will be used for general corporate purposes."
    },
    {
        "title": "FPIs pullout  ₹17741 cr from Indian equities in July, high selling this week turns July investment negative: NSDL",
        "url": "https://www.livemint.com/market/stock-market-news/fpis-pullout-rs-17741-cr-from-indian-equities-in-july-high-selling-this-week-turns-july-investment-negative-nsdl-11754127758042.html",
        "text": "New Delhi [India], August 2 (ANI): Foreign portfolio investors (FPIs) turned net sellers in the Indian equity market in July, with a total outflow of ₹-17,741 crore, according to data released by NSDL.\n\nThis marks the first month of negative investment by FPIs after three consecutive months of positive inflows during April, May, and June.\n\nThe sharp reversal in sentiment was driven by a sudden surge in selling during the last week of July. Between 28 July and 1 August, foreign investors pulled out ₹17,390.6 crore from Indian equities, which significantly impacted the overall monthly numbers and pushed July's investment into negative territory.\n\nThe recent selling pressure is largely due to the fresh reciprocal tariffs imposed by the United States, which has impacted India among several other countries.\n\nThese tariffs have raised concerns over global trade stability and investor sentiment, prompting FPIs to reassess their exposure in markets.\n\nThe data also highlighted that May saw the highest FPI inflows so far in 2025, while January witnessed the largest sell-off, with net selling of ₹-78,027 crore.\n\nWith the recent selling in July, the total net outflow by FPIs in the calendar year 2025 has now crossed ₹-1,01,795 crore.\n\nThe reversal in FPI trend raises concerns for the Indian equity market, which had been witnessing strong support from foreign investors in the previous months.\n\nHowever, the global economic developments like reciprocal tariffs by US President Trump and geopolitical tensions between US and Russia will continue to influence FPI behavior in the coming weeks.\n\nIn the previous month of June, FPIs had made a net investment of ₹14,590 crore in the Indian equity segment. In May, foreign investors poured in ₹19,860 crore, making it the best-performing month of the year so far in terms of FPI inflows."
    },
    {
        "title": "Upcoming IPO: ARCIL files draft papers with SEBI for public offer of over 10.5 crore shares",
        "url": "https://www.livemint.com/market/ipo/upcoming-ipo-arcil-files-draft-papers-with-sebi-for-public-offer-of-over-10-5-crore-shares-11754125340873.html",
        "text": "ARCIL IPO: Asset Reconstruction Company (India) Limited (ARCIL) has filed its draft papers with markets regulator SEBI to float its initial public offering (IPO), with hopes of becoming listed as India's oldest asset reconstruction company.\n\nARCIL is the latest among a number of companies that have sought SEBI nod to float their public offers amid an ongoing IPO flood at the primary markets in India."
    },
    {
        "title": "Trump India tariff: Can the Indian stock market sustain against the sell-off storm? Explained with five reasons",
        "url": "https://www.livemint.com/market/stock-market-news/trump-india-tariff-can-the-indian-stock-market-sustain-against-the-sell-off-storm-explained-with-five-reasons-11754123061676.html",
        "text": "Trump India tariff: Following the selling pressure after the imposition of Trump's tariffs on India on 31st July 2025, the Indian stock market ended lower on Thursday and Friday sessions. The Nifty 50 index slipped from 24,855 to 24,565 levels, the BSE Sensex went down from 81,481 to 80,599 levels, while the Bank Nifty index corrected from 56,150 to 55,617 levels. The selling was across segments as the small-cap index slipped from 53,881 to 52,575 levels, and the mid-cap index went down from 46,102 to 45,155.\n\nThe only good news for the Indian stock market investors is that the Nifty 50 index is sustaining above the crucial 24,500 support, and buying is around 24,600. This has triggered speculation about whether the Indian stock market will be able to show resilience against Trump's tariffs and witness a trend reversal in the near term.\n\nAccording to stock market experts, Dalal Street has witnessed selling post-imposition of Trump's tariff on India, but this selling failed to rattle the market sentiments as the key benchmark indices are sustaining above their crucial supports. They said that selling was expected as Trump's tariff would hit Indian exports by around $33 billion, but this won't have much impact on the Indian market sentiments.\n\nTrump's tariff impact On how Trump's tariff on India will impact New Delhi, Vinod Nair, Head of Research at Geojit Investments, said, \"The US is India's largest export destination, contributing around 2.2% to the nation's GDP in 2024. As such, the 25% tariff is likely to exert pressure on the domestic economy. However, the effect is forecast to be limited based on the scope of the tariff in other EMs, as currently India has a small edge over key competitors like China. However, the tariff on other EMs has been reduced lately, like in Vietnam, Indonesia, and South Korea. It is expected to impact areas like Engineering, Pharma, Energy, Textile and Jewellery sectors more.\"\n\nPointing towards the key takeaways for the Indian economy after Trump's tariff on India, Prashant Tandon, Executive Director — Global Investments at Waterfield Advisors, said, \"We appear to be entering an era of re-globalisation—characterised by strategic integration, regional blocs, and trusted partnerships. Diverging markets illustrate this rebalancing, not disintegration. Investors should anticipate greater dispersion across geographies and sectors. Potential opportunities for supply chain resilience and infrastructure may arise, domestic industrial leaders benefiting from supportive policies, and companies focused regionally or aligned geopolitically.\"\n\n\"The Indian stock market has shown notable resilience even after former US President Donald Trump announced a 25% tariff proposal on certain Indian exports. Many expected this move to rattle investor sentiment, but the markets remained steady. In my view, there are a few important reasons behind this reaction,\" said Gaurav Goel, Founder & Director at Fynocrat Technologies.\n\niff ooFive reasons why market not overreacting On why the Indian stock market didn't overreact to Trump's tariff on India, Gaurav Goel of Fynocrat Technologies listed out the following five reasons:\n\n1] Trump's timing: Trump’s tariff announcement came just before the expected August 1 deadline, which gives the impression that it was more of a strategic warning shot than a final decision. The message seems to increase pressure on India to negotiate more favourable trade terms. Trump also clarified that talks with India are ongoing, giving markets hope that this may not result in a full-fledged trade blow.\n\n2] India-US trade deal still on: American delegates are scheduled to visit New Delhi on August 25 for trade discussions. This indicates that there is still room for resolution. Investors believe that both sides will come to the table and work out a deal. Until the outcome is clear, markets are likely to avoid overreacting.\n\n3] DIIs support: Another big reason for resilience is the strong support from domestic institutional investors (DIIs). On July 31 alone, DIIs were net buyers of ₹6,372 crore. Consistent buying cushions against external shocks reflects confidence in the Indian economy’s strength.\n\n4] Discounted Indian markets: It's important to note that this tariff issue has been stretched for quite some time. Markets typically react sharply to sudden, unexpected news, but in this case, the risk has been lingering for weeks. As a result, investors have already priced in much of the uncertainty. The market's sensitivity has naturally reduced since it’s no longer a surprise.\n\n5] Growth theme still intact: Explaining the impact of Trump's tariff on the national economy, Seema Srivastava, Senior Research Analyst at SMC Global Securitieis, said, “In the current economic scenario, Trump's tariffs are expected to bring down the Indian GDP growth by arouond 30 bps, which can be mitigated with the domestic demand. The 25% tariff imposed by the US administration will have a limited impact on the key sectors like pharmaceuticals, textiles, automobiles, and gems and jewellery.”\n\n\"Investors are expected to switch money from companies with exposure in US exports and look at domestic-oriented segments like banks, FMCG, Infrastructure, etc. Investors are expected to switch money from pure auto stocks to EV and auto ancillary stocks. So, we expect limited impact of Trump's tariffs on the Indian stock market as investors have already discounted the event much ahead of Donald Trump's announcement,\" said Seema Srivastava, who is a professional CA also.\n\nTrump's tariff on India Contrary to widespread expectations and dashing New Delhi's hopes of a relatively better trade deal, US President Donald Trumpannounced a 25 per cent tariff on \"friend\" India on July 30, to be effective August 1. The 25 per cent tariff excludes a penalty due to India's energy and defence ties with Russia.\n\nTrump accused India of imposing higher tariffs on US imports and also having the \"most strenuous\" trade barriers.\n\n“While India is our friend, we have, over the years, done relatively little business with them because their tariffs are far too high, among the highest in the world, and they have the most strenuous and obnoxious non-monetary trade barriers of any country,” Trump said on his social media platform Truth Social."
    },
    {
        "title": "Stocks to buy under  ₹200: Mehul Kothari of Anand Rathi recommends three shares to buy or sell",
        "url": "https://www.livemint.com/market/stock-market-news/stocks-to-buy-under-rs-200-mehul-kothari-of-anand-rathi-recommends-three-shares-to-buy-or-sell-11754116970465.html",
        "text": "Stocks to buy under ₹200: As expected, July 2025 was a month of profit booking and correction for the Indian stock market. The 25,800 zone acted as a formidable hurdle for the Nifty 50 index, and in the absence of any strong positive trigger, the key benchmark index corrected over 1,000 points from the highs. The index ended the month with a loss of nearly 3%, currently hovering below the 24,600 mark. The damage was even more pronounced in the broader markets, where the Smallcap Index plunged around 6% and the Midcap Index declined by 4%. Risk appetite took a hit, and profit booking was visible across sectors.\n\nStock market next week Mehul Kothari, Deputy Vice President — Technical Research at Anand Rathi, has consistently highlighted the golden crossover in Nifty 50, where the 50-DEMA crossed above the 200-DEMA — a technically positive development. However, history suggests that a mean reversion often follows such crossovers before the next leg of the uptrend begins. In line with that, the Nifty 50 is approaching its 200-DEMA and DSMA, converging around the 24,200–24,000 zone. Adding to the caution, a bearish candlestick formation is emerging on the monthly chart — and while it's still early, this being the first month of such a signal is slightly concerning.\n\nSpeaking on the outlook of the Nifty 50 today, Mehul Kothari of Anand Rathi said, \"On the daily chart, momentum oscillators are not yet in deep oversold territory, suggesting that the correction might not be over yet. A breach below 24,450 — a key horizontal support — could drag the index further down towards the 24,000 mark, and in a worst-case scenario, even towards 23,800–23,600. These levels could offer a strong mean-reversion opportunity for medium-term investors. On the upside, 25,000 remains a psychological resistance, and only a decisive move above it can revive bullish sentiment. For traders, the approach should remain highly selective and risk-managed — avoid aggressive bottom-fishing and focus only on strong relative strength stocks. This remains a market to survive first, profit later.\"\n\n\"The Bank Nifty index made a high near 57,600, but as we had cautioned, the 58,000–58,500 trendline resistance zone proved too strong to cross. In line with our view, the index slipped over 2% during July 2025. Bank Nifty is close to its 200 DEMA, just below the 55,000 mark — barely a per cent away from current levels. This zone will be crucial to watch. If the index finds support here, we could see a short-term bounce. On the upside, 56,500 remains a near-term hurdle, but the real test continues to be the 58,000–58,500 zone, where the long-term trendline resistance still looms large,\" he added.\n\nMehul Kothari's stock recommendations under ₹ 200 Regarding stocks to buy under ₹200, Mehul Kothari of Anand Rathi recommended buying VRPL, UCO Bank, and IDFC First Bank on Monday.\n\n1] VRPL: Buy at ₹158 to ₹160, Target ₹175, Stop Loss ₹154;\n\n2] UCO Bank: Buy at ₹28 to ₹29, Target ₹34, Stop Loss ₹26; and\n\n3] IDFC First Bank: Buy at ₹67 to ₹68, Target ₹75, Stop Loss ₹64."
    },
    {
        "title": "Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — 4 August 2025",
        "url": "https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-4-august-2025-11754115046355.html",
        "text": "Buy or sell stocks: Following weak global cues after Trump's tariff bombshell on Thursday night, the Indian stock market ended lower on Friday. The Nifty 50 index finished southward for the fifth successive week, its prolonged losing streak since the week ending August 25, 2023. This selling was across segments, as the BSE Sensex and the Bank Nifty index witnessed selling pressure in the previous week, while the small-cap and mid-cap indices ended more than 2% lower last week.\n\nStock market next week Sumeet Bagadia, Executive Director at Choice Broking, believes the Indian stock market is trading cautiously after the US administration's imposition of a 25% tariff. The Choice Broking expert said the Nifty 50 index is in the 24,500 to 24,950 range. A bullish or bearish trend can be assumed on the breakage of either side of this range.\n\nSpeaking on the outlook of the Nifty 50 index, Sumeet Bagadia said, \"The Indian stock market sentiment is cautious as the Nifty 50 index is trading in the 24,500 to 24,850 range. The key benchmark index has crucial support placed at 24,500, whereas it is facing resistance at the 50-DEMA of 24,900 to 24,950. A bullish or bearish trend can be assimilated on the breakage of either side of this range.\"\n\nSumeet Bagadia's stock recommendations The Choice Broking expert suggested investors look at stocks that look strong on the technical chart and recommended buying ITC, Asian Paints, and Metropolis Healthcare next week.\n\n1] ITC: Buy at ₹416.45, Target ₹450, Stop Loss ₹400.\n\nITC's share price is currently trading at ₹416.45 and has witnessed a decline of nearly 22% from its recent highs, followed by a prolonged consolidation phase. The stock has recently formed a Falling Wedge pattern on the daily chart—typically a bullish reversal setup that indicates a potential breakout on the upside. ITC's share price now appears to be on the verge of breaking out of this formation, supported by consistent trading volumes that reflect steady accumulation at lower levels.\n\nA sustained move above the ₹425 mark would confirm the breakout, potentially triggering a trend reversal and opening up room for a move toward higher price levels. This breakout would also signal a shift in sentiment from consolidation to strength.\n\nFrom a momentum perspective, the Relative Strength Index (RSI) stands at 51.31 and has recently given a positive crossover, moving upward and suggesting improving bullish momentum. Technically, the stock is hovering between its short-term and medium-term EMAs. A successful hold above these levels, followed by a sustained move above the long-term EMA, would further strengthen the bullish outlook.\n\nGiven the encouraging technical pattern, steady volumes, and improving momentum, traders may consider buying ITC shares at the current market price of ₹416.45, with a stop-loss at ₹400 to limit downside risk. A breakout above ₹425 could pave the way for an upside toward ₹450 in the short to medium term, offering a favourable risk-reward opportunity.\n\n2] Asian Paints: Buy at ₹2431, Target ₹2650, Stop Loss ₹2320.\n\nAsian Paints' share trades at ₹2,431 and moves within a broad consolidation range near its lower levels. This extended consolidation phase, supported by steady trading volumes, indicates accumulation and growing investor interest at these price zones. The stock has recently shown signs of recovery, bouncing from its short-term and medium-term exponential moving averages (EMAs). While it has attempted to cross above its long-term EMA, it has yet to sustain a close above that level—making a decisive breakout above it crucial for further strength.\n\nA sustained move above the ₹2,500 level could confirm bullish momentum, potentially triggering a fresh upward leg in the price action. This breakout would signify the end of the current range-bound behaviour and open the door for further gains toward higher levels.\n\nFrom a momentum perspective, the Relative Strength Index (RSI) stands at 59.29 and has recently given a positive crossover, trending upward. This suggests strengthening momentum and increasing bullish sentiment, further supported by price action holding above key EMAs.\n\nGiven the constructive chart structure, improving RSI, and substantial volume support, traders may consider buying Asian Paints shares at ₹2,431, with a stop-loss placed at ₹2,320 to manage downside risk. A sustained breakout above ₹2,500 could lead to an upside toward ₹2,650 in the short to medium term, offering an attractive risk-reward setup for positional traders.\n\n3] Metropolis Healthcare: Buy at ₹2037.70, Target ₹2260, Stop Loss ₹1925.\n\nMetropolis Healthcare's share price is currently trading at ₹2,037.70 and has shown signs of strength after a corrective move from its recent swing high. Following the decline, the stock entered a consolidation phase and witnessed a strong bounce from its demand zone, indicating renewed buying interest at lower levels. Metropolis Healthcare's share price on the daily chart is forming a Cup & Handle pattern. This bullish continuation formation typically signals the potential for further upward movement once the breakout is confirmed.\n\nA recent spike in trading volumes further validates the accumulation during the handle formation, indicating strong participation. A sustained move above ₹2,100 would confirm the breakout from this bullish setup and could trigger a fresh upward rally, resuming the stock's prior uptrend.\n\nFrom a momentum standpoint, the Relative Strength Index (RSI) is at 63.54 and has given a positive crossover, suggesting strong bullish sentiment and further upside potential. Additionally, the stock has retraced towards its short-term EMA and is now comfortably trading above all key moving averages—short-term, medium-term, and long-term—reinforcing the positive outlook."
    },
    {
        "title": "Stock market this week: Top gainers and losers among small-cap, mid-cap, and large-cap stocks",
        "url": "https://www.livemint.com/market/stock-market-news/weekend-wrap-august-1-stock-market-bse-nse-top-gainers-and-losers-mutual-funds-ipo-nfo-nifty50-markets-elss-11754113970593.html",
        "text": "Top News\n\n1. SEBI extends implementation timeline for nomination circular phases The Securities and Exchange Board of India (SEBI) has released an official update regarding the phases of implementation for the Nomination Circular. Initially, the new requirements under Phase II and Phase III were planned to take effect on June 1, 2025, and September 1, 2025, respectively. In response to industry feedback and to support system enhancements by depositories, depository participants, and industry associations, SEBI has provided an extension for these phases. The revised timeline now places the implementation date for Phase II on August 8, 2025, while Phase III is set to begin on December 15, 2025. All other aspects and provisions within the original circulars dated January 10, 2025, and February 28, 2025, remain unchanged, ensuring continued regulatory consistency.\n\nAlso Read | Markets dive after Trump hits more countries with steep tariffs\n\n2. Strong investor interest seen in recent IPO subscriptions On the capital markets front, several initial public offerings (IPOs) have garnered significant attention from investors. As of August 1, 2025, the IPO of NSDL has achieved a subscription level of 41.02 times, reflecting broad interest among market participants. M&B Engineering Ltd.’s IPO has been subscribed 38.11 times, while the IPO for Sri Lotus Developers & Realty Ltd has recorded a subscription of 74.10 times on the same day. These subscription figures represent the cumulative interest from various investor categories during the public offering period.\n\nAlso Read | These 10 new fund offers (NFOs) are open for subscription in August\n\n3. New mutual fund offerings launched by leading AMCs\n\n\n\nIn the mutual funds space, leading asset management companies have introduced new fund offerings (NFOs) that cater to various investment strategies and risk appetites. Aditya Birla Sun Life AMC, Zerodha AMC, and Motilal Oswal AMC have launched the Bajaj Finserv Equity Saving – Growth Direct Plan. Kotak AMC has introduced two offerings: Kotak Nifty Alpha 50 Index Growth Direct Plan and Kotak Active Momentum Growth Direct Plan. Additional launches include the 360 One Multi Asset Allocation Growth Direct Plan and the Bank of India Mid Cap Growth Direct Plan. These new funds provide investors with a variety of options to diversify their portfolios across different asset classes and investment objectives.\n\nIndex Returns\n\nBest Performers\n\nWorst Performers\n\nBought and Sold\n\nMost Watchlisted"
    },
    {
        "title": "Jim Cramer reveals he hates August and September: ‘Just tough months to…’",
        "url": "https://www.livemint.com/market/stock-market-news/jim-cramer-reveals-he-hates-august-and-september-just-tough-months-to-11754111525951.html",
        "text": "‘Mad Money’ host Jim Cramer on Friday said that August and September are the ‘toughest months’ to make money, adding that he ‘despises’ these months.\n\n“i always despise both August and September.. just tough months to make money [sic],” Cramer said in a post on X.\n\nCramer's comments came on the first day of August, which along with September, is historically considered as a slow month for investors putting their money in tech stocks.\n\nSince 1971, August has been the second-worst month of the year for the tech-heavy Nasdaq Composite COMP.\n\nOn the other hand, September has been the worst performing month, on average, going back nearly a century.\n\nReacting to Cramer's opinion, a user commented, “The deadliest thing in August isn’t volatility. It’s false confidence based on lagging data, fake job reports, delayed Fed pivots, and media narratives cooked for election optics. August is when the system cracks — quietly. September is when it bleeds out loud.”\n\nWall Street ends lower on August 1 Jim Cramer's prediction seemed to be true on the first day of August itself.\n\nThe US stock market had its worst day since May on Friday, August 1, after the government reported a sharp slowdown in hiring and President Donald Trump imposed sweeping tariffs on imports from a number of US trading partners.\n\nAlso Read | Stocks slump on latest tariffs, soft jobs data\n\nThe S&P 500 fell 1.6%, its biggest decline since May 21 and its fourth straight loss. The index also posted a 2.4% loss for the week, marking a sharp shift from last week’s record-setting streak of gains.\n\nThe Dow Jones Industrial Average fell 1.2%, while the Nasdaq composite fell 2.2%.\n\nWorries on Wall Street about a weakening economy were heavily reinforced by the latest report on job growth in the U.S. Employers added just 73,000 jobs in July. That is sharply lower than economists expected. The Labor Department also reported that revisions shaved a stunning 258,000 jobs off May and June payrolls."
    },
    {
        "title": "India-US trade deal: Top five roadblocks that may arise after Trump's tariffs on India",
        "url": "https://www.livemint.com/market/stock-market-news/indiaus-trade-deal-top-five-roadblocks-that-may-arise-after-trumps-tariffs-on-india-11754109518038.html",
        "text": "India-US trade deal: Despite strong strategic ties, a comprehensive India-US trade deal remains elusive. The probability of getting it inked in the near term looks dicey after the imposition of Trump's tariffs on India. In retaliation, the Indian government is also considering levying a digital tax on US companies like Microsoft, Google, Meta, Amazon, etc. However, both countries, especially US President Donald Trump, remain committed to continuing talks for a possible India-US trade deal.\n\nAccording to experts, Trump's tariff on India is expected to hit Indian exports by $33 billion. The Indian government may compensate by imposing reciprocal taxes on US imports. They said the Indian government may think of reimposing digital tax on US companies after removing it from 1st April 2025. However, they maintained that after Trump's tariffs on India, the Narendra Modi government may go tough on the negotiations, especially on the US government's demand to provide Access to the Indian dairy and agriculture segment. They said that penalties on Russian crude oil imports, an unpredictable trade negotiation environment, mutual mistrust, etc., are some other roadblocks that may arise in the India-US trade deal after Trump's tariffs on India.\n\nIndia-US trade deal post-Trump's tariffs Speaking on the roadblocks in the India-US trade deal, especially after Trump's tariffs on India, Utsav Verma, Head of Research — Institutional Equities at Choice Broking, said, \"India-US trade negotiations are less about tariffs and more about reconciling fundamentally divergent policy philosophies. For any forward movement, establishing a permanent consultative mechanism, calibrated concessions in sensitive sectors, and depoliticized trade diplomacy are prerequisites.\"\n\nVerma said that future progress will likely depend on the outcome of upcoming leadership cycles, alignment on digital trade rules, and a reimagining of economic partnership beyond WTO-era thinking.\n\n\"Biggest roadblock in the India-US trade deal post-imposition of Trump's tariffs on India is India's loss of around $33 billion in exports. To compensate for those losses, the Indian government may develop reciprocal taxes, which may become a roadblock in the India-US deal. The Indian government may go tough on the US demand for Access to the dairy and agriculture segment. At the same time, the US may not comply with the Indian demands on the Russian crude oil imports,\" said Avinash Gorakshkar, a SEBI-registered fundamental analyst.\n\nOn the reciprocal taxes India may levy on the US, Avinash Gorakshkar said, \"The way the US government has raised tariffs on Indian imports, the Indian government may also raise tariffs on US imports. They may also think of reimposing the digital tax on income from online digital advertisements from US companies. If they do so, it would be highly detrimental for US tech giants like Microsoft, Meta, Alphabet, Google, Amazon, etc.\"\n\nIndia-US trade deal: Top 5 roadblocks Experts said the most-awaited deal may face some major roadblocks, including mutual mistrust, an unpredictable negotiation environment, US demand for Access to the dairy and agriculture segment, strategic autonomy against geopolitical alignment, and a penalty on Russian crude oil imports.\n\n1] Mutual mistrust: \"India-US trade tensions have been shaped by over 90 WTO disputes since 1995 (WTO, 2024). The 2019 end of GSP benefits affected $5.6 billion in Indian exports (USTR, 2020). In 2024, the US reported a $27.4 billion trade deficit with India (US Census Bureau), fueling calls for better Access. India, however, sees these demands as imbalanced. A 2023 Brookings survey found only 41% of Indian policymakers viewed US trade policy as mutually beneficial. Still, trust has grown in defence, pharma, and tech. During COVID-19, both nations collaborated, and US FDI in India reached $8.3 billion in FY23 (DPIIT),\" said Utsav Verma of Choice Broking.\n\n2] Russian crude oil imports: \"Even though Trump's tariffs have left Indo-Russian crude oil business untouched, the uncertainty around the implementation of penalties due to the import of Russian crude persists. Already, Indian refineries have started to reduce imports, which can increase the cost of crude and impact currency and inflation,\" said Vinod Nair, Head of Research at Geojit Investments.\n\n3] Unpredictable negotiation environment: \"US policy shifts—from Obama to Biden—have made trade negotiations volatile. Tariffs on steel (25%) and aluminium (10%), renewed in 2025, worsened uncertainty. Talks during 2023–25 were delayed thrice due to political cycles. Unlike the EU or ASEAN, India and the US lack a formal negotiation council. Utsav Verma said the Trade Policy Uncertainty Index rose 32% for India-US trade post-2022, compared to 18% for EU-US (EPU Project, 2024).\n\n4] Access to dairy, agriculture segment: \"Agriculture supports 58% of India's rural workforce (NABARD, 2023). Opening dairy markets could expose smallholders to subsidized US imports. The US seeks entry for poultry, corn, ethanol, and hormone-treated dairy, raising safety and religious concerns. India's average agri-tariffs stand at 39.5%, with bound rates at 113.1%, against the US's 5.4% (WTO, 2024). A NITI Aayog-CRISIL study shows a 10% US dairy entry could cut Indian prices by 17%. India exported $4.3 billion in agri-products to the US in FY24 but imported only $860 million (APEDA, 2024). Still, partnerships in agritech and sustainable farming—like joint ethanol blending and improved standards —suggest opportunities, said Verma.\n\n5] Geopolitical divergence: Pointing towards the strategic autonomy against the geopolitical alignment, Utsav Verma of Choice Broking, said, \"India's $10 billion defence ties with Russia challenge US alignment goals (SIPRI, 2024). India resists being cast solely as a counterweight to China and maintains sovereignty—as seen in its completion of the S-400 deal despite CAATSA threats. Defence trade with the US reached $20 billion in 2024 (US DoD), yet digital cooperation lags due to India's focus on data sovereignty. With elections looming (India in 2029, US in 2028), nationalism may complicate compromise. Nonetheless, shared interests in Indo-Pacific security, climate tech, and resilient supply chains provide buffers that keep strategic engagement intact.\""
    },
    {
        "title": "Q1 Results Today: Federal Bank, ABB India, Medplus Health Services among 56 companies to declare earnings on August 2",
        "url": "https://www.livemint.com/market/stock-market-news/q1-results-today-federal-bank-abb-india-medplus-health-services-among-56-companies-to-declare-earnings-on-august-2-11754102749353.html",
        "text": "Q1 Results Today, 2 August: Federal Bank, ABB India, Sarda Energy and Minerals, Finolex Industries and Medplus Health Services are some of the major companies among the 56 companies that are scheduled to release their Q1 earnings report today on August 2.\n\nIn total, over 200 companies are listed to announce their Q1FY26 results during the week of July 28 to August 2. These include major names such as IndusInd Bank, Asian Paints, NTPC, Tata Steel, Hindustan Unilever, Mahindra & Mahindra, Maruti Suzuki, Sun Pharma, and ITC among others.\n\nInvestors are watching keenly as companies continue to declare their June quarter earnings of the current financial year. The corporate announcements, forward looking statements, revenue outlooks, and share prices of the companies who declare their quarterly earnings enables investors to chalk out their investment strategy.\n\nQ1 results today: Saturday — 2 August, 2025 At least 56 companies are declaring their Q1 results on 1 August. Here is a full list of companies announcing their June quarter earnings today, as per BSE:\n\nIndian stock markets close in red again The Indian stock market ended with significant losses on Friday, August 1, due to broad-based selling on the first day of the August derivatives series, amid concerns over tariffs, lacklustre earnings, and sustained foreign capital outflows."
    },
    {
        "title": "Tata Power vs Adani Power: Which stock to buy after Q1 results 2025? EXPLAINED",
        "url": "https://www.livemint.com/market/stock-market-news/tata-power-vs-adani-power-which-stock-to-buy-after-q1-results-2025-explained-11754102153576.html",
        "text": "Tata Power vs Adani Power: Indian power majors, Tata Power and Adani Power, declared their Q1 results 2025 on Friday. Both companies reported a strong set of numbers. Adani Power boasts a strong PAT 9Profit After Tax) and EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortisation), while Tata Power reported its 23rd consecutive quarter of PAT growth, with a strong focus on clean energy, manufacturing, and distribution expansion. This is expected to put Adani Power and Tata Power shares under the bulls' radar on Monday, as these companies have reported strong Q1 results despite weak power demand.\n\nQ1 results 2025 review Speaking on the Q1 results 2025 reported by these Indian power majors, Seema Srivastava, Senior Research Analyst at SMC Global Securities, said, \"During Q1FY26, Adani Power boasts a strong Profit After Tax of ₹3,305 crore and Continuing EBITDA of ₹5,744 crore, showcasing its resilience. Its strategic focus on swift project execution, strategic acquisitions, and sustainability positions it for future growth towards its 30 GW target by 2030. On the other hand, Tata Power has a 6% YoY growth in Profit After Tax, marking its 23rd consecutive quarter of PAT growth, with a strong focus on clean energy, manufacturing, and distribution expansion.\"\n\nSpeaking on Adani Power Q1 results, Gaurav Goel, Founder & Director at Fynocrat Technologies, said, \"Adani Power has reported a strong profit of ₹3,305 crore, which is slightly lower than last year's ₹3,912 crore but still solid, especially considering weaker power demand due to early monsoons and lower merchant tariffs. Revenue also dipped a bit to ₹14,167 crore. But despite that, their operating margins stayed healthy, and EBITDA came in at ₹5,744 crore, which is a good recovery from last quarter.\"\n\n\"What stands out is their focus on scale and efficiency. Even in a low-demand quarter, they remained stable, mainly because of their strong base of long-term PPAs and good cost control. Of course, recent acquisitions have added to depreciation, which is putting some pressure on profits,\" Goel said, adding, \"Tata Power reported higher revenue at ₹17,464 crore, but a much lower profit of ₹1,262 crore. It looks like underperformance compared to Adani POWER, but there's more to the story.\"\n\n\"Tata Power is clearly in a transition phase, shifting focus to clean and green energy. Around 44% of their current capacity is now renewable, and they're aiming for 70% by 2030. That kind of shift requires a lot of investment, and that's showing up in the short-term earnings. But they're building long-term value. They're also growing in areas like EV charging and rooftop solar, which could become strong drivers in the future,\" Gaurav Goel of Fynocrat Technologies said.\n\nWhich stock should you buy? On which stock to buy after the announcement of Q1 results 2025, Seema Srivastava of SMC Global said, \"For a long-term perspective, Adani Power appears more attractive due to its higher growth potential and lower P/E ratio of around 10-15, compared to Tata Power's P/E ratio of around 32-40. Adani Power's aggressive expansion plans and strategic partnerships, like regular payments from Bangladesh, underscore its core strengths and competitive edge. However, Tata Power's diversified portfolio and strong brand reputation make it a stable choice.\""
    },
    {
        "title": "Global market news: US stock market tanks on Trump's tariff worries. Dow Jones crashes 1.23%, Nasdaq nosedives 2.24%",
        "url": "https://www.livemint.com/market/stock-market-news/global-market-news-us-stock-market-tanks-on-trumps-tariff-worries-dow-jones-crashes-1-23-nasdaq-nosedives-224-11754097929979.html",
        "text": "Global market news: Following Trump's tariff worries, the US stock market and the US Treasury yields fell sharply on Friday. The frontline indices on Wall Street had a Black Friday as the tech-heavy Nasdaq index crashed 2.24%, the S&P 500 index nosedived 1.60%, and the Dow Jones index lost 1.23%. Selling intensified across segments as small-cap stocks also came under heavy selling pressure. The Small Cap 2000 index crashed 2.08% during the bloodbath on Wall Street. The pan-European STOXX 600 index ended down 1.89%, its most significant drop since April 9, 2025.\n\nThe dollar index, which measures the greenback against major currencies, including the yen and the euro, fell 1.37% to 98.66. The euro was up 1.52% at $1.1589. Against the Japanese yen, the dollar weakened 2.26% to 147.32.\n\nThe US President Donald Trump signed an order on Thursday night imposing steep tariffs on 66 countries, the European Union, Taiwan, and the Falkland Islands, to go into effect Aug. 7, after he initially threatened them for April but postponed twice after that until August 1, 2025. The US stock market was also reacting to government reports of a dramatic slowdown in hiring as businesses, investors, and the US Fed operate under a cloud of uncertainty from months of Trump tariff policy news.\n\nWhat is dragging the US stock market? Highlighting the reason for the bloodbath in the US stock market, Luke Tilley, Chief Economist at Wilmington Trust, said, \"The market is reacting to the possibility of the economy flipping into recession. The weak jobs data is piling on to weak earnings reports and guidance from some corporations.\"\n\n\"The way (the market) is going to interpret (the departures) is in a very dollar-negative way,\" Juan Perez, senior director of trading, Monex USA, referring to both the Kugler and McEntarfer news.\n\n\"No matter what the economic picture in the United States, the one thing that holds the US dollar strong in the eyes of the world is the authority and the independence of the Federal Reserve. Whenever anything comes to put that into compromise, potentially, then that's when the US dollar spirals down.\"\n\nMSCI's global equities index sold off sharply on Friday, and the dollar took a dive after weaker-than-expected US jobs data fueled economic worries and boosted bets for September US Fed rate cuts. Investors also considered US President Donald Trump's latest tariff announcements and key personnel changes.\n\nUS Treasuries were in demand after the Labour Department reported that the US economy added 73,000 nonfarm payrolls last month, below economists' expectations for 110,000. June's job growth was revised sharply lower to 14,000 from 147,000.\n\nAfter the report, Trump said he ordered his team to fire the US Bureau of Labour Statistics commissioner, Erika L. McEntarfer, who former President Joe Biden had nominated for the role.\n\nThe dollar index and US Treasury yields lost ground when the Federal Reserve announced that Governor Adriana Kugler would resign early from her term on 8 August. This caused some investors anxiety at a time when Trump had loudly disagreed with Fed rate policies.\n\nTrump's tariff news On Thursday, Donald Trump ordered tariffs ranging from 10% to 41% on US imports from several major trading partners. He increased duties on Canadian goods to 35% from 25% for all products not covered by the US-Mexico-Canada trade agreement. He set a 25% rate for India's U.S.-bound exports, 20% for Taiwan's, 19% for Thailand's and 15% for South Korea's.\n\nMexico, however, got a 90-day reprieve from higher tariffs to allow for deal talks.\n\nLate on Friday, traders were betting on an 87.5% probability for a September rate cut compared with 37.7% on Thursday, according to CME Group's FedWatch tool.\n\n(With inputs from Reuters)"
    },
    {
        "title": "Sri Lotus Developers IPO: Focus shifts to allotment date after strong subscription status; GMP, how to check status",
        "url": "https://www.livemint.com/market/ipo/sri-lotus-developers-ipo-focus-shifts-on-allotment-date-after-strong-subscription-status-gmp-how-to-check-status-11754040175291.html",
        "text": "Sri Lotus Developers IPO Allotment: The initial public offering (IPO) of real estate company Sri Lotus Developers garnered strong demand. As the bidding period has ended, investors now focus on Sri Lotus Developers IPO allotment date, which is likely today. However, in case of any delay, share allotment can be expected on Monday.\n\nThe public issue was open from July 30 to August 1. Sri Lotus Developers IPO allotment date is expected to be 2 August 2025, Saturday or on 4 August 2025, Monday, and the Sri Lotus Developers IPO listing date is likely on August 6, 2025.\n\nThe company will finalise the Sri Lotus Developers IPO allotment status soon. Once the basis of share allotment is finalised, the company will then credit the equity shares into the demat accounts of the eligible allotment holders on August 5 and initiate refunds on the same day.\n\nAlso Read | Highway Infrastructure IPO: 10 key things to know from RHP\n\nApplicants can check Sri Lotus Developers IPO allotment status online through the websites of BSE and NSE along with the official portal of the IPO registrar. Kfin Technologies is the Sri Lotus Developers IPO registrar.\n\nTo do Sri Lotus Developers IPO allotment status check online, the following steps must be followed. Here are the steps to check Sri Lotus Developers IPO allotment status online:\n\nSri Lotus Developers IPO Allotment Status on BSE Step 1] Visit BSE website on this link - https://www.bseindia.com/investors/appli_check.aspx\n\nStep 2] Select ‘Equity’ in the Issue Type\n\nStep 3] Choose ‘Sri Lotus Developers Limited’ in the Issue Name dropdown menu\n\nStep 4] Enter either Application No. or PAN\n\nStep 5] Verify by ticking on ‘I am not robot’ and click on ‘Search’\n\nYour Sri Lotus Developers IPO allotment status will be displayed on the screen.\n\nSri Lotus Developers IPO Allotment Status Check NSE Step 1] Visit NSE allotment status page on its website here - https://www.nseindia.com/invest/check-trades-bids-verify-ipo-bids\n\nStep 2] Select ‘Equity and SME IPO bids’\n\nStep 3] Choose ‘Sri Lotus Developers Limited’ from the Issue Name dropdown menu\n\nStep 4] Enter your PAN and Application Number\n\nStep 5] Click on Submit.\n\nYour Sri Lotus Developers IPO allotment status will be displayed on the screen.\n\nSri Lotus Developers IPO Allotment Status Check Kfin Technologies Step 1] Visit IPO registrar’s website on this link - https://kosmic.kfintech.com/ipostatus/\n\nStep 2] Choose ‘Sri Lotus Developers Limited’ in the Select IPO dropdown menu\n\nStep 3] Select either Application No, Demat Account, or PAN\n\nStep 4] Enter the details as per the option selected\n\nStep 5] Enter the Captcha code and click on Submit\n\nYour Sri Lotus Developers IPO allotment status will be displayed on the screen.\n\nSri Lotus Developers IPO GMP The trends for Sri Lotus Developers shares in the unlisted market remains bullish with a higher grey market premium (GMP). Sri Lotus Developers IPO GMP today is ₹44 per share, market experts said. This means that in the grey market, Sri Lotus Developers shares are trading higher by ₹44 than their issue price.\n\nConsidering the Sri Lotus Developers IPO GMP today, the estimated listing price of Sri Lotus Developers shares would be ₹194 apiece, which is at a premium of 29.33% to the IPO price of ₹150 per share.\n\n.Sri Lotus Developers IPO Details Sri Lotus Developers launched its IPO on July 30, which closed on August 1. Sri Lotus Developers IPO allotment date is likely August 4, and the tentative IPO listing date is August 6. The equity shares of the company will be listed on both the stock exchanges, BSE and NSE.\n\nThe company raised ₹792.00 crore from the IPO at a fixed price band of ₹150 per share. Sri Lotus Developers IPO was entirely a fresh issue of 5.28 crore equity shares.\n\nSri Lotus Developers IPO was subscribed 69.14 times in total as the issue received bids for 274.18 crore equity shares as against 3.96 crore shares on the offer, NSE subscription status data showed.\n\nThe IPO was subscribed 20.28 times in the Retail investors category, and 57.71 times in the Non-Institutional Investors segment. The Qualified Institutional Buyers (QIB) category received 163.90 times subscription.\n\nMotilal Oswal Investment Advisors is the book-running lead manager, while Kfin Technologies is the Sri Lotus Developers IPO registrar."
    },
    {
        "title": "NSDL IPO allotment date in focus after strong subscription status; GMP, how to check application status online",
        "url": "https://www.livemint.com/market/ipo/nsdl-ipo-allotment-date-in-focus-after-strong-subscription-status-gmp-how-to-check-application-status-online-11754040787537.html",
        "text": "NSDL IPO Allotment: The initial public offering (IPO) of National Securities Depository Limited (NSDL) received strong demand from investors across categories during its subscription period which ended on Friday. The focus now shifts towards NSDL IPO allotment date which is likely today.\n\nThe public offer was open from July 30 to August 1. NSDL IPO allotment date is expected today. However, in case of delay, the NSDL IPO allotment is expected to be 4 August 2025, and the IPO listing date is likely August 6. NSDL shares will be listed on BSE.\n\nThe company will soon finalise the basis of NSDL IPO allotment status. Once the NSDL share allotment status is fixed, the company will credit the equity shares into the demat accounts of the eligible allotment holders on August 5, and initiate refunds to unsuccessful investors on the same day.\n\nInvestors can check NSDL IPO allotment status online through the websites of BSE and the IPO registrar. MUFG Intime India (Link Intime) is the NSDL IPO registrar.\n\nIn order to do NSDL IPO allotment status online check, investors must follow a few simple steps mentioned below. Here’s how to check NSDL IPO allotment status online.\n\nNSDL IPO Allotment Status Check BSE Step 1] Visit BSE website on this link - https://www.bseindia.com/investors/appli_check.aspx\n\nStep 2] Select ‘Equity’ in the Issue Type\n\nStep 3] Choose ‘National Securities Depository Limited’ in the Issue Name dropdown menu\n\nStep 4] Enter either Application No. or PAN\n\nStep 5] Verify by ticking on ‘I am not robot’ and click on ‘Search’\n\nYour NSDL IPO allotment status will be displayed on the screen.\n\nNSDL IPO Allotment Status Check MUFG Intime Step 1] Visit IPO registrar website on this link - https://in.mpms.mufg.com/Initial_Offer/public-issues.html\n\nStep 2] Choose ‘National Securities Depository Limited’ in the Select Company dropdown menu\n\nStep 3] Select among PAN, App. No., DP ID or Account No.\n\nStep 4] Enter the details as per the option selected\n\nStep 5] Click on Search\n\nYour NSDL IPO allotment status will be displayed on the screen.\n\nNSDL IPO GMP Today NSDL shares are available at a strong premium in the grey market. According to market experts, NSDL IPO GMP today is ₹136 per share. This means that in the grey market, NSDL shares are trading higher by ₹136 than their issue price.\n\nNSDL IPO GMP today signals that the estimated listing price of NSDL shares would be ₹936 apiece, which is at 17% premium to the IPO price of ₹800 per share.\n\nNSDL IPO Subscription Status, Key Details The bidding for the public issue commenced on July 30 and concluded on August 1. NSDL IPO allotment date is likely 4 August 2025, Monday, and the tentative IPO listing date is August 6. NSDL shares will be listed on BSE.\n\nNSDL IPO price band was ₹800 per share. The company raised ₹4,011.60 crore from the book-building issue which was entirely an offer-for-sale (OFS) of 5.01 crore equity shares.\n\nNSDL IPO has been subscribed 41.01 times in total as the issue received bids for 144.03 crore equity shares as against 3.51 crore shares on the offer, according to the subscription data on NSE.\n\nThe Retail investors category was subscribed 7.73 times, while the Non Institutional Investors (NII) portion was booked 34.98 times. The Qualified Institutional Buyers (QIBs) category received 103.97 times the subscription.\n\nICICI Securities is the book-running lead manager, while MUFG Intime India (Link Intime) is the NSDL IPO registrar."
    },
    {
        "title": "TSX posts biggest decline since April as US jobs data spooks investors",
        "url": "https://www.livemint.com/market/stock-market-news/tsx-posts-biggest-decline-since-april-as-us-jobs-data-spooks-investors-11754081290395.html",
        "text": "*\n\nTSX ends down 0.9% at 27,020.43\n\n*\n\nFor the week, the index declines 1.7%\n\n*\n\nTechnology sector falls 2.4%\n\n*\n\nEnergy loses 1.9% as oil settles 2.8% lower\n\nBy Fergal Smith\n\nTORONTO, - Canada's main stock index fell for a third straight day on Friday as investors weighed disappointing U.S. jobs data and an escalation in the U.S. trade war with Canada.\n\nThe S&P/TSX composite index ended down 239.35 points, or 0.9%, at 27,020.43, extending its pullback from a record closing high on Tuesday.\n\nIt was the index's sharpest decline since April 10. For the week, the TSX was down 1.7%.\n\n\"August tends to be one of the worst months for the year and it's setting off to do that once again, as we're seeing some volatility and a quick drop-off with weaker payroll numbers in the U.S. and just some concerns around earnings so far,\" said Greg Taylor, chief investment officer at PenderFund Capital Management.\n\n\"A lot of the better companies usually report first in the cycle, and we got that, now we're starting to see some weakness.\"\n\nWall Street posted steep declines as Amazon.com failed to meet lofty expectations for its Amazon Web Services cloud computing unit and after U.S. jobs data disappointed.\n\nU.S. employment growth was weaker than expected in July while the nonfarm payrolls count for the prior two months was revised down by a massive 258,000 jobs, suggesting a sharp deterioration in labor market conditions.\n\nDomestic data was also downbeat. Canada's manufacturing sector contracted for a sixth straight month in July as tariffs undercut trade with the United States and spurred firms to reduce inventory as well as staffing levels.\n\nU.S. President Donald Trump on Thursday signed an executive order increasing tariffs on Canadian goods to 35% from 25% on all products not covered by the U.S.-Mexico-Canada trade agreement.\n\nAll ten major sectors on the TSX ended lower, led by a 2.4% decline for technology.\n\nEnergy lost 1.9% as worries about a possible increase in OPEC oil production weighed on the price of oil. U.S. crude futures settled 2.8% lower at $67.33 a barrel.\n\nHeavily weighted financials lost 0.9%.\n\nMDA Space Ltd was a bright spot. Its shares jumped 18.4% after the aerospace company was selected as the prime contractor on a project for Echostar."
    },
    {
        "title": "Soy futures post weekly loss on expectations for big US crop",
        "url": "https://www.livemint.com/market/commodities/soy-futures-post-weekly-loss-on-expectations-for-big-us-crop-11754080367363.html",
        "text": "By Tom Polansek\n\nCHICAGO, - Chicago Board of Trade soybean futures finished flat on Friday but notched a second consecutive weekly decline as ample global supplies, favorable U.S. weather and weak Chinese demand hung over the market.\n\nU.S. farmers were expected to harvest bumper soybean and corn crops this autumn following non-threatening weather conditions. At the same time, they worried that President Donald Trump's latest wave of tariffs may hurt American farm exports at a time when soy and wheat sales have struggled.\n\nThe United States faces stiff competition for global soy sales from Brazil, the world's biggest exporter of the oilseed.\n\n\"Expectations of a robust U.S. harvest, alongside a second consecutive record Brazilian crop, are expected to weigh on prices for the remainder of the year,\" analysts at BMI, a unit of Fitch Solutions, said in a note.\n\nCBOT November soybeans ended unchanged at $9.89-1/4 a bushel after falling earlier to the lowest level since April 9. The contract lost about 3.1% for the week.\n\nChina, the world's biggest soy buyer, faces an August 12 deadline to reach a durable tariff agreement with Trump's administration. The United States believes it has the makings of a trade deal, but it is \"not 100% done,\" Treasury Secretary Scott Bessent said on Thursday.\n\nA Chinese buyer signed a deal this week to import 30,000 metric tons of Argentine soymeal, as feed producers move to lock in cheaper supplies from South America, two trade sources said.\n\nIn CBOT wheat, September futures ended down 6-1/2 cents at $5.16-3/4 per bushel. The contract set a low of $5.16-1/4 a bushel earlier in the session and tumbled 4% for the week as\n\nharvests\n\nin the Northern Hemisphere brought in new supplies.\n\nCBOT corn also slumped, with the December contract closing 3 cents lower at $4.10-3/4 a bushel. It lost about 2% for the week.\n\nExport sales of corn have been brisk as buyers take advantage of low prices. The U.S. Department of Agriculture reported exporters sold a total of 352,160 metric tons of U.S. corn to unknown destinations via its daily reporting system."
    },
    {
        "title": "Now thats a reality check",
        "url": "https://www.livemint.com/market/stock-market-news/now-thats-a-reality-check-11754080306725.html",
        "text": "By Jamie McGeever\n\nORLANDO, Florida, Aug 1 (Reuters) -\n\n- TRADING DAY\n\nMaking sense of the forces driving global markets\n\nBy Jamie McGeever, Markets Columnist\n\nI'd love to hear from you, so please reach out to me with comments at . You can also follow me at @ReutersJamie and @reutersjamie.bsky.social.\n\nWell, well, well. In a week jam-packed with global tariff, earnings, data and policy fireworks, the most explosive was kept for last: July's U.S. employment report, which shattered the optimism - or complacency - building around the U.S. economy and stock market.\n\nWeak job growth, together with the latest wave of steep tariffs imposed by U.S. President Donald Trump, triggered a huge selloff in global stocks and the dollar on Friday, floored bond yields, and revived expectations of a Fed rate cut next month.\n\nToday's Key Market Moves\n\n* Dollar index snaps six-day winning streak and slumps more than 1%, its biggest fall since April. Dollar/yen plunges 2.2%, biggest fall since January 2023.\n\n* S&P 500 slides 1.6%, biggest decline since May, as profit-taking sets in after new highs this week. Nasdaq slumps 2.2% - is tech topping out?\n\n* U.S. 2-year bond yield tumbles 26 bps, the biggest fall in a year and akin to an instant quarter-point rate cut.\n\n* Crude oil futures fall nearly 3%.\n\n* Comex copper steadies on Friday but plunges 24% this week, its worst ever week since futures contracts launched in 1988.\n\nNow that's a reality check\n\nGlobal markets were floored on Friday by a powerful one-two punch from the latest U.S. employment data and U.S. tariffs slapped on dozens of countries. It was a sobering reminder that the economic foundations supporting Wall Street's record highs this week may not be that strong.\n\nThe weak jobs growth seemed to fly in the face of Fed Chair Jerome Powell's assessment on Wednesday that the labor market is strong, and vindicate the two dissenters, Governors Christopher Waller and Michelle Bowman. Although to be fair to Powell, he did stress that downside risks were growing.\n\nYet average earnings and hours worked rose in July, and the unemployment rate only inched up to 4.2%. That's effectively still full employment. If the bar to cutting rates is tied to the unemployment rate, it is still a high one.\n\nRates futures traders don't see it that way though. They now see a rate cut next month as a near-certainty, and are pricing in 60 basis points of easing by year-end.\n\nInvestors were also sideswiped on Friday by U.S. President Donald Trump's latest wave of tariffs on 69 trading partners, ranging from 10% to 41%, that will start in a week's time. This will raise the U.S. effective tariff rate closer to 20%, nearly 10 times higher than the end of last year.\n\nOf course, bilateral trade deals could be struck and these levies may be lowered, but it is a reminder that the growth and inflation outlook is challenging at best. With equity prices and optimism around Big Tech at such lofty levels, the correction when it came was always likely to be big.\n\nIf that wasn't enough for investors to digest, Trump announced late on Friday he is firing the commissioner of the Labor Department's Bureau of Labor Statistics following the latest jobs data, and Fed Governor Adriana Kugler said she is resigning effective August 8 and returning to academia.\n\nThis paves the way for Trump to appoint someone more aligned with his low interest rate view as her replacement.\n\nSo the new trading month kicks off with world markets on a shaky footing, and the economy too. Asia's factory activity is deteriorating as tariff uncertainty weighs, and U.S. manufacturing is still in a funk. European factory activity is moving closer to stabilization, but is still contracting.\n\nServices, tech and AI-related activity and indicators are shining brighter of course, but even there caution will be creeping into investors' minds. Earnings reports from Apple, Microsoft and Meta were well-received by the market, to put it mildly, but the Nasdaq still shed nearly 2% on the week.\n\nAugust is the main summer holiday month in Europe and North America, so liquidity will thin out. With the VIX index back above 20.0 for the first time since April, trading next week could be choppy.\n\nChart of the Week\n\nIf you want evidence that Trump's tariffs on the rest of the world are starting to push up U.S. goods inflation, look no further. According to Ernie Tedeschi at the Budget Lab at Yale, PCE durable goods prices in the first six months of the year rose 1.7%. Excluding the pandemic, that's the biggest six-month rise since 1987.\n\nHere are some of the best things I read this week:\n\n1. Brics currencies are no realistic alternative to the dollar - Herbert Poenisch\n\n2. Europe's Economic Surrender - Alberto Alemanno\n\n3. U.S.-EU Trade Deal Avoids a Tariff War, but Deepens European Dependence - Matthias Matthijs\n\n4. China is also Fighting a Trade War with Europe (and Winning) - Brad Setser\n\n5. Trump's executive orders politicize AI - Tom Wheeler\n\nWhat could move markets on Monday?\n\n* U.S. durable goods (June)\n\n* Global earnings\n\nOpinions expressed are those of the author. They do not reflect the views of Reuters News, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.\n\nTrading Day is also sent by email every weekday morning. Think your friend or colleague should know about us? Forward this newsletter to them. They can also sign up here."
    },
    {
        "title": "Stocks slump on latest tariffs, soft jobs data",
        "url": "https://www.livemint.com/market/stock-market-news/stocks-slump-on-latest-tariffs-soft-jobs-data-11754078544138.html",
        "text": "NEW YORK, Aug 1 (Reuters) - U.S. stocks slumped on Friday, with the S&P on track for its biggest daily percentage decline in more than three months as new U.S. tariffs on dozens of trading partners and a surprisingly weak jobs report spurred selling pressure. Also weighing on equities was a tumble in Amazon.com shares after the company posted quarterly results but failed to meet lofty expectations for its Amazon Web Services cloud computing unit. Just hours before the tariff deadline on Friday, President Donald Trump signed an executive order imposing duties on U.S. imports from countries, including Canada, Brazil, India and Taiwan, in his latest round of levies as countries attempted to seek ways to reach better deals. Further denting confidence in the economic picture, data showed U.S. job growth slowed more than expected in July while the prior month's report was revised sharply lower, indicating the labor market may be starting to crack.\n\nAccording to preliminary data, the S&P 500 lost 101.60 points, or 1.60%, to end at 6,237.79 points, while the Nasdaq Composite lost 472.78 points, or 2.24%, to 20,649.67. The Dow Jones Industrial Average fell 543.97 points, or 1.23%, to 43,587.01. Market expectations the Fed will cut rates by at least 25 basis points at its September meeting stood at 80.9%, according to CME's FedWatch Tool, up from 37.7% in the prior session. Other data from the Institute for Supply Management showed U.S. manufacturing contracted for a fifth straight month in July and factory employment dropped to the lowest level in five years. Both the S&P 500 and the Nasdaq recorded their biggest single-day percentage declines since April 21 and all three major indexes were on track for weekly losses. The CBOE Volatility Index, also known as Wall Street's fear gauge, climbed to as much as 21.90, its highest since June 23. Amazon was the biggest drag on the Dow, S&P 500 and Nasdaq and pushed the consumer discretionary index, down nearly 4% as the worst performing of the 11 major S&P 500 sectors. Also reporting earnings was Apple, which fell after it posted a current-quarter revenue forecast well above Wall Street estimates, but CEO Tim Cook warned U.S. tariffs would add $1.1 billion in costs over the period. Stocks briefly extended declines after Trump said he ordered the commissioner of the U.S. Bureau of Labor Statistics, Erika L. McEntarfer, to be fired in the wake of the jobs data. In contrast to the broad declines, Reddit surged after it reported quarterly results that exceeded Street expectations, boosted by an AI-focused advertising strategy and strong user engagement."
    },
    {
        "title": "US yields dive as job growth slows, Fed rate cut in September seen likely",
        "url": "https://www.livemint.com/market/stock-market-news/us-yields-dive-as-job-growth-slows-fed-rate-cut-in-september-seen-likely-11754076651452.html",
        "text": "(Add Fed comments, graphics, tariff news)\n\n*\n\nUS two-year yields drop to lowest in five weeks\n\n*\n\nFed seen as likely to cut rates in September, futures show 81% chance\n\n*\n\nManufacturing PMI contracts for fifth month, factory employment hits five-year low\n\n*\n\nFed officials downplay slowdown in jobs growth\n\nBy Gertrude Chavez-Dreyfuss\n\nNEW YORK, Aug 1 (Reuters) - U.S. Treasury yields plummeted after data showed on Friday the world's largest economy created fewer jobs than expected in July, increasing the odds the Federal Reserve will resume cutting interest rates at its September meeting.\n\nU.S. two-year yields, which are tied to the Fed's monetary policy, dropped 24.1 basis points (bps) to 3.710%, on track for their largest daily fall in two years. The yield also dropped to its lowest since June 30.\n\nThe benchmark 10-year yield also fell to a five-week trough and was last down 13.4 bps at 4.223%. It was on pace for its biggest one-day decline since early April. Data showed U.S. job growth slowed more than expected last month, while June's data was revised sharply lower, pointing to a sharp moderation in the labor market.\n\nNonfarm payrolls increased by 73,000 jobs last month after rising by a downwardly revised 14,000 in June, data showed. Economists polled by Reuters had forecast payrolls increasing by 110,000 jobs after rising by a previously reported 147,000 in June. May's data was also revised downward.\n\nThe unemployment rate rose to 4.2% from 4.1% in June.\n\n\"The Fed is caught between above-target inflation and the uncertain impact of tariffs on the inflation picture moving forward with a clearly slowing labor market,\" said Chip Hughey, managing director of fixed income at Truist Advisory Services in Richmond, Virginia.\n\n\"Today complicates things further in that the labor market, which was already cooling, and I think the Fed had even already acknowledged that the labor market was cooling. Obviously, (labor market concerns) accelerated with today's report, but the Fed remains caught between the two sides of its dual mandate. So you're seeing a sharp bull steepening in the yield curve, and you're seeing expectations for a September rate cut.\" The yield curve bull steepened after the jobs report, with the gap between two-year and 10-year yields widening to as much as 52.6 bps, the highest gap since July 23 US2US10=TWEB , compared with 41.5 on Thursday. The curve was last at 51.2 bps.\n\nA bull steepener refers to a scenario in which shorter-dated yields are falling much faster than those on long maturities, which reflects expectations that the Fed will cut soon.\n\nRISING ODDS OF SEPTEMBER CUT\n\nU.S. rate futures have now priced in an 81% chance that the Fed will cut rates in September, according to the CME's FedWatch. That chance was just 38% late Thursday. Rate futures have also factored in 58 bps of easing this year, compared with just 39 bps of rate declines on Thursday. Fed Governor Christopher Waller and Fed Vice Chair for Supervision Michelle Bowman were two dissenting governors to Wednesday's decision by the Federal Reserve Open Committee to keep rates unchanged in the 4.25%-4.50% target range. They said on Friday they did so largely due to rising concerns about the job market, in statements made public just ahead of the release of hiring data that bolstered their position.\n\nOther Fed officials on Friday, however, downplayed the jobs report, saying it would not have influenced the decision to keep rates unchanged on Wednesday. Cleveland Fed President Beth Hammack told Bloomberg TV that a \"disappointing\" jobs report released Friday doesn't mean the Fed should have cut rates at its policy meeting this week.\n\nAtlanta Fed President Raphael Bostic in a CNBC interview echoed Hammack's sentiment, saying he does not believe the hiring data suggest it was wrong for the Fed not to cut rates this week.\n\nOther economic data on Friday also showed weakness, with yields further declining. Data showed U.S. manufacturing contracted for a fifth straight month in July while factory employment dropped to the lowest level in five years amid tariffs that have raised prices of imported raw materials. The Institute for Supply Management said on Friday its manufacturing PMI dropped to 48.0 last month from 49.0 in June. A PMI reading below 50 indicates contraction in manufacturing, which accounts for 10.2% of the economy.\n\nEconomists polled by Reuters had forecast the PMI edging up to 49. Earlier in the session, President Donald Trump unleashed the latest wave of steep tariffs that pushed global stock markets lower, including Wall Street. Brazil was hit by 50% tariffs, Switzerland got 39%, Canada had 35%, India had 25%, while Taiwan got 20%. Treasuries showed little reaction to the tariff news, as investors positioned for the nonfarm payrolls data that came after all the trade headlines"
    },
    {
        "title": "Dollar tumbles, traders bet on more US rate cuts after weak jobs report",
        "url": "https://www.livemint.com/market/stock-market-news/dollar-tumbles-traders-bet-on-more-us-rate-cuts-after-weak-jobs-report-11754075253685.html",
        "text": "*\n\nDollar falls broadly against peers after weak US jobs report\n\n*\n\nSwiss franc, Canadian dollar earlier hit by country tariffs\n\n*\n\nBank of Japan signals no hurry to resume rate hikes\n\nBy Karen Brettell\n\nNEW YORK, - The dollar dropped on Friday and was on track for its biggest daily loss against the euro and yen since April after data showed that U.S. employers added fewer jobs in July than economists had expected, while last month’s jobs gains were revised sharply lower, leading traders to ramp up bets on how many times the Federal Reserve is likely to cut rates this year.\n\nEmployers added 73,000 jobs last month, below the 110,000 expected by economists polled by Reuters, while the unemployment rate edged higher to 4.2%, as anticipated, up from 4.1% in June. Job gains for June were revised down to 14,000, from the previously reported 147,000.\n\n“It's worse than anyone expected and the kicker is that downward revision for the prior month too,” said Helen Given, director of trading at Money USA in Washington.\n\nThe dollar index, which measures the greenback against a basket of currencies including the yen and the euro, was last down 1.06% on the day at 98.97.\n\nThe euro rose 1.16% to $1.1547. The single currency reached $1.1389 earlier on Friday, the lowest since June 10.\n\nAgainst the Japanese yen, the dollar weakened 2.01% to 147.7. The greenback earlier reached 150.91, the highest since March 28.\n\nThe Fed has indicated it is in no rush to cut rates due to concern that President Donald Trump’s tariff policies will reignite inflation over the coming months.\n\nFed funds futures traders pared bets on how many times the U.S. central bank is likely to cut rates this year after Fed Chair Jerome Powell on Wednesday offered a hawkish outlook for monetary policy and declined to indicate that a cut in September was likely.\n\nBut they ramped up bets on cuts again on Friday after the jobs data. Traders are now pricing in 58 basis points of cuts by year-end, up from around 34 basis points on Thursday, with the first cut seen in September.\n\nWhether the Fed cuts in September will now likely depend on the next jobs report for August.\n\n“ did say on Wednesday that we were looking at holding rates steadier for longer, but that we were going to get two sets of employment data before the next Fed meeting. So as this first set has been so decidedly negative… the labor market is clearly, clearly cooling, that's going to raise the importance of that September figure as well,” said Given.\n\nThe August jobs data will be released on September 5, with the Fed due to meet on September 16-17.\n\nA more dovish Fed would likely be negative for the U.S. currency, even after it has appeared to find its footing in recent weeks following a rough first half of the year.\n\n\"Our forecast for the dollar to strengthen in the second half of the year relies in large part on our view that the US economy will remain resilient and the FOMC keep policy on hold until 2026,\" Jonas Goltermann, deputy chief markets economist at Capital Economics said in a note.\n\n\"Plainly, that now looks less probable; in a recession scenario the dollar is likely to weaken against lower yielding currencies such as the yen and the euro, even if it may rally against other, riskier currencies,\" he said.\n\nThe dollar had gained earlier on Friday after Trump imposed new tariff rates on dozens of trade partners.\n\nThe Swiss franc was among the hardest hit as Switzerland now faces a 39% rate.\n\nThe Swissie fell against a range of currencies in response to Trump's hefty duties and to his demand that pharma companies - key Swiss exporters - lower the prices at which they sell to U.S. consumers.\n\nThe dollar was last down 0.76% against the Swiss franc at 0.806, after earlier reaching 0.8171, the highest since June 23.\n\nThe Canadian dollar strengthened 0.44% versus the greenback to C$1.38 per dollar, after earlier easing to C$1.3879, the weakest since May 22. Canada was hit with a 35% tariff, instead of the threatened 25%.\n\nThe dollar had also gained against other currencies due to drivers other than tariffs. The yen was earlier headed for its largest weekly loss this year after the Bank of Japan signaled it was in no hurry to resume interest rate hikes, prompting Finance Minister Katsunobu Kato to say on Friday that officials were \"alarmed\" by currency moves.\n\nIn cryptocurrencies, bitcoin fell 2.01% to $114,180.54."
    },
    {
        "title": "Stocks tumble on latest tariffs, soft jobs data",
        "url": "https://www.livemint.com/market/stock-market-news/stocks-tumble-on-latest-tariffs-soft-jobs-data-11754074700978.html",
        "text": "*\n\nAmazon slides after cloud computing growth underwhelms investors\n\n*\n\nU.S. job growth slowed more than expected in July\n\n*\n\nIndexes down: Dow 1.37%, S&P 500 1.78%, Nasdaq 2.43%\n\n(Updates to afternoon trading)\n\nBy Chuck Mikolajczak\n\nNEW YORK, Aug 1 (Reuters) - U.S. stocks slumped on Friday, with the S&P on track for its biggest daily percentage decline in more than three months as new U.S. tariffs on dozens of trading partners and a surprisingly weak jobs report spurred selling pressure. Also weighing on equities was a tumble of nearly 9% in Amazon.com shares after the company posted quarterly results but failed to meet lofty expectations for its Amazon Web Services cloud computing unit. Just hours before the tariff deadline on Friday, President Donald Trump signed an executive order imposing duties on U.S. imports from countries, including Canada, Brazil, India and Taiwan, in his latest round of levies as countries attempted to seek ways to reach better deals. Further denting confidence in the economic picture, data showed U.S. job growth slowed more than expected in July while the prior month's report was revised sharply lower, indicating the labor market may be starting to crack.\n\nThe report significantly pushed up expectations the Federal Reserve will cut interest rates at its September meeting. \"There’s no way to pretty-up this report. Previous months were revised significantly lower where the labor market has been on stall-speed,\" said Brian Jacobsen, Chief Economist at Annex Wealth Management in Menomonee Falls, Wisconsin. \"Last year the Fed messed up by not cutting in July so they did a catch-up cut at their next meeting. They’ll likely have to do the same thing this year.\" Market expectations the Fed will cut rates by at least 25 basis points at its September meeting stood at 80.9%, according to CME's FedWatch Tool, up from 37.7% in the prior session.\n\nThe Dow Jones Industrial Average fell 604.56 points, or 1.37%, to 43,526.42. The S&P 500 lost 112.80 points, or 1.78%, to 6,226.59 and the Nasdaq Composite lost 512.52 points, or 2.43%, to 20,609.93. Both the S&P 500 and the Nasdaq were on track for their worst single-day performance since April 21 and each of the three major indexes were on track for weekly losses. The CBOE Volatility index, also known as Wall Street's fear gauge, jumped to its highest level since June 23 and was last at 20.95. Amazon was the biggest drag on the Dow, S&P 500 and Nasdaq and pushed the consumer discretionary sector, down nearly 4%. The defensive consumer staples index was the best performing S&P sector on the day. Also reporting earnings was Apple, which fell 2% after it posted a current-quarter revenue forecast well above Wall Street estimates, but CEO Tim Cook warned U.S. tariffs would add $1.1 billion in costs over the period. Stocks briefly extended declines after Trump said he ordered the commissioner of the U.S. Bureau of Labor Statistics, Erika L. McEntarfer, to be fired in the wake of the jobs data. In contrast to the broad declines, Reddit surged 19.4% after it reported quarterly results that exceeded Street expectations, boosted by an AI-focused advertising strategy and strong user engagement. Declining issues outnumbered advancers by a 2.48-to-1 ratio on the NYSE, and by a 3.17-to-1 ratio on the Nasdaq. The S&P 500 posted eight new 52-week highs and 28 new lows, while the Nasdaq Composite recorded 21 new highs and 191 new lows."
    },
    {
        "title": "Soybean futures set for weekly loss on ample supply",
        "url": "https://www.livemint.com/market/commodities/soybean-futures-set-for-weekly-loss-on-ample-supply-11754074031756.html",
        "text": "(Adds latest U.S. market activity in paragraph 5)\n\nBy Tom Polansek\n\nCHICAGO, Aug 1 (Reuters) - Chicago Board of Trade soybean futures edged higher on Friday but stayed on track for a second consecutive weekly decline as ample global supplies, favourable U.S. weather and weak Chinese demand pressured prices.\n\nU.S. farmers are expected to harvest bumper soy and corn crops this autumn following beneficial weather conditions. At the same time, they worry about President Donald Trump's tariff disputes hurting export demand.\n\nTrump's latest wave of tariffs on goods from dozens of trading partners sent global stock markets tumbling.\n\n\"Traders are still cautious about trade headlines and eyeing favorable U.S. weather for first half of August,\" said Terry Reilly, senior agricultural strategist for Marex.\n\nThe most-active soybean contract was up 2-1/2 cents at $9.91-3/4 per bushel by 1 p.m. CDT (1800 GMT) after falling earlier to its lowest level since April 8.\n\n\"Expectations of a robust U.S. harvest, alongside a second consecutive record Brazilian crop, are expected to weigh on prices for the remainder of the year,\" analysts at BMI, a unit of Fitch Solutions, said in a note.\n\nChina, the world's biggest soy buyer, faces an August 12 deadline to reach a durable tariff agreement with Trump's administration. The United States believes it has the makings of a trade deal, but it is \"not 100% done,\" Treasury Secretary Scott Bessent said on Thursday.\n\nA Chinese buyer signed a deal this week to import 30,000 metric tons of Argentine soymeal, as feed producers move to lock in cheaper supplies from South America, two trade sources said.\n\nIn other markets, most-active CBOT wheat fell 4-1/2 cents to $5.18-3/4 per bushel, and corn futures slipped 1-3/4 cents to $4.12 a bushel amid expectations for the large U.S. harvest."
    },
    {
        "title": "Markets dive after Trump hits more countries with steep tariffs",
        "url": "https://www.livemint.com/market/stock-market-news/markets-dive-after-trump-hits-more-countries-with-steep-tariffs-11754073482032.html",
        "text": "By John Revill and Trevor Hunnicutt\n\nZURICH/WASHINGTON -U.S. President Donald Trump's latest wave of tariffs on exports from dozens of trading partners sent global stock markets tumbling on Friday and countries and companies scrambling to seek ways to strike better deals.\n\nAs Trump presses ahead with plans to reorder the global economy with the highest tariff rates since the early 1930s, Switzerland, \"stunned\" by 39% tariffs, sought more talks, as did India, hit with a 25% rate.\n\nNew tariffs also include a 35% duty on many goods from Canada, 50% for Brazil, 20% for Taiwan, which said its rate was \"temporary\" and it expected to reach a lower figure.\n\nThe presidential order listed higher import duty rates of 10% to 41% starting in a week's time for 69 trading partners, taking the U.S. effective tariff rate to about 18%, from 2.3% last year, according to analysts at Capital Economics.\n\nU.S. stocks took a hit. By afternoon on Friday, the Dow Jones Industrial Average had dropped 1.46% to 43,486.45, the S&P 500 1.8% to 6,225.55 and the Nasdaq Composite 2.42% to 20,610.91.\n\nMarkets were also reacting to a disappointing jobs report. Data showed U.S. job growth slowed more than expected in July while the prior month's data was revised sharply lower, pointing to a slowdown in the labor market.\n\nGlobal shares stumbled, with Europe's STOXX 600 tumbling 1.89% on the day.\n\nMeanwhile, Canadian negotiators said they could walk away from the table if they can't soon reach a deal with the United States.\n\nTrump's new tariffs have created yet more uncertainty, with many details unclear. They are set to take effect on Aug 7 at 0401 GMT, a White House official said.\n\nTrump administration officials defended the president's approach.\n\n\"The uncertainty with respect to tariffs ... was critical to getting the leverage that we needed to create the circumstance in which the president could create the trade deals we've seen over the last few weeks, which have been nothing short of monumental,\" Council of Economic Advisers Chair Stephen Miran said on CNBC.\n\nThe European Union, which struck a framework deal with Trump on Sunday, is still awaiting more Trump orders to deliver on agreed carve-outs, including on cars and aircraft, EU officials said, saying the latest executive orders did not cover that.\n\nAlso, it is unclear how the administration intends to define and police the transshipment restrictions, which threaten 40% levies on any exporter deemed to have tried to mask goods from a higher-tariffed originator, such as China, as their own product.\n\nTrump's tariff rollout also comes amid evidence they have begun driving up prices.\n\nU.S. Commerce Department data released Thursday showed prices for home furnishings and durable household equipment jumped 1.3% in June, the biggest gain since March 2022.\n\nNO WINNERS?\n\nSome countries hit with hefty tariffs said they will seek to negotiate with the U.S. in hopes of getting a lower rate.\n\nSwitzerland said it would push for a \"negotiated solution\" with the U.S.\n\n\"It’s a massive shock for the export industry and for the whole country. We are really stunned,\" said Jean-Philippe Kohl, deputy director of Swissmem, representing Switzerland's mechanical and electrical engineering industries.\n\nSouth Africa's Trade Minister Parks Tau said he was seeking \"real, practical interventions\" to defend jobs and the economy against the 30% U.S. tariff it faces.\n\nSoutheast Asian countries, however, breathed a sigh of relief after the U.S. tariffs on their exports that were lower than threatened and leveled the playing field with a rate of about 19% across the region's biggest economies.\n\nThailand's finance minister said a reduction from 36% to 19% would help his country's economy.\n\n\"It helps maintain Thailand's competitiveness on the global stage, boosts investor confidence and opens the door to economic growth, increased income and new opportunities,\" Pichai Chunhavajira said.\n\nAustralian products could become more competitive in the U.S. market, helping businesses boost exports, Trade Minister Don Farrell said, after Trump kept the minimum tariff rate of 10% for Australia.\n\nBut businesses and analysts said the impact of Trump's new trade regime would not be positive for economic growth.\n\n\"No real winners in trade conflicts,\" said Thomas Rupf, co-head Singapore and CIO Asia at VP Bank. \"Despite some countries securing better terms, the overall impact is negative.\"\n\n\"The tariffs hurt the Americans and they hurt us,\" winemaker Johannes Selbach said in Germany's Moselle Valley, adding jobs and profits on both sides of the Atlantic would be hit.\n\nL'Oreal and a growing number of European fashion and cosmetics companies are exploring use of an obscure, decades-old U.S. customs clause known as the \"First Sale\" rule as a potential way to soften the impact of the tariffs.\n\nThe \"First Sale\" rule allows companies to pay lower duties by applying tariffs to the value of a product as it leaves the factory - much lower than the eventual retail price.\n\nCANADA, INDIA\n\nTrump has tapped emergency powers, pressured foreign leaders, and pressed ahead with trade policies that sparked a market sell-off when they were first announced in April.\n\nHis order said some trading partners, \"despite having engaged in negotiations, have offered terms that, in my judgment, do not sufficiently address imbalances in our trading relationship or have failed to align sufficiently with the United States on economic and national-security matters.\"\n\nTrump issued a separate order for Canada that raises the rate on Canadian goods subject to fentanyl-related tariffs to 35%, from 25% previously, saying Canada had \"failed to cooperate\" in curbing illicit narcotics flows into the U.S.\n\nThe higher tariffs on Canadian goods contrasted sharply with Trump's decision to grant Mexico a 90-day reprieve from higher tariffs of 30% on many goods to allow time to negotiate a broader trade pact.\n\nCanadian Prime Minister Mark Carney said he was disappointed by Trump's decision, and vowed to take action to protect Canadian jobs and diversify exports.\n\nFlavio Volpe, a member of Carney's Council on Canada-U.S. Relations, told CBC News that the negotiators would stay in Washington for the time being, but if they can't reach an advantageous deal they would \"take a pause and walk away.\n\nIndia is in trade talks with the U.S. after Washington imposed a 25% tariff on New Delhi, a move that could impact about $40 billion worth of its exports, an Indian government source with knowledge of the talks told Reuters on Friday."
    },
    {
        "title": "Wall St Week Ahead-AI gains and strong earnings support Wall Street as tariff woes linger",
        "url": "https://www.livemint.com/market/stock-market-news/wall-st-week-ahead-ai-gains-and-strong-earnings-support-wall-street-as-tariff-woes-linger-11754066079160.html",
        "text": "*\n\nStrong corporate earnings boost market confidence\n\n*\n\nAI-driven companies lead market gains\n\n*\n\nShort-term volatility expected, but long-term outlook positive\n\nBy Saqib Iqbal Ahmed\n\nNEW YORK, July 31 (Reuters) - With more than half of second quarter earnings reported and stocks near record highs, company results have reassured investors about the artificial intelligence trade that has energized Wall Street, even if tariff worries curtailed buying.\n\nWith results in from 297 of the S&P 500 companies as of Thursday, year-on-year earnings growth for the second quarter is now estimated at 9.8%, up from 5.8% estimated growth on July 1, according to LSEG data.\n\nNext week investors will get a peek at earnings from Dow Jones Industrial Average constituents Disney, McDonald's and Caterpillar, for a look at the broader economy. Strong profit reports for these companies could propel the Dow, trading just shy of its December record high, to a fresh peak.\n\nSome 81% of the companies have beaten analyst expectations on earnings, above the 76% average for the past four quarters.\n\n\"The earnings season has been unambiguously better than expected,\" Art Hogan, chief market strategist at B. Riley Wealth in Boston, said.\n\nThe strength of corporate earnings is particularly reassuring for investors after the pummeling sentiment took in the prior quarter due to the twin threats of tariffs and worries over flagging economic growth.\n\n\"The first quarter was a bit more mixed and you had some questionable economic data ... which I think gave the market some pause,\" said Tim Ghriskey, senior portfolio strategist at Ingalls & Snyder in New York.\n\n\"But the second quarter seems to have just been a turnaround,\" Ghriskey said.\n\nThe strength of results for names linked to the artificial intelligence trade - the investment thesis that AI will be a transformative force, driving a significant portion of future economic growth and company profits - is particularly heartening, investors and analysts said.\n\n\"Overall it has been mega caps, growth/technology/AI that is driving a lot of the results,\" Ghriskey said.\n\n\"This is where we want to be exposed in terms of companies ... we're at maximum equity exposures and we're comfortable there.\"\n\nHaving boosted the market for several quarters, the trade ran into rough waters at the start of the year as the emergence of Chinese-founded artificial intelligence startup DeepSeek rattled investors, stoking concerns over heightened competition that could disrupt the dominance of established tech giants at the heart of the AI trade, including Nvidia.\n\nStrong results from Microsoft and Meta Platforms reassured investors that massive bets on AI are paying off.\n\nWorries over AI demand appear overblown, Macro Hive research analyst Viresh Kanabar said.\n\nThe trade related tumult earlier this year prompted many investors to pare equity exposure, particularly to higher-risk growth stocks.\n\nEven after the market rebound - the S&P 500 is up about 6% for the year and near a record high - institutional investors have been slow to return to equities. Overall, investors' equity positioning is still only modestly overweight, according to Deutsche Bank estimates.\n\nStrength in earnings from AI and technology names could draw more investors and lift markets further in coming weeks, analysts said.\n\n\"If you are trying to beat your benchmark and you were underweight any of the AI names you have to chase them,\" B. Riley Wealth's Hogan said.\n\nAfter S&P 500's 2.2% gain in July, the seasonally volatile months of August and September, markets might face some short-term turbulence, Hogan said. Historically, August has marked a pick-up in stock market gyrations that peaks in October.\n\nAugust kicked off with stocks selling off sharply on Friday as new U.S. tariffs on dozens of trading partners and Amazon's unimpressive earnings weighed on sentiment, while a weaker payrolls report added to risk aversion.\n\nBut any near-term market pullback should be seen as a buying opportunity, especially in some of the mega-cap, technology names, Hogan said.\n\nWith big AI names, Alphabet, Microsoft, Nvidia, Meta Platforms and Amazon, commanding about a quarter of the weight in the S&P 500, the health of the AI trade bodes well for the market at an index level, analysts said.\n\n\"We're not saying the weakness isn't there in other parts of the economy,\" Kanabar said."
    },
    {
        "title": "M&amp;B Engineering IPO subscribed 36.2 times on Day 3; Check latest GMP, subscription status, other details",
        "url": "https://www.livemint.com/market/ipo/mb-engineering-ipo-subscribed-36-2-times-on-day-3-check-latest-gmp-subscription-status-other-details-11754058021635.html",
        "text": "M&B Engineering IPO Day 3: M&B Engineering launched its initial public offering (IPO) on July 30, 2025, with the subscription window closing on August 1, 2025. The IPO, with a price range of ₹366– ₹385 per share, includes a new issue of ₹275 crore and an offer-for-sale (OFS) of ₹375 crore from promoters.\n\nOn Day 3, stock market investors subscribed 36.2 times to the M&B Engineering IPO, with total bids of 35,47,18,980, or more than 35.4 crore equity shares, according to BSE data at 7pm.\n\nOut of the three investor segments, the public issue was subscribed 32.55 times in the retail category with 5,76,25,860 shares. The Qualified Institutional Buyers (QIB) portion was subscribed 36.72 times with 19,50,38,078 shares, while the Non-Institutional Investors (NII) category was subscribed 38.24 times with 10,15,62,106 shares.\n\nM&B Engineering IPO Day 3: Latest GMP\n\nAs of Friday, August 1, 2025, the grey market premium (GMP) of the M&B Engineering IPO stood at ₹49 per share. With the upper price band for the issue at ₹385, the shares are expected to be listed at ₹434, a listing premium of 12.73 per cent, according to Investorgain data.\n\nM&B Engineering IPO Day 3: IPO details M&B Engineering's IPO comprises a new issuance of equity shares worth ₹275 crore and an offer-for-sale (OFS) of ₹375 crore by its promoters.\n\nThe firm has announced that 75 per cent of the offer size is allocated to qualified institutional buyers, 15 per cent to non-institutional investors, and the remaining 10 per cent to retail investors.\n\nM&B Engineering Limited has issued 75,74,026 equity shares to 24 anchor investors, securing ₹291.60 crores ahead of its IPO at an upper band of ₹385 per share.\n\nThe funds from the new issuance will be allocated for buying machinery and equipment for the company's manufacturing facilities, repaying debts, covering working capital needs, and supporting overall corporate activities."
    },
    {
        "title": "US copper stabilises, retains premium over global benchmark",
        "url": "https://www.livemint.com/market/commodities/us-copper-stabilises-retains-premium-over-global-benchmark-11754065158240.html",
        "text": "(Updates prices)\n\nBy Polina Devitt\n\nLONDON, Aug 1 (Reuters) - U.S. copper prices stabilised on Friday after the biggest one-day decline on record the previous day as the market continued to assess a surprise move by U.S. President Donald Trump to exclude refined metal from 50% import tariffs.\n\nU.S. September Comex copper futures were last up 1.6% at $4.423 per lb, or $9,751 a metric ton, after plunging by 22% on Thursday.\n\nBenchmark three-month copper on the London Metal Exchange rose 0.4% to $9,645 a ton by 1607 GMT as the dollar fell after U.S. job growth slowed more than expected in July and traders ramped up bets on how many times the Federal Reserve was likely to cut rates this year.\n\nA weaker U.S. currency makes dollar-priced metals more attractive for buyers using other currencies, while lower rates improve prospects for growth-dependent copper.\n\nPrice pressure was applied by rising copper stocks in LME-registered warehouses and the risk of more inflows from massive inventories in the U.S. after Washington excluded refined copper from its import tariffs.\n\nCopper stocks in Comex-owned warehouses are at a 21-year high of 233,977 tons after 176% growth over the March-July period.\n\nAvailable LME stocks , meanwhile, more than doubled in July and are at a three-month high of 127,475 tons.\n\nLimiting the prospect of massive outflows from U.S. stocks in the short term is the Comex copper futures premium over the LME price, even with this week's price falls.\n\n\"Comex copper's premium is now only a few hundred dollars, which is still huge historically but nothing compared to the recent $3,000 premium,\" one metals trader said.\n\nTrump imposed steep tariffs on exports from dozens of trading partners, including Canada, Brazil, India and Taiwan, ahead of Friday's trade deal deadline. China, the world's top metals consumer, is facing an August 12 deadline to reach a durable agreement with Washington.\n\nOn the supply side, Chilean copper giant Codelco said five workers were trapped at the new Andesita unit of its flagship El Teniente mine after a 4.2 magnitude tremor on Thursday. Andesita was due to begin production in the second quarter."
    },
    {
        "title": "US LNG exports surge in July, LSEG data show",
        "url": "https://www.livemint.com/market/commodities/us-lng-exports-surge-in-july-lseg-data-show-11754064914474.html",
        "text": "*\n\nUS exports in July close to record\n\n*\n\nExports to Latin America increase\n\n*\n\nLNG prices in both Asia and Europe fall in July\n\nBy Curtis Williams\n\nHOUSTON, - Exports of U.S. liquefied natural gas jumped to 9.1 million metric tons in July, marking a sharp increase from June as some plants exited maintenance activities and Venture Global's Plaquemines facility ramped up production, preliminary data from financial firm LSEG showed.\n\nThe U.S. is the world's largest exporter of LNG and July's output was its third highest on record. This year the U.S. has seen three of its highest ever monthly LNG production figures, according to LSEG data.\n\nU.S. LNG shipments could have been higher had its third- largest export facility, Freeport LNG, not experienced several unplanned outages, reporting seven power outages at its plants to the Texas Commission on Environmental Quality during the month of July. Its output fell in July to 1.3 million metric tons from 1.4 MT in June, LSEG data showed.\n\nThe U.S. could double its LNG export capacity by 2030, based on projects already under construction and expected to get the financial greenlight as the industry builds momentum following U.S. President Donald's Trump's vow to bolster the country's energy industry. This week Venture Global gave a positive final investment decision for its massive 28 million metric tons per annum CP2 facility in Louisiana.\n\nIn July, Plaquemines, also in Louisiana, exported 1.4 MT of the superchilled gas, compared to 1.2 MT in June, helping the U.S. get to 9.1 MT in July, compared to 8.4 MT in June, LSEG data showed.\n\nGAS PRICES FALL IN EUROPE AND ASIA\n\nEuropean gas prices fell in July to $11.56 per million British thermal unit from $12.38 per mmBtu in June at the European benchmark Title Transfer Facility in the Netherlands, according to LSEG data.\n\nEven so, the softer prices were not enough to deter U.S. LNG exports to Europe, which remained the favored destination. Some 5.25 MT of LNG, or just under 58% of July's total, headed to Europe during July, slightly lower than the 5.53 MT, or 66%, sold in June, LSEG data showed.\n\nU.S. exports to Europe could increase in the coming years following a trade deal earlier this week in which the European Union promised to buy $750 billion of U.S. energy over a five-year period.\n\nIn July, gas prices were also lower in Asia, as the benchmark Japan Korea Marker fell to $12.18 per mmBtu from $12.90 per mmBtu in June.\n\nExports to Asia rose slightly during the month to 1.8 MT, or 20%, of U.S. LNG exports in July, compared to 1.56 MT, or 19%, in June as demand for energy for cooling grew, according to LSEG data.\n\n\"After lackluster Asian LNG demand for much of 2025 so far, hotter July weather drove some improvement,\" bankers from Morgan Stanley told their clients in a report on Wednesday.\n\nUS SELLS MORE LNG CLOSER TO HOME\n\nU.S. LNG exports to South America grew in July as the continent faced colder-than-normal seasonal weather. The U.S. sold 1.03 MT, or 11% of its total LNG exports, to Latin America, with cargoes going to Brazil, Argentina, Colombia and Chile. Cargoes were also sold to several Caribbean countries, including Jamaica, Puerto Rico and the Dominican Republic.\n\nEgypt continued to import U.S. LNG cargoes, buying eight in July, totaling .59 MT of the superchilled gas. There were also six cargoes with .43 MT of LNG that left U.S. ports in July with no clear destination, signaling they were available for orders.\n\nIn July, Canada saw its first LNG shipment from a major plant, with the start-up of LNG Canada in Kitimat, British Columbia. That facility is the first North American plant with direct access to the Pacific Ocean and a shorter sail time to Asia.\n\nLNG Canada exported four cargoes, or .29 MT of LNG, during July, according to LSEG ship tracking data."
    },
    {
        "title": "Global stock index sinks with dollar, bond yields after weak US jobs data",
        "url": "https://www.livemint.com/market/stock-market-news/global-stock-index-sinks-with-dollar-bond-yields-after-weak-us-jobs-data-11754064234677.html",
        "text": "By Sinéad Carew and Samuel Indyk\n\nNEW YORK/LONDON -MSCI's global equities index fell on Friday and the dollar took a dive after weaker than expected U.S. jobs data ramped up expectations for Federal Reserve rate cuts in September as investors also considered U.S. President Donald Trump's latest tariff announcements.\n\nU.S. Treasury yield moved sharply lower after the Labor Department reported that the U.S. economy added 73,000 nonfarm payrolls last month, below the 110,000 expected by economists surveyed by Reuters. July unemployment rose up to 4.2%. June's job growth was revised sharply lower to 14,000 from 147,000.\n\nAfter the data, traders were betting on a 69% probability for a September rate cut compared with 37.7% on Thursday, according to CME Group's FedWatch tool.\n\n\"The market is reacting to the possibility of the economy flipping into recession. The weak jobs data is piling on to weak earnings reports and weak guidance from some corporations,\" said Luke Tilley, Chief Economist, Wilmington Trust.\n\nBut Tilley said perspective is also important when looking at Friday's moves since the market has risen sharply since around mid-April when Trump announced tariff pauses.\n\nInvestors may be \"repositioning around what had been a really strong run and just taking some chips off the table in light of this morning's data,\" he said.\n\nOn Wall Street at 11:32 a.m. the Dow Jones Industrial Average fell 640.77 points, or 1.46%, to 43,488.20, the S&P 500 fell 105.82 points, or 1.66%, to 6,233.84 and the Nasdaq Composite fell 459.00 points, or 2.17%, to 20,663.45.\n\nThe pan-European STOXX 600 index fell 1.81%, suggesting its biggest daily drop since April 9. MSCI's gauge of stocks across the globe fell 12.34 points, or 1.33%, to 917.28, putting it on track for its biggest daily drop since mid-April.\n\nThe softer data added to losses for the global index , which was already losing ground after a host of tariff announcements from Trump the day before.\n\nTrump ordered tariffs ranging from 10% to 41% on U.S. imports from several major trading partners. He increased duties on Canadian goods to 35% from 25% for all products not covered by the U.S.-Mexico-Canada trade agreement. He said a 25% rate for India's U.S.-bound exports, 20% for Taiwan's, 19% for Thailand's and 15% for South Korea's. However, Mexico got a 90-day reprieve from higher tariffs to allow for deal talks.\n\nIn currencies, the greenback reversed course to fall sharply after the data due to increased expectations for rate cuts. Earlier it had found support in fading hopes for U.S. rate cuts.\n\nThe dollar index <=USD>, which measures the greenback against a basket of currencies including the yen and the euro, fell 1% to 99.03.\n\nThe euro was up 1.11% at $1.1542 while against the Japanese yen , the dollar weakened 1.76% to 148.08. The Bank of Japan held interest rates steady on Thursday and revised up its near-term inflation expectations, but Governor Kazuo Ueda sounded a little dovish in the press conference.\n\nSterling strengthened 0.32% to $1.3247 and the Canadian dollar strengthened 0.44% versus the greenback to C$1.38 per dollar.\n\nU.S. Treasury yields plunged after the jobs data and the increase in bets that the Fed will resume interest rate cuts in September.\n\nThe yield on benchmark U.S. 10-year notes fell 11.9 basis points to 4.241%, from 4.36% late on Thursday while the 30-year bond yield fell 6.6 basis points to 4.8191%.\n\nThe 2-year note yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 21.6 basis points to 3.733%, from 3.951% late on Thursday.\n\nIn energy markets, oil prices fell more than 2% after the jobs data and on the prospects of a possible increase in production by OPEC and its allies. Oil had settled 1% lower on Thursday.\n\nU.S. crude fell 2.66% to $67.42 a barrel and Brent fell to $69.72 per barrel, down 2.76% on the day.\n\nElsewhere, gold prices rallied to a one-week high, after the weak jobs report boosted policy easing expectations and fresh tariff announcements also spurred safe-haven demand.\n\nSpot gold rose 1.83% to $3,350.10 an ounce."
    },
    {
        "title": "Oil falls more than $2 a barrel on worries about OPEC  supply, US jobs data",
        "url": "https://www.livemint.com/market/commodities/oil-falls-more-than-2-a-barrel-on-worries-about-opec-supply-us-jobs-data-11754063136176.html",
        "text": "By Erwin Seba\n\nHOUSTON -Oil prices fell more than $2 a barrel on Friday morning on jitters about a possible increase in production by OPEC and its allies, while weaker-than-expected U.S. jobs report fed worries about demand.\n\nBrent crude futures were down $2.04, or 2.85%, at $69.66 a barrel by 9:52 a.m. CDT . U.S. West Texas Intermediate crude was down $1.95, or 2.82%, at $67.31. Both benchmarks remained on track for weekly gains.\n\nThree people familiar with discussions among OPEC members and allied producers said the group may reach an agreement as early as Sunday to boost production by 548,000 barrels per day in September.\n\nA fourth source familiar with OPEC talks said discussions on volume were ongoing and the hike could be smaller.\n\nThe U.S. Labor Department said the country added 73,000 jobs in July, lower than economists had forecast, raising the national unemployment rate to 4.2% from 4.1%.\n\n\"We can blame U.S. President Donald Trump with the tariffs or we can blame the Federal Reserve for not raising interest rates,\" said Phil Flynn, senior analyst with Price Futures Group. \"It looks like the Fed misjudged their decision on Wednesday.\"\n\nOn Wednesday, the Fed voted to keep interest rates unchanged, drawing criticism from Trump and a chorus of Republican legislators.\n\nOil lost more than 1% in the previous session, though Brent remained on course for a weekly gain of 4.6%, with WTI headed for a weekly gain of 6.5%.\n\nOil traders have focused on the potential impact of U.S. tariffs, with tariff rates on U.S. trading partners largely set to take effect from next Friday.\n\nTrump signed an executive order on Thursday imposing tariffs ranging from 10% to 41% on U.S. imports from dozens of countries and foreign territories that failed to reach trade deals by his August 1 deadline, including Canada, India and Taiwan.\n\nPartners that managed to secure trade deals include the European Union, South Korea, Japan and Great Britain.\n\n\"We think the resolution of trade deals to the satisfaction of the market – more or less, barring a few exceptions – has been the key driver for oil price bullishness in recent days, and further progress on trade talks with China in future could be a further confidence booster for the oil market,\" said Suvro Sarkar at DBS Bank.\n\nPrices were also supported this week by Trump's threats to impose 100% secondary tariffs on Russian crude buyers as he seeks to pressure Russia into halting its war in Ukraine. This has stoked concern over potential disruption to oil trade flows and the removal of some oil from the market.\n\nJP Morgan analysts said on Thursday that Trump's threatened penalties on China and India over their purchases of Russian oil potentially put 2.75 million barrels per day of Russian seaborne oil exports at risk. China and India are the world's second and third-largest crude consumers respectively."
    }
]